Repository: xhoy/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: de

source: This file is saved in the <filename>bin</filename>directory. It facilitates the generation of report in the command line.
de: Diese Datei befindet sich im Verzeichnis <filename>bin/</filename>. Durch sie ist es möglich, Statistiken auf der Kommandozeile zu generieren.

source: As an example, see the command line call in Script 19.1.
de: Exemplarisch soll hierzu folgender Kommandozeilenaufruf angegeben werden:

source: <emphasis>Script 19.1. Generating a report from the command line.</emphasis>
de: <emphasis>Skript 19.1. Generieren einer Statistik auf der Kommandozeile.</emphasis>

source: A report from the stat configuration "Stat# 10004" is generated and saved as csv in the <filename>/output/dir</filename> directory.
de: Dabei wird eine Statistik aus der Statistikkonfiguration "Stat# 10004" generiert und als csv in das Verzeichnis <filename>/output/dir</filename> gespeichert.

source: The generated report can also be sent as an e-mail. More information can be called up with the command in Script 19.2.
de: Ferner kann die generierte Statistik auch per Email versandt werden. Mehr Informationen erhält man wie in Skript 19.2 geschildert.

source: <emphasis>Script 19.2. Getting information about the otrs.GenerateStats.pl file.</emphasis>
de: <emphasis>Skript 19.2. Aufruf der Hilfe von otrs.GenerateStats.pl.</emphasis>

source: Automated stat generation - Cronjob
de: Automatisiertes Generieren von Statistiken - Cron

source: It usually does not make sense to generate reports manually via the command line, as the stats module has a convenient graphical user interface. However, generating reports manually does make sense when combined with a Cronjob.
de: Sinnvoll ist das Generieren von Statistiken per Hand über die Kommandozeile natürlich nicht unbedingt, da das Statistikmodul eine geeignete grafische Oberfläche bietet. Interessant wird die Generierung von Statistiken per Kommandozeile aber in Kombination mit einem Cronjob.

source: Imagine the following scenario: On the first day of every month, the heads of department want to receive a report for the past month. By combining a cronjob and command line call the reports can be sent to them automatically by e-mail.
de: Folgendes Szenario ist denkbar: Ein Abteilungsleiter wünscht pünktlich zum ersten eines Monats eine Statistik zum abgelaufenen Monat. Durch die Kombination Cronjob und Kommandozeilenaufruf ist man in der Lage automatisiert zu Beginn eines Monats dem Abteilungsleiter die gewünschte Statistik per Email zukommen zu lassen.

source: Static stats
de: Statische Statistiken

source: The stats module facilitates the generation of static statistics. For every static stat a file exists in which its content is precisely defined.
de: Das Statistikmodul bietet die Möglichkeit statische Statistiken zu generieren. Für jede statische Statistik gibt es eine Datei, in der die Inhalte der Statistik genau definiert sind.

source: This way, very complex stats can be generated. The disadvantage is that they are not particularly flexible.
de: Vorteil dieser Art von Statistik ist, dass dadurch sehr komplexe Statistiken erzeugt werden können. Der Nachteil ist wiederum die mangelnde Flexibilität dieser Statistiken.

source: The files are saved in the directory <filename>Kernel/System/Stats/Static/</filename>.
de: Gespeichert werden diese Dateien unter folgendem Pfad: <filename>Kernel/System/Stats/Static/</filename>.

source: Using old static stats
de: Wiederverwerten alter statischer Statistiken

source: Prior OTRS versions 1.3 and 2.0 already facilitated the generation of stats / reports. Various reports for OTRS versions 1.3 and 2.0 which have been specially developed to meet customers' requirements can be used in recent OTRS versions too.
de: Bereits OTRS 1.3 und 2.0 boten die Möglichkeit Statistiken zu generieren. Eine Vielzahl der Statistiken, die für OTRS-Versionen 1.3 und 2.0 speziell auf Kundenwunsch entwickelt wurden, können wiederverwendet werden.

source: The files must merely be moved from the <filename>Kernel/System/Stats/</filename> path to <filename>Kernel/System/Stats/Static/</filename>. Additionally the package name of the respective script must be amended by "::Static".
de: Diese Dateien müssen hierzu lediglich aus dem Pfad <filename>Kernel/System/Stats/</filename> in den Pfad <filename>Kernel/System/Stats/Static/</filename> verschoben werden. Ferner muss die Paketangabe des jeweiligen Skripts um "::Static" ergänzt werden.

source: The following example shows how the first path is amended.
de: Das folgende Beispiel zeigt die Erweiterung des Paketnamens.

source: Default stats
de: Standardstatistiken

source: "It is not always necessary to reinvent the wheel..."
de: "Man muss das Rad nicht immer neu erfinden."

source: The stats module provides various default reports. Reports which are of interest for all OTRS users will in future be added to the default reports set of the stats module package. Default reports are saved in the stats module xml format in the<filename>scripts/test/sample/</filename> directory.
de: Deshalb liefert das Statistikmodul automatisch Standardstatistiken mit. Statistiken, die für alle OTRS-Benutzer interessant sind, werden zukünftig als Defaultstatistik im Statistik-Modul-Paket ergänzt. Gespeichert werden die Defaultstatistiken im XML-Format des Statistikmoduls im Verzeichnis <filename>scripts/test/sample/</filename>.

source: Additional applications
de: Zusätzliche Applikationen

source: You can install additional application packages to extend the functionality of the OTRS framework. This can be done via the package manager from the Admin page, which downloads the applications from an online repository and manages package dependencies. It is also possible to install packages from local files.
de: Zusätzlich zum OTRS-Framework haben Sie die Möglichkeit, weitere Applikationen aus einem Online-Verzeichnis über das Admin-Interface (Paketmanager) zu installieren. Dieser lädt Applikationen von einem Online-Verzeichnis herunter und löst die Paketabhängigkeiten auf. Es ist zudem möglich, Pakete in Form lokaler Dateien zu installieren, z. B. für den Fall, dass Ihr OTRS keine Internetverbindung hat.

source: The FAQ is the Knowledge Base component. It supports editing and viewing of FAQ articles. Articles can be viewed and restricted to agents, customer users or anonymous users. They can also be structured in groups, and be in different languages.
de: Mit Hilfe des FAQ-Systems kann eine Wissensdatenbank aufgebaut und verwaltet werden. Einträge lassen sich nur intern oder auch extern, d.h. für alle Kunden oder komplett öffentlich, freischalten. Einträge können nach Sprache oder nach Kategorien erstellt und sortiert werden.

source: Performance Tuning
de: Leistungsverbesserung

source: Presented below is a list of performance enhancing techniques for your OTRS installation, covering configuration, coding, memory use and more.
de: Hier finden Sie eine Liste verschiedener Techniken der Leistungssteigerung Ihrer OTRS-Installation, einschließlich Konfiguration, Programmierung, Speichernutzung und mehr.

source: There are several options to improve OTRS performance.
de: Es gibt verschiedene Ansätze zur Leistungssteigerung von OTRS.

source: There are two backend modules for the ticket index:
de: Zur Verfügung stehen zwei Backend-Module für den Ticket Index:

source: Using Kernel::System::Ticket::IndexAccelerator::RuntimeDB (default), generate each queue view on the fly from the ticket table. You will not have performance trouble until you have about 60,000 open tickets in your system.
de: Kernel::System::Ticket::IndexAccelerator::RuntimeDB (Standard), generiere jede Queue-Ansicht dynamisch aus der Ticket Tabelle. Sie werden keine Probleme mit der Leistung bekommen bis zu etwa 60.000 Tickets (oder 6000 offenen) in Ihrem System.

source: Kernel::System::Ticket::IndexAccelerator::StaticDB, the most powerful module, should be used when you have above 80,000 open tickets. It uses an extra ticket_index table, which works like a view. Use <filename>bin/otrs.RebuildTicketIndex.pl</filename> for generating an initial index build after switching backends.
de: Kernel::System::Ticket::IndexAccelerator::StaticDB, das leistungsfähigste Modul. Es sollte ab 80.000 Tickets oder mehr als 6000 offenen eingesetzt werden. Benutzt eine extra ticket_index Tabelle, arbeitet wie eine Ansicht (View). Führen Sie <filename>bin/otrs.RebuildTicketIndex.pl</filename> zum erstmaligen Aufbau des Index aus.

source: You can change the IndexAccelerator via SysConfig.
de: Sie können den IndexAccelerator per SysConfig einstellen.

source: There are two different backend modules for the ticket/article storage:
de: Es stehen zwei Module für das Speichern der Tickets und Artikel bereit:

source: Configure Kernel::System::Ticket::ArticleStorageDB (default) to store attachments, etc. in the database. Note: Don't use it with large set ups.
de: Kernel::System::Ticket::ArticleStorageDB (Standard), speichert Anhänge u. A. in der Datenbank. Merke: Benutzen Sie diese Option nicht für größere Systeme.

source: Pro: If your webserver user isn't the 'otrs' user, use this module to avoid file permission problems.
de: Pro: Ist der Benutzer, unter dem der Webserver läuft, nicht der Benutzer 'otrs', können Sie mit diesem Modul Dateiberechtigungsprobleme vermeiden.

source: Con: It is not advisable to store attachments in your database. Take care that your database is able to store large objects. E.g. Configure MySQL with "set-variable = max_allowed_packet=8M" to store 8 MB objects (the default is 2M).
de: Contra: Es ist nicht wirklich ratsa,, Anhänge in Ihrer Datenbank zu speichern. Achten Sie darauf, dass Ihre Datenbank das kann. Für MySQL setzen Sie in dessen Konfiguration bspw. "set-variable = max_allowed_packet=8M", um 8 MB große Objekte zu speichern (Standard ist 2M).

source: Configure Kernel::System::Ticket::ArticleStorageFS to store attachments etc. on the local file system. Note: Recommended for large setups.
de: Kernel::System::Ticket::ArticleStorageFS, speichert Anhänge u. A. im lokalen Filesystem ab. Merke: Benutzen Sie dies für große Installationen.

source: Pro: It is fast!
de: Pro: Schneller!

source: Con: Your web server user should be the 'otrs' user. Also, if you have multiple front-end servers, you should make sure the filesystem is shared between the servers. So place it on an NFS share or preferably a SAN or similar solution.
de: Contra: Der Benutzer, unter dem der Webserver läuft, sollte der Benutzer 'otrs' sein (Dateisystemberechtigungen!). Wenn Sie mehrere OTRS-Frontendserver haben, müssen Sie sicherstellen, dass das Dateisystem gemeinsam genutzt wird. Sie können es z. B. auf ein NFS-Share oder vorzugsweise ein SAN oder eine vergleichbare Lösung legen.

source: Note: you can switch from one back-end to the other on the fly. You can switch the backend in the SysConfig, and then run the command line utility <filename>otrs.ArticleStorageSwitch.pl</filename> to put the articles from the database onto the filesystem or the other way around. You can use the <emphasis>-s</emphasis> and <emphasis>-d</emphasis> options to specify the source and destination back-ends. Please note that the whole process can take considerable time to run, depending on the number of articles you have and the available CPU power and/or network capacity.
de: Merke: Sie können während des Betriebs von einem Backend auf das andere wechseln. Stellen Sie dazu das Backend in der SysConfig um, und führen Sie <filename>otrs.ArticleStorageSwitch.pl</filename> aus, um die Artikel aus der Datenbank ins Dateisystem zu überführen oder umgekehrt. Sie können die <emphasis>-s</emphasis> und <emphasis>-d</emphasis> Option verwenden, um das Quell- und Zielbackend anzugeben. Der Prozess kann eine ganze Weile dauern, je nach Menge der Artikel sowie System- und Netzwerkleistung.

source: <emphasis>Script 21.1 Switching storage back-ends from database to filesystem.</emphasis>
de: <emphasis>Skript 21.1 Wechsel des TicketStorage-Backends von Datenbank zu Dateisystem.</emphasis>

source: Archiving Tickets
de: Tickets archivieren

source: As OTRS can be used as an audit-proof system, deleting closed tickets may not be a good idea. Therefore we implemented a feature that allows you to archive tickets.
de: Da OTRS als revisionssicheres System betrieben werden kann, ist das Löschen von geschlossenen Tickets möglicherweise nicht empfehlenswert. Daher haben wir eine Funktion implementiert, mit der Sie Tickets archivieren können.

source: Tickets that match certain criteria can be marked as "archived" These tickets are not accessed if you do a regular ticket search or run a Generic Agent job. The system itself does not have to deal with a huge amount of tickets any longer as only the "latest" tickets are taken into consideration when using OTRS. This can mean a huge performance gain on large systems.
de: Kokret ist darunter zu verstehen, dass Tickets, die bestimmte Kriterien erfüllen, als "archiviert" markiert werden. Diese Tickets werden dann bei regulären Suchabfragen oder von GenericAgent-Jobs nicht mehr erfasst. Somit muss sich das System mit einer großen Ticketmenge nicht mehr befassen, weil dann nur noch die "aktuellsten" Tickets betrachtet werden. Das kann auf großen Systemen eine signifikante Performanceverbesserung bewirken.

source: To use the archive feature simply follow these steps:
de: Befolgen Sie folgende Schritte, um die Archivierungsfunktion zu nutzen:

source: Activate the archive system in SysConfig
de: Archivsystem in der SysConfig aktivieren

source: In the Admin page, go to SysConfig and select the group <literal>Ticket</literal>. In <literal>Core::Ticket</literal> you find the option <literal>Ticket::ArchiveSystem</literal> which is set to "no" by default. Change this setting to "yes" and save this change.
de: Wählen Sie in der SysConfig die Gruppe <literal>Ticket</literal> aus. In <literal>Core::Ticket</literal> finden Sie die Option <literal>Ticket::ArchiveSystem</literal>, die standardmäßig auf "Nein" steht. Ändern Sie diese auf "Ja" und speichern Sie die Änderung ab.

source: Define a GenericAgent job
de: Anlegen eines GenericAgent-Jobs

source: Job Settings
de: Job-Einstellungen

source: Provide a name for the archiving job, and select proper options to schedule this job.
de: Geben Sie dem Job einen geeigneten Namen und angemessene Optionen.

source: The ticket filter is searches for tickets that match the selected criteria. It might be a good idea to only archive those tickets in a closed state that have been closed a few months before.
de: Der Ticketfilter ist eine Ticketsuche, die Tickets nach bestimmten Kriterien auswählt. Es könnte empfehlenswert sein, nur Tickets zu archivieren, die seit einigen Monaten im Status "geschlossen" sind.

source: Ticket Action
de: Ticket-Aktion

source: In this section, set the field labeled "Archive selected tickets" to "archive tickets".
de: Im Abschnitt "Ticket-Aktion" werden Sie eine Aktion "Ausgewählte Tickets archivieren" finden. Wählen Sie dort "Tickets archivieren" aus.

source: Save the job
de: Job speichern

source: At the end of the page you will find an option to save the job.
de: Am Ende der Seite finden Sie einen Knopf zum Speichern des Jobs.

source: Affected tickets
de: Betroffene Tickets

source: The system will display all tickets which will be archived when executing the Generic Agent job.
de: Das System wird dann alle Tickets anzeigen, die beim Ausführen des GenericAgent-Jobs archiviert werden.

source: On the Admin page, select GenericAgent and add a new job there. <placeholder type="orderedlist" id="0"/>
de: Wählen Sie im Administrationsbereich den "GenericAgent" aus und legen Sie dort einen neuen Job an. <placeholder type="orderedlist" id="0"/>

source: Ticket Search
de: Ticketsuche

source: When you search for tickets, the system default is to search tickets which are not archived. If you want to search through archived tickets also, simply add "archive search" while defining search criteria.
de: Wenn Sie nun nach Tickets suchen, werden standardmäßig nur Tickets gefunden, die nicht archiviert sind. Wenn Sie auch in archivierten Tickets suchen wollen, fügen Sie "Archivsuche" zu Ihren Suchkriterien hinzu.

source: Database
de: Datenbank

source: DB issues vary by the database being used. Study the documentation for your database or check with your database administrator.
de: Einstellungen sind immer spezifisch für die jeweils eingesetzte Datenbank. Bei Problemen lesen Sie die Dokumentation und fragen Sie Ihren Datenbankadministrator.

source: If you use the MySQL table type MyISAM (which is the default), and have deleted a large part of a table or if you have made many changes to a table with variable-length rows (tables that have VARCHAR, BLOB or TEXT columns), you need to defragment the datafile (tables) with the "optimize" command.
de: Wenn Sie den Tabellentyp MyISAM (Standard) benutzen, und einen großen Teil einer Tabelle gelöscht haben, oder wenn Sie sehr viele Änderungen an einer Tabelle mit Zeilen variabler Länge vorgenommen haben (Tabellen mit VARCHAR, BLOB oder TEXT Spalten), sollten Sie die Datendateien mit dem "optimize" Kommando behandeln.

source: You should try this if the mysqld daemon needs a lot of your CPU time. Optimize the tables - ticket, ticket_history and article (see Script 21.2 below).
de: Dies bietet sich an, wenn MySQL viel CPU Zeit braucht. Optimieren Sie die Tabellen ticket, ticket_history und article.

source: <emphasis>Script 21.2. Optimizing data base tables.</emphasis>
de: <emphasis>Skript 21.2. Optimierung von Datenbanktabellen.</emphasis>

source: PostgreSQL is best tuned by modifying the postgresql.conf file in your PostgreSQL data directory. For advice on how to do this, see these articles:
de: PostgreSQL konfigurieren Sie am besten in der postgresql.conf Datei in Ihrem PostgreSQL Datenverzeichnis. Hier gibt es Hilfe dazu:

source: If performance is still not satisfactory, we suggest that you join the PostgreSQL Performance mailing list ( <ulink url="http://www.postgresql.org/community/lists/">http://www.postgresql.org/community/lists/</ulink> ), and ask questions there. The folks on the PostgreSQL list are very friendly and can probably help.
de: Ist die Leistung immer noch nicht genügend, empfehlen wir, Fragen auf der "PostgreSQL Performance Mailing Liste" ( <ulink url="http://www.postgresql.org/community/lists/"> http://www.postgresql.org/community/lists/ </ulink> ) zu stellen. Die Teilnehmer der PostgreSQL Liste sind sehr freundlich und können wahrscheinlich helfen.

source: Of course you should use mod_perl 2.0 ( <ulink url="http://perl.apache.org/"><citetitle>http://perl.apache.org/</citetitle></ulink> ). It's much faster (~ * 100) than pure cgi. But it needs more RAM.
de: Natürlich empfehlen wir mod_perl 2.0 (<ulink url="http://perl.apache.org/">http://perl.apache.org/</ulink>). Es ist sehr viel schneller (etwa um den Faktor 100) als pures CGI, braucht aber auch mehr Speicher. Ihr httpd wird mit mod_perl also größer sein.

source: Pre-established database connections
de: Persistente Datenbankverbindungen

source: You can have the database connections pre-established on startup of the web server. This saves time (see README.webserver).
de: Sie können die Datenbankverbindung bereits beim Start des Webservers herstellen lassen. Dies spart ebenso Zeit (siehe auch README.webserver).

source: Preloaded modules - startup.pl
de: Vorgeladene Module - startup.pl

source: Use the startup script <filename>scripts/apache2-perl-startup.pl</filename> for preloaded/precompiled Perl modules on your mod_perl webserver to be faster, with a smaller memory footprint (see README.webserver).
de: Nutzen Sie das Start Skript <filename>scripts/apache2-perl-startup.pl</filename>, um die Perl Module vorzuladen (siehe README.webserver). Dadurch wird der Webserver schneller und braucht weniger Speicher.

source: Reload Perl modules when updated on disk
de: Perl Module bei Änderung neu laden

source: By default Apachee::Reload is used in scripts/apache2-httpd.include.conf. Disable it and you will get 8% more speed. But remember to restart the web server if you install any modules via the OTRS Package Manager, or any values in your SysConfig or in Kernel/Config.pm. Important: this would also mean you can't use the OTRS Package Manager via the web interface, you need to use the command line variant - <filename>bin/otrs.PackageManager.pl</filename>.
de: Standardmäßig wird Apache::Reload in scripts/apache2-httpd.include.conf eingesetzt. Deaktivieren Sie es und die Geschwindigkeit steigt um etwa 8%. Ab nun müssen Sie den Webserver neu starten, wenn Sie irgendetwas ändern! Wichtig: Dies hat zur Folge, dass der OTRS-Paket-Manager nicht mehr über das Web-Interface bedient werden kann sondern nur noch auf der Kommandozeile - <filename>bin/otrs.PackageManager.pl</filename>.

source: Choosing the Right Strategy
de: Die richtige Strategie wählen

source: If you have a really large installation, say over 1,000 new tickets per day and over 40 agents, it is a good idea to read "Choosing the Right Strategy" ( <ulink url="http://perl.apache.org/docs/1.0/guide/strategy.html"><citetitle>http://perl.apache.org/docs/1.0/guide/strategy.html</citetitle></ulink> ).
de: Bei wirklich großen Installationen (über 1000 neue Tickets am Tag, über 40 Agenten) ist es eine sehr gute Idee, den Artikel "Choosing the Right Strategy" (in englisch) zu lesen (<ulink url="http://perl.apache.org/docs/1.0/guide/strategy.html">http://perl.apache.org/docs/1.0/guide/strategy.html</ulink>).

source: If your bandwidth is small, use mod_deflate for Apache2. If you have an html page with 45k, mod_gzip/mod_deflate compresses it to about 7k. The drawback is that this increases the load on the server side.
de: Falls Ihre Bandbreite ein wenig schmal sein sollte, benutzen Sie mod_deflate für Apache2. Eine HTML-Seite von 45k wird mod_gzip/mod_deflate auf etwa 7k zusammendrücken. Allerdings wird dadurch die Last auf dem Server erhöht.

source: Backing up the system
de: Datensicherung

source: This chapter describes the backup and restore of the OTRS data.
de: In diesem Kapitel wird beschrieben, wie alle relevanten Daten der OTRS-Installation gesichert und wieder hergestellt werden können.

source: Backup
de: Datensicherung

source: There are two types of data to backup: application files (e.g. the files in <filename>/opt/otrs</filename>), and the data stored in the database.
de: Bei einem Backup gibt es zwei Arten von Datensicherung, die Applikation (z. B. <filename>/opt/otrs/</filename>) und die Datenbank.

source: To simplify backups, the script <filename>scripts/backup.pl</filename> is included with every OTRS installation. It can be run to backup all important data (see Script 22.1 below).
de: Um Backups zu vereinfachen, wird ein <filename>scripts/backup.pl</filename> mitgeliefert, das alle benötigten Komponenten sichert.

source: <emphasis>Script 22.1. Getting help about the OTRS backup mechanism.</emphasis>
de: <emphasis>Skript 22.1. Aufruf der Hilfe des Backup-Mechanismus.</emphasis>

source: Execute the command specified in Script 22.2 to create a backup:
de: Ein Backup kann also z. B. mit folgendem Befehl erstellt werden:

source: <emphasis>Script 22.2. Creating a backup.</emphasis>
de: <emphasis>Abb. 22.2. Erstellen einer Datensicherung.</emphasis>

source: All data was stored in the directory <filename>/backup/2010-09-07_14-28/</filename> (see Script 22.3 below). Additionally, the data was saved into a .tar.gz file.
de: Alle Daten wurden in das Verzeichnis <filename>/backup/2005-09-12_14-28/</filename> gesichert und dort, getrennt nach Art der Daten, in einzelne .tar.gz-Dateien gespeichert.

source: <emphasis>Script 22.3. Checking the backup files.</emphasis>
de: <emphasis>Skript 22.3. Prüfung der gesicherten Dateien.</emphasis>
