Repository: xhoy/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: de

source: Restore
de: Wiederherstellung der Daten

source: To restore a backup, the saved application data has to be written back into the installation directory, e.g. <filename>/opt/otrs</filename>. Also the database has to be restored.
de: Um ein Backup wieder einzuspielen, müssen die Applikation (z. B. nach <filename>/opt/otrs/</filename>) und die Datenbank wieder hergestellt werden.

source: A script <filename>scripts/restore.pl</filename> (see Script 22.4 below), which simplifies the restore process, is shipped with every OTRS installation. It supports MySQL and PostgreSQL.
de: Um Backups einspielen zu können, wird ein <filename>scripts/restore.pl</filename> mitgeliefert, das die benötigten Komponenten wieder zurück sichert. Es unterstützt MySQL und PostgreSQL.

source: <emphasis>Script 22.4. Getting help about the restore mechanism.</emphasis>
de: <emphasis>Skript 22.4. Aufruf der Hilfe des Restore-Mechanismus.</emphasis>

source: Data that is stored, for example, in the directory <filename>/backup/2010-09-07_14-28/</filename>, can be restored with the command specified in Script 22.5, assuming the OTRS installation is at <filename>/opt/otrs</filename>.
de: Daten, die im Verzeichnis <filename>/backup/2005-09-12_14-28/</filename> gesichert wurden, können bei einer OTRS-Installation in <filename>/opt/otrs</filename> folgendermaßen zurückgespielt werden.

source: <emphasis>Script 22.5. Restoring OTRS data.</emphasis>
de: <emphasis>Skript 22.5. Wiederherstellung des Systems.</emphasis>

source: Additional Resources
de: Weitere Quellen

source: We try to support you with the very latest information about OTRS. We also give you a good way to provide us with your feedback.
de: Wir unterstützen Sie mit den aktuellsten Informationen über OTRS und geben Ihnen die Möglichkeit, uns mit Feedback zu versorgen.

source: You can find our project homepage at <ulink url="http://www.otrs.org/"><citetitle>http://www.otrs.org/</citetitle></ulink> (see Figure A-1 below).
de: Sie finden unsere Projekt-Homepage unter <ulink url="http://www.otrs.org/"><citetitle>http://www.otrs.org/</citetitle></ulink>.

source: <emphasis>Figure A-1. OTRS Homepage.</emphasis>
de: <emphasis>Abb. A-1. OTRS-Homepage.</emphasis>

source: Mailing lists
de: Mailinglisten

source: The Table A-1 shows you our different community mailing lists.
de: Die folgende Tabelle gibt einen Überblick darüber, welche Community-Mailinglisten es derzeit für OTRS gibt und wie diese zu erreichen sind:

source: Mailinglists
de: Mailinglisten

source: Low traffic list, in English, for announcements of new OTRS releases and security issues.
de: Ankündigungen zu OTRS (neue Versionen, Updates, ...) mit wenig Verkehr.

source: Medium to high traffic list, in English, where you can find all sorts of questions on, and support for the product.
de: Benutzer-Fragen und -Diskussionen rund um OTRS (englischsprachig) mit mittel bis viel Verkehr.

source: otrs-de@otrs.org
de: ç

source: Medium to high traffic list, in German, where you can find all sorts of questions on, and support for, the product.
de: Benutzer-Fragen und -Diskussionen rund um OTRS (deutschsprachig) mit mittel bis viel Verkehr.

source: Medium traffic list, in English, where the OTRS developers discuss various design and implementation issues.
de: Mailingliste für die Entwickler von OTRS mit wenig Verkehr.

source: Low traffic list, in German, with all sorts of questions on the documentation of the product.
de: Deutsche Diskussion über die OTRS-Dokumentation mit wenig Verkehr.

source: Low traffic list, in English, for internationalization and localization questions. If you are or want to become a translator of the OTRS project or have any problems with one of our applications in an international environment, this is where you should connect.
de: Englische Mailingliste mit wenig Verkehr für Übersetzungs- und Lokalisierungsfragen. Wenn Sie OTRS übersetzen oder übersetzen wollen oder Probleme mit einer unserer Applikationen in einer internationalen Umgebung haben, sollten Sie sich in diese Liste eintragen.

source: Very high traffic list of CVS commit notifications.
de: Benachrichtigungen über geänderte CVS-Dateien im Quellcode von OTRS mit sehr viel Verkehr.

source: To subscribe to any of this lists, visit the following link: <ulink url="http://lists.otrs.org/"><citetitle>http://lists.otrs.org/</citetitle></ulink>.
de: Um eine Liste zu abonnieren besuchen Sie folgenden Link: <ulink url="http://lists.otrs.org/"><citetitle>http://lists.otrs.org/</citetitle></ulink>.

source: Bug tracking
de: Fehler berichten

source: To submit bugs visit <ulink url="http://bugs.otrs.org/"><citetitle>http://bugs.otrs.org/</citetitle></ulink> (see Figure A-2 below). Please take note of the difference between a bug and a configuration issue. Configuration issues are problems that you encounter when setting a system, or general questions on the use of OTRS. Bug reports should only be used for issues with the source code of OTRS itself, or to file enhancements for OTRS. All your bug reports and enhancement requests are very welcome in the bug tracker.
de: Um uns Fehler in OTRS mitzuteilen, besuchen Sie uns unter: <ulink url="http://bugs.otrs.org/"><citetitle>http://bugs.otrs.org/</citetitle></ulink>. Bitte unterscheiden Sie zwischen Fehlermeldungen und Konfigurationsproblemen. Letztere sind Probleme, die beim Einrichten eines Systems auftreten können, oder allgemeinde Fragen zur Verwendung von OTRS. Fehlerberichte im Bugtracker sollten nur für Probleme im Quellcode von OTRS eingestellt werden, oder um Verbesserungsvorschläge zu unterbreiten. Alle Ihre Fehlerberichte und Verbesserungsvorschläge sind im Bugtracker herzlich willkommen.

source: Bugtracking Tool
de: Fehlerverfolgungssystem

source: <emphasis>Figure A-2. Bug tracker.</emphasis>
de: <emphasis>Abb. A-2. Fehlerverfolgungssystem.</emphasis>

source: For configuration issues, you should either use the <ulink url="http://www.otrs.com/en/support/"><citetitle>commercial support, available from OTRS.com</citetitle></ulink>, or the public mailing lists.
de: Für Konfigurationsprobleme sollten Sie entweder den <ulink url="http://www.otrs.com/en/support/"><citetitle>kommerziellen Support von OTRS.com</citetitle></ulink> oder die öffentlichen Mailinglisten verwenden.

source: You help us improve the product by reporting bugs. We appreciate your input!
de: Wenn Sie uns Fehler berichten, tragen Sie zur Verbesserung des Produkts bei. Wir freuen uns auf Ihre Mitwirkung!

source: Commercial Support
de: Kommerzieller Support

source: For services (support, consulting, development, and training) you can contact the company behind OTRS, OTRS AG. They have offices in Germany, USA, Mexico, the Netherlands and other countries. Look at their website for contact information: <ulink url="http://www.otrs.com/en/corporate-navigation/contact/"><citetitle>http://www.otrs.com/en/corporate-navigation/contact/</citetitle></ulink>
de: Für Dienstleistungen (Support, Consulting, Entwicklung und Schulungen) können Sie die Firma hinter OTRS kontaktieren, die OTRS AG. Sie hat Niederlassungen in Deutschland, USA, Mexiko, Holland und weiteren Ländern. Schauen Sie sich die Website an, um Kontaktinformationen zu erhalten: <ulink url="http://www.otrs.com/de/corporate-navigation/contact/"> <citetitle>http://www.otrs.com/de/corporate-navigation/contact/</citetitle> </ulink>.

source: Overview of all configuration parameters
de: Übersicht aller Konfigurationsparameter

source: The content of this appendix is generated automatically with xml2docbook.pl.
de: Dieser Inhalt wird automatisch mit Hilfe von xml2docbook.pl generiert.

source: Credits
de: Danksagungen

source: OTRS is an open source project, and we wish to thank many people for their help and support. The following list is surely incomplete, and we apologize for that! Just drop us a note if you are not on this list.
de: Wie die meisten OpenSource-Projekte möchten auch wir vielen Leuten für Ihre Hilfe herzlich danken. Dies ist eine offene Liste in der wir sicher den Einen oder Aderen unabsichtlich vergessen haben, sorry dafür! Meldet Euch einfach, wenn Euer Name hier fehlt!

source: The following persons have especially pushed the project or are still active supporters:
de: Folgende Personen haben das Projekt besonders unterstützt bzw. helfen immernoch aktiv mit:

source: Robert Kehl, who created the Win32-installer for the 1.x releases. Thanks a lot, Robert!
de: Robert Kehl, der den Win32-Installer für die 1.x Versionen alleine kreiert hat. Dank Dir, Robert!

source: Torsten Werner, who maintains the Debian-installer for OTRS. Thanks a lot, Torsten, by making OTRS also available for the Debian community.
de: Torsten Werner, der sich aktiv um den Debian Installer kümmert und dafür sorgt, dass OTRS auch bequem unter Debian verfügbar ist. Vielen Dank, Torsten!

source: Nils Jeppe (mirror Hamburg, Germany), Bryan Fullerton (mirror Toronto, Canada), Eberhard Mönkeberg (mirror Göttingen, Germany), Timo Dreger (mirror Düsseldorf, Germany) and Netmonic (mirror Vienna, Austria), who are mirroring our FTP server. Thanks a lot, with your help it is always possible to download OTRS quickly!
de: Nils Jeppe (Mirror Hamburg, Germany), Bryan Fullerton (Mirro Toronto, Canada), Eberhard Moenkeberg (Mirror Göttingen, Deutschland), Timo Dreger (Mirror Düsseldorf, Deutschland) und Netmonic (Mirror Wien, Österreich), die unseren ftp-Server spiegeln. Vielen Dank an Euch, durch Eure Hilfe ist immer ein schneller Download von OTRS möglich!

source: Anja Schneider, who is helping with the translation of this manual and with the correction and revision of the German texts. Many thanks for your help and patience, Anja!
de: Anja Schneider, die kräftig bei der Übersetzung dieses Admin Handbuches mitgeholfen und die deutschen Texte korrigiert hat. Vielen Dank, Anja, für deine Geduld und deine Mithilfe!

source: We receive many ideas via the OTRS mailing lists for system improvements, patches or bugfixes. Great support for all users is always available there. Thanks a lot to all people on the mailing lists for your active assistance!
de: Aus den OTRS Mailinglisten schöpfen wir viele Ideen für Weiterentwicklungen, erhalten Patches oder Fixes für Fehler und die Benutzer bekommen sehr guten Support. Vielen Dank an alle auf den Listen für Eure aktive Mithilfe!

source: Also we want to give a big thank you to the following persons:
de: Weiterhin möchten wir den folgenden Personen herzlich danken:

source: TRANSLATION
de: Übersetzung
