Repository: xhoy/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: de

source: You should strive to install the missing modules from your Linux distribution's package management system. In that way, the packages will be automatically updated when new versions are available or when security issues are found. Please refer to your distribution's documentation on how to install additional packages. If the (correct version of) the module is not available from the package repositories, you can also install from CPAN, the Comprehensive Perl Archive Network.
de: Wenn möglich, sollten Sie die fehlenden Module über das Paketsystem Ihrer Linux-Distribution installieren. Dadurch werden die Pakete automatisch aktualisiert, wenn neue Versionen verfügbar sind oder Sicherheitslücken geschlossen wurden. Bitte schauen Sie dazu in die Dokumentation Ihrer Distribution. Wenn ihr Paket nicht (in der korrekten Version) im Paketsystem nicht verfügbar ist, können Sie es über das CPAN installeren, das Comprehensive Perl Archive Network.

source: To install one of the modules from above via CPAN, you have to execute the command <command>perl -e shell -MCPAN</command>. The Perl shell will be started in interactive mode and the CPAN module will be loaded. If CPAN is already configured, you can install the modules with the command <command>install</command> followed by the name of the module. CPAN takes care of the dependencies of a module to other Perl modules and will let you know if other modules are needed.
de: Um eines der oben aufgeführten Module mit Hilfe von CPAN zu installieren, geben Sie als root das Kommando <command>perl -e shell -MCPAN</command> ein. Perl wird im interaktiven Modus gestartet und das CPAN Modul wird geladen. Ist CPAN bereits ordentlich konfiguriert, können Sie die für OTRS benötigten Module mit Hilfe des Kommandos <command>install</command> gefolgt vom Modulnamen einrichten. CPAN weist darauf hin, wenn Abhängigkeiten zwischen einzelnen Modulen nicht erfüllt sind und schlägt automatisch die zusätzlich benötigten Module für die Installation vor.

source: Execute also the two commands <command>perl -cw bin/cgi-bin/index.pl</command> and <command>perl -cw bin/otrs.PostMaster.pl</command> after changing into the directory <filename>/opt/otrs</filename>. If the output of both commands is "syntax OK", your Perl is properly set up (see Script 3.8 below).
de: Führen Sie weiterhin die beiden Befehle <command>perl -cw bin/cgi-bin/index.pl</command> und <command>perl -cw bin/PostMaster.pl</command> aus, nach dem Sie in das Verzeichnis <filename>/opt/otrs</filename> gewechselt sind. Wird bei beiden Befehlen die Meldung "syntax OK" angezeigt, verfügt Ihre Perl-Installation über alle von OTRS benötigten Module und Sie können im nächsten Schritt mit der Einrichtung des Webservers beginnen.

source: <emphasis>Script 3.8. Checking syntax.</emphasis>
de: <emphasis>Skript 3.8. Syntaxprüfung.</emphasis>

source: Configuring the Apache web server
de: Konfiguration des Apache-Webservers

source: This section describes the basic configuration of the <application>Apache</application> web server with mod_cgi for OTRS. The web server should be able to execute CGI scripts. OTRS won't work if the Perl scripts cannot be parsed. Check the configuration files of your web server, and search for the line that loads the CGI module. If you see something like the following, the CGI module should already be in use.
de: In diesem Abschnitt wird beschrieben, wie der <application>Apache</application>-Webserver grundlegend für OTRS eingerichtet werden muss. Der Webserver sollte cgi- bzw. Perl-Skripte ausführen können, andernfalls ist kein Betrieb von OTRS möglich. Überprüfen Sie die Konfigurationsdateien Ihres Webservers und stellen Sie fest, ob das cgi-Modul geladen wird: Wenn Ihr Webserver die Ausführung von cgi-Skripten unterstützt, sollte eine Zeile ähnlich der folgenden zu finden sein.

source: To access the web interface of OTRS conveniently via a short address, Alias and ScriptAlias entries are needed. Most <application>Apache</application> installations have a <filename>conf.d</filename> directory included. On Linux systems you can find this directory very often under <filename>/etc/apache</filename> or <filename>/etc/apache2</filename>. Log in as root, change to the <filename>conf.d</filename> directory and copy the appropriate template in <filename>/opt/otrs/scripts/apache2-httpd.include.conf</filename> to a file called <filename>otrs.conf</filename> in the Apache configuration directory.
de: Um die Oberfläche von OTRS bequem erreichen zu können, wird ein Alias- und ein ScriptAlias-Eintrag angelegt. Für die meisten Installationen des <application>apache</application> Webservers gilt, dass ein Verzeichnis mit dem Namen <filename>conf.d</filename> vorhanden ist, unter Linux ist es meist unterhalb des Verzeichnisses<filename>/etc/apache</filename> bzw. <filename>/etc/apache2</filename> zu finden. Wechseln Sie als root in dieses Verzeichnis und kopieren Sie die passende Konfigurationsvorlage in <filename>/opt/otrs/scripts/apache2-httpd.include.conf</filename> in die Datei <filename>otrs.conf</filename>.

source: Restart your web server to load the new configuration settings. On most systems you can start/restart your web server with the command <command>/etc/init.d/apache2 restart</command> (see Script 3.11 below).
de: Starten Sie Ihren Webserver neu, um die neue Konfiguration zu laden. Auf den meisten Systemen lässt sich der Webserver über den Befehl <command>/etc/init.d/apache2 restart</command> neu starten.

source: <emphasis>Script 3.11. Restarting the web server.</emphasis>
de: <emphasis>Skript 3.11. Neustart des Webservers.</emphasis>

source: Now your web server should be configured for OTRS.
de: Das war bereits die grundlegende Konfiguration des Webservers für OTRS.

source: If you choose to increase performance and you can install mod_perl, then you can leave mod_cgi off, and configure the <application>Apache</application> web server for use with mod_perl, in the following manner:
de: Zur Verbesserung der Performance können sie mod_cgi deaktivieren und den <application>Apache</application>-Webserver stattdessen für die Benutzung von mod_perl konfigurieren.

source: Please ensure that mod_perl is installed and loaded, in order to take advantage of this feature. Due to the nature of the start-up script, your server will not fail to start if mod_perl is not properly loaded or compiled in your apache web server, unless mod_cgi is also on. Technically speaking you can leave mod_cgi on as well, but you should not.
de: Stellen Sie bitte sicher, daß mod_perl installiert und geladen ist. Andernfalls wird der Webserver-Dienst trotzdem starten, in diesem Fall wird jedoch mod_cgi verwendet, wenn es noch aktiviert ist (Deaktivierung wird empfohlen).

source: Search your /etc/apache* directory for mod_perl.so (see Script 3.12 below) to see if the module is already loaded.
de: Suchen Sie im Verzeichnis /etc/apache* nach mod_perl.so (siehe Skript 3.12 unten) um herauszufinden, ob es bereits geladen wird, oder nicht.

source: <emphasis>Script 3.12. Searching for mod_perl.</emphasis>
de: <emphasis>Skript 3.12. Suche nach mod_perl.</emphasis>

source: When you use the appropriate start script listed above and the module is loaded, the script (when commented in) /opt/otrs/scripts/apache2-perl-startup.pl can be used to load the perl modules into memory one time, saving on load times and increasing performance.
de: Wenn Sie das o. a. geeignete Startskipt verwenden, und mod_perl geladen wird, kann das Skript /opt/otrs/scripts/apache2-perl-startup.pl verwendet werden, um die Perl-Module bereits beim Start des Webservers einmalig vorzuladen. Damit werden die Antwortzeiten kürzer, was die Performance insgesamt verbessert.

source: Configuring the database
de: Einrichten der Datenbank

source: The simple way - Using the web installer (works only with <application>MySQL</application>)
de: Der einfache Weg - Einrichtung der Datenbank mit Hilfe des Webinstallers (nur für <application>MySQL</application>)

source: If you use <application>MySQL</application> as the database back-end, you can use the OTRS web installer: <ulink url="http://localhost/otrs/installer.pl"> <citetitle>http://localhost/otrs/installer.pl</citetitle> </ulink> .
de: Wenn Sie <application>MySQL</application> als Datenbank-Backend verwenden, können Sie den Web-Installer von OTRS verwenden: <ulink url="http://localhost/otrs/installer.pl"> <citetitle>http://localhost/otrs/installer.pl</citetitle> </ulink> .

source: When the web installer starts, please follow the next steps to setup your system:
de: Der Webinstaller wird gestartet. Folgen Sie den Anweisungen auf dem Bildschirm.

source: 1. Check out the information about the OTRS offices and click on next to continue (see Figure 3.1 below).
de: 1. Lesen Sie die Informationen über die OTRS-Niederlassungen und klicken Sie auf "Weiter".

source: installer.pl screen - Welcome screen
de: installer.pl - Willkommensbildschirm

source: <emphasis>Figure 3.1. Welcome screen.</emphasis>
de: <emphasis>Abb. 3.1. Willkommensbildschirm.</emphasis>

source: 2. Read the GNU Affero General Public License (see Figure 3.2 below) and accept it, by clicking the corresponding button at the bottom of the page.
de: 2. Lesen Sie die GNU Affero General Public License und akzeptieren Sie sie durch Klick auf "Akzeptieren".

source: installer.pl screen - License (1/4)
de: installer. pl - Lizenz (1/4)

source: <emphasis>Figure 3.2. GNU Affero General Public License.</emphasis>
de: <emphasis>Abb. 3.2. GNU Affero General Public License.</emphasis>

source: 3. Provide the username and password of the administrator, the DNS name of the computer which hosts OTRS and the type of database system to be used. After that, check the settings (see Figure 3.3 below).
de: 3. Geben Sie Benutzernamen und Passwort für den Administrator an, den DNS-Namen des Servers, auf dem OTRS läuft, und den zu verwendenden Datenbanktyp. Prüfen Sie danach die Einstellungen.

source: installer.pl screen - Create database (2/4) initial settings
de: installer.pl - Datenbank-Grundeinstellungen (2/4)

source: <emphasis>Figure 3.3. Database initial settings.</emphasis>
de: <emphasis>Abb. 3.3. Datenbank-Grundeinstellungen.</emphasis>

source: You will be notified if the check was successful. Press OK to continue (see Figure 3.4 below).
de: Wenn die Prüfung erfolgreich war, erhalten Sie einen Hinweis. Drücken Sie "Ok" zum Fortfahren.

source: installer.pl screen - Create database (2/4) successful checking notification
de: installer.pl - Prüfung der Datenbankeinstellungen (2/4)

source: <emphasis>Figure 3.4. Notification for successful check.</emphasis>
de: <emphasis>Abb. 3.4. Hinweis auf erfolgreiche Prüfung.</emphasis>

source: 4. Create a new database user, choose a name for the database and click on 'Next' (see Figure 3.5 below).
de: 4. Erstellen Sie einen neuen Datenbankbenutzer, wählen Sie einen Namen für die Datenbank und klicken Sie auf "Weiter".

source: It is never a good idea to use default passwords. Please change the default password for the OTRS database!
de: Man sollte nie Standard-Passwörter verwenden. Bitte ändern Sie das Standardpasswort der OTRS-Datenbank!

source: installer.pl screen - Create database (2/4) all settings
de: installer.pl - Datenbankeinstellungen (2/4)

source: <emphasis>Figure 3.5. Database settings.</emphasis>
de: <emphasis>Abb. 3.5. Datenbankeinstellungen.</emphasis>

source: If the database and its user were successfully created, you will get a setup notification, as shown in Figure 3.6. Click 'Next' to go to the next screen.
de: Wenn der Datenbankbenutzer und die Datenbank erfolgreich angelegt wurden, erhalten Sie eine Bestätigung. Klicken Sie auf 'Weiter', um fortzufahren.

source: installer.pl screen - Create Database (2/4) setup successful
de: installer.pl - Erstellung der Datenbank erfolgreich

source: <emphasis>Figure 3.6. Notification indicating successful database setup.</emphasis>
de: <emphasis>Abb. 3.6. Bestätigung der erfolgreichen Datenbankeinrichtung.</emphasis>

source: 5. Provide all the required system settings and click on 'Next' (see Figure 3.7 below).
de: 5. Geben Sie alle benötigten Systemeinstellungen an und klicken Sie "Weiter".

source: installer.pl screen - System Settings (3/4)
de: installer.pl - Systemeinstellungen (3/4)

source: <emphasis>Figure 3.7. System settings.</emphasis>
de: <emphasis>Abb. 3.7. Systemeinstellungen.</emphasis>

source: 6. If you want, you can provide the needed data to configure your inbound and outbound mail, or skip this step by pressing the right button at the bottom of the screen (see Figure 3.8 below).
de: 6. Wenn Sie wollen, können Sie an dieser Stelle eingehende und ausgehende E-Mail-Verbindungen einrichten, oder diesen Schritt überspringen.

source: installer.pl screen - Mail Configuration (3/4)
de: installer.pl - E-Mail-Konfiguration (3/4)

source: <emphasis>Figure 3.8. Mail configuration.</emphasis>
de: <emphasis>Abb. 3.8. E-Mail-Konfiguration.</emphasis>

source: 7. Restart the OTRS service now to use the new configuration settings as shown in the Script 3.13.
de: 7. Starten Sie den OTRS-Dienst neu, damit die neuen Konfigurationseinstellungen verwendet werden.

source: <emphasis>Script 3.13. Restarting the OTRS service.</emphasis>
de: <emphasis>Skript 3.13. Neustart des OTRS-Dienstes.</emphasis>

source: Congratulations! Now the installation of OTRS is finished and you should be able to work with the system (see Figure 3.9 below). To log into the web interface of OTRS, use the address <ulink url="http://localhost/otrs/index.pl"> <citetitle>http://localhost/otrs/index.pl</citetitle> </ulink> from your web browser. Log in as OTRS administrator, using the username 'root@localhost' and the password 'root'. After that you can configure the system for your needs.
de: Herzlichen Glückwunsch! Die Installation ist abgeschlossen, jetzt können Sie mit dem System arbeiten. Um sich anzumelden, verwenden Sie bitte die Adresse <ulink url="http://localhost/otrs/index.pl"> <citetitle>http://localhost/otrs/index.pl</citetitle> </ulink> in ihrem Webbrowser. Melden Sie sich als Administrator and, mit dem Benutzernamen 'root@localhost' und dem Passwort 'root'. Anschließend können Sie das System gemäß Ihrer Anforderungen konfigurieren.

source: installer.pl screen - Finished (4/4)
de: installer.pl - Abgeschlossen (4/4)

source: <emphasis>Figure 3.9. Final steps to install OTRS.</emphasis>
de: <emphasis>Abb. 3.9. Letzte Schritte zur Installation von OTRS.</emphasis>

source: Installing the OTRS database manually
de: Manuelle Installation der OTRS Datenbank

source: If you can't use the web installer to setup the OTRS database, you have to set it up manually. Scripts with the SQL statements to create and configure the database are located in <filename>scripts/database</filename>, in the home directory of the 'otrs' user (see Script 3.14 below).
de: Wenn Sie den Webinstaller nicht einsetzen können, kann die Datenbank für OTRS auch manuell eingerichtet werden. Skripte mit dem Datenbankschema und den SQL-Statements finden Sie im Verzeichnis <filename>scripts/database</filename> innerhalb des Homeverzeichnisses des Benutzers 'otrs'.

source: <emphasis>Script 3.14. Files needed to create and configure the database.</emphasis>
de: <emphasis>Skript 3.14. Für die Datenbankerstellung benötigte Dateien.</emphasis>

source: To setup the database for the different database back-ends, the .sql files must be processed in a specific order.
de: Für die verschiedenen Datenbanktypen sind mehrere .sql-Dateien vorhanden, die nacheinander abgearbeitet werden müssen.

source: Create the OTRS database manually step by step
de: Die OTRS-Datenbank manuell Schritt für Schritt anlegen

source: Creating the DB: Create the database that you want to use for OTRS, with your database client or your database interface.
de: Anlegen der Datenbank für OTRS: Legen Sie mit Hilfe Ihres Datenbankinterfaces bzw. Ihrer Datenbankoberfläche die Datenbank an, die später von OTRS verwendet werden soll.

source: Creating the tables: With the otrs-schema.DatabaseType.sql files (e.g. <filename>otrs-schema.oracle.sql</filename>, <filename>otrs-schema.postgresql.sql</filename>) you can create the tables in your OTRS database.
de: Erstellen der Tabellen: Mit Hilfe der otrs-schema.Datenbanktyp.sql-Dateien (z. B. <filename>otrs-schema.oracle.sql</filename>, <filename>otrs-schema.postgresql.sql</filename>, usw.) können Sie die Tabellen innerhalb der OTRS Datenbank erzeugen.

source: Inserting the initial system data: OTRS needs some initial system data to work properly (e.g. the different ticket states, ticket and notification types). Depending on the type of your database, use one of the files <filename>otrs-initial_insert.mysql.sql</filename>, <filename>otrs-initial_insert.db2.sql</filename>, <filename>otrs-initial_insert.oracle.sql</filename>, <filename>otrs-initial_insert.postgresql.sql</filename> or <filename>otrs-initial_insert.mssql.sql </filename>.
de: Einfügen der vom System benötigten Daten: Damit OTRS richtig funktioniert, müssen einige Daten in verschiedene Tabellen geschrieben werden (z. B. die verschiedenen Ticketstatus, Ticket- und Benachrichtigungstypen, etc.). Verwenden Sie entweder die Datei<filename>otrs-initial_insert.mysql.sql</filename>, <filename>otrs-initial_insert.db2.sql</filename>, <filename>otrs-initial_insert.oracle.sql</filename>, <filename>otrs-initial_insert.postgresql.sql</filename> oder <filename>otrs-initial_insert.mssql.sql </filename> zum Einspielen der Daten, je nachdem welche Datenbank verwendet wird.

source: Creating references between tables: The last step is to create the references between the different tables in the OTRS database. Use the otrs-schema-post.DatabaseType.sql file to create these (e.g. <filename>otrs-schema-oracle.post.sql</filename>, <filename>otrs-schema-post.postgresql.sql</filename>).
de: Erzeugen von "foreign keys" auf andere Tabellen: Abschließend müssen noch die "foreign keys" erstellt werden, über die die verschiedenen Tabellen in der OTRS Datenbank voneinander abhängen. Dies kann mit Hilfe der otrs-schema-post.Datenbanktyp.sql-Dateien erreicht werden (z. B. <filename>otrs-schema-oracle.post.sql</filename>, <filename>otrs-schema-post.postgresql.sql</filename>, usw.).

source: After you have finished the database setup, you should check and set proper access rights for the OTRS database. It should be enough to grant access to one user. Depending on the database server you are using, setting up the access rights differs, but it should be possible either with your database client or your graphical database front-end.
de: Nachdem Sie die Datenbank angelegt haben, sollten Sie die Zugriffsrechte dafür setzen und z. B. sicherstellen, dass nur ein bestimmter Benutzer ohne Datenbank-Administrationsrechte Zugriff auf die OTRS Datenbank hat. Je nachdem, welche Datenbank Sie einsetzen, unterscheiden sich hier die Vorgehensweisen, es sollte jedoch möglich sein dies mit Hilfe Ihres Datenbankinterfaces bzw. Ihrer Datenbankoberfläche zu erledigen.

source: If your database and the access rights are configured properly, you have to tell OTRS which database back-end you want to use and how the ticket system can connect to the database. Open the file <filename>Kernel/Config.pm</filename> located in the home directory of the 'otrs' user, and change the parameters shown in the Script 3.15 according to your needs.
de: Wurden die nötigen Einstellungen für die Datenbank vorgenommen, muss nun noch dem Ticket-System mitgeteilt werden, welche Datenbank es verwenden soll. Öffnen Sie die Datei <filename>Kernel/Config.pm</filename> innerhalb des Homeverzeichnisses des OTRS Benutzers und passen Sie die dafür vorgesehenen Parameter an.

source: <emphasis>Script 3.15. Parameters to be customized.</emphasis>
de: <emphasis>Skript 3.15. Anzupassende Einstellungen.</emphasis>

source: Setting up the cron jobs for OTRS
de: Einrichten der von OTRS benötigten cron-Jobs

source: OTRS needs some cron jobs to work properly. The cron jobs should be run with the same user rights that were specified for the OTRS modules. That means that the cron jobs must be inserted into the crontab file of the 'otrs' user.
de: Damit OTRS voll funktioniert, werden einige cron-Jobs benötigt. Die cron-Jobs sollten mit denselben Benutzerrechten ausgeführt werden, die auch für die restlichen OTRS-Skripte vergeben wurden, d.h. die cron-Jobs sollten in die crontab des Benutzers 'otrs' eingetragen werden.

source: All scripts with the cron jobs are located in <filename>var/cron</filename>, in the home directory of the 'otrs' user (see Script 3.16 below).
de: Alle Skripte für die verschiedenen cron-Jobs befinden sich im Verzeichnis <filename>var/cron</filename> innerhalb des Homeverzeichnisses des Benutzers 'otrs'.

source: <emphasis>Script 3.16. Files needed to create the cron jobs.</emphasis>
de: <emphasis>Skript 3.16. Für die Erstellung der Cronjobs benötigte Dateien.</emphasis>

source: These scripts have a suffix of '.dist'. You should copy them to files with the suffix removed. If you use bash, you might want to use the command listed in Script 3.17 below.
de: Alle Skripte tragen die Endung .dist und sollten zunächst so umkopiert werden, dass keine Endung mehr vorhanden ist.

source: <emphasis>Script 3.17. Copying and renaming all the files needed to create the cron jobs.</emphasis>
de: <emphasis> Skript 3.17. Kopieren und Umbenennen der für die Erstellung der Cronjobs benötigten Dateien. </emphasis>

source: Table 3-2 describes the different cron jobs.
de: Die folgende Tabelle gibt eine kurze Übersicht über die Aufgabe der verschiedenen Skripte.

source: Description of several cron job scripts.
de: Die verschiedenen Skripte für die cron-Jobs von OTRS.

source: Script
de: Skript

source: Function
de: Funktion

source: Sets the basics for the crontab of the 'otrs' user.
de: Über dieses Skript werden die grundlegenden Einstellungen für die crontab des Benutzers 'otrs' festgelegt.

source: Removes expired cache entries from disk. Clears the loader cache for CSS and JavaScript files.
de: Löscht abgelaufene Cache-Einträge von der Festplatte. Leert den Cache von CSS- und JavaScript-Dateien.

source: Used only if new mails will be fetched with fetchmail into the ticket system.
de: Falls Nachrichten mit Hilfe von fetchmail in das System eingespeist werden sollen, kann dieses Skript verwendet werden.

source: Executes the jobs of the GenericAgent that are not stored in the database but in own config files.
de: Mit Hilfe dieses Skripts werden die Jobs des GenericAgents ausgeführt, die über eigene Konfigurationsdateien festgelegt wurden.

source: Executes the jobs of the GenericAgent that are stored in the database.
de: Mit Hilfe dieses Skripts werden die Jobs des GenericAgents ausgeführt, die über dem Administrations-Bereich innerhalb von "GenericAgent" angelegt wurden.

source: Checks system for pending tickets, and closes them or sends reminders if needed.
de: Mit Hilfe dieses Skripts wird das System auf "wartende" (pending) Tickets überprüft.

source: Checks the message queue of the ticket system, and delivers messages that are still in the queues.
de: Mit Hilfe dieses Skripts wird die Nachrichten-Warteschlange von OTRS überprüft und noch nicht verarbeitete Nachrichten werden im System gespeichert bzw. zugestellt.

source: Fetches the mails from the POP3 accounts that were specified in the admin area, in the section for "PostMaster Mail Accounts".
de: Mit Hilfe dieses Skripts werden die verschiedenen pop3-Konten abgefragt, die im Administrations-Bereich innerhalb von "PostMaster POP3 Account" eingerichtet wurden.

source: Rebuilds the ticket index, which improves the speed of the QueueView.
de: Mit Hilfe dieses Skripts wird der Ticket-Index für die Queue-Ansicht neu erzeugt, wodurch die Anzeige beschleunigt wird.
