Repository: xhoy/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: de

source: You can access the group management page (see Figure 5.4 below) by clicking the <emphasis>Groups</emphasis> link in the admin area.
de: Sie können durch Klick auf "Gruppen" im Administrationsbereich in die Gruppenverwaltung gelangen.

source: Group management
de: Gruppen-Verwaltung

source: <emphasis>Figure 5.4. Group management.</emphasis>
de: <emphasis>Abb. 5.4. Gruppenverwaltung.</emphasis>

source: As with agents, an OTRS group may be deactivated but not deleted. Deactivation is done by setting the Valid flag to <emphasis>invalid</emphasis> or <emphasis>invalid-temporarily</emphasis>.
de: In OTRS können Gruppen deaktiviert, aber nicht gelöscht werden. Deaktivieren Sie eine Gruppe, indem Sie für "Gültig" den Wert entweder auf "ungültig" oder auf "ungültig-temporär" setzen.

source: To add an agent to a group, or to change the agents who belong to a group, you can use the link <emphasis>Agents &lt;-&gt; Groups</emphasis> from the Admin page (see Figure 5.5 below).
de: Um einen Benutzer einer Gruppe zuzuweisen bzw. die Gruppenmitgliedschaft eines Benutzers zu ändern, kann der Link "Benutzer &lt;-&gt; Gruppen" im Administrationsbereich genutzt werden.

source: Agent Group management
de: Verwaltung von Benutzergruppen

source: <emphasis>Figure 5.5. Group management.</emphasis>
de: <emphasis>Abb. 5.5. Benutzer-Gruppen-Zuordnung.</emphasis>

source: An overview of all groups and agents in the system is displayed. You can also use the filters to find a specific entity. If you want to change the groups that an agent is member of, just click on the agent's name (see Figure 5.6 below). To change the agents associated with a group, just click on the group you want to edit (see Figure 5.7 below).
de: Im unteren Bereich des Bildschirms wird eine Übersicht angezeigt, die alle Benutzer und Gruppen auflistet. Indem Sie auf einen Benutzernamen klicken, bekommen Sie dessen Gruppenzugehörigkeiten angezeigt und können diese ändern. Bei der Auswahl einer Gruppe werden alle Benutzer aufgelistet, die sich in dieser Gruppe befinden.

source: Agent-Group management
de: Verwaltung von Benutzergruppen

source: <emphasis>Figure 5.6. Change the groups an agent belongs to.</emphasis>
de: <emphasis>Abb. 5.6. Bearbeiten der Gruppenzugehörigkeiten eines Benutzers.</emphasis>

source: <emphasis>Figure 5.7. Change the agents that belong to a specific group.</emphasis>
de: <emphasis>Abb. 5.7. Bearbeiten der Benutzerzuordnungen einer Gruppe.</emphasis>

source: Each group has a set of rights associated with it, and each member agent may have some combination of these rights for themselves. A list of the permissions / rights is shown in Table 5-2.
de: Jede Gruppe hat zugehörige Berechtigungen, und jeder Agent, der Mitglied dieser Gruppe ist, kann eine Kombination dieser Rechte erhalten. Eine Liste dieser Berechtigungen wird in Tabelle 5-2 gezeigt.

source: Rights associated with OTRS Groups
de: Mit OTRS-Gruppen verknüpfte Rechte

source: Right
de: Berechtigung

source: Read only access to the tickets, entries and queues of this group.
de: Nur Lesezugriff auf die Tickets bzw. Beiträge dieser Gruppe bzw. der Gruppe zugewiesenen Queues oder Bereiche.

source: move into
de: Verschieben in (move into)

source: Right to move tickets or entries between queues or areas that belong to this group.
de: Recht zum Verschieben von Tickets oder Beiträgen innerhalb der Queues bzw. Bereiche dieser Gruppe.

source: create
de: erstellen

source: Right to create tickets or entries in the queues or areas of this group.
de: Recht zum Erstellen von Tickets oder Beiträgen in den Queues, bzw. Bereichen dieser Gruppe.

source: owner
de: Besitzer (owner)

source: Right to update the owner of tickets or entries in queues or areas that belong to this group.
de: Recht zum Ändern des Eigentümers von Tickets, bzw. Beiträgen in den der Gruppe zugewiesenen Queues bzw. Bereiche.

source: priority
de: Priorität

source: Right to change the priority of tickets or entries in queues or areas that belong to this group.
de: Recht zum Ändern der Priorität von Tickets, bzw. Beiträgen in den der Gruppe zugewiesenen Queues bzw. Bereiche.

source: Full read and write access on tickets or entries in the queues or areas that belong to this group.
de: Voller Lese- und Schreibzugriff auf alle Inhalte der dieser Gruppe zugewiesenen Queues, bzw. Bereiche.

source: By default, the QueueView only lists tickets in queues that an agent has <emphasis>rw</emphasis> access to, i.e., the tickets the agent needs to work on. If you want to change this behaviour, you can set <link linkend="Ticket:Frontend::Agent::Ticket::ViewQueue:Ticket::Frontend::AgentTicketQueue_ViewAllPossibleTickets"> Ticket::Frontend::AgentTicketQueue###ViewAllPossibleTickets </link> to <emphasis>Yes</emphasis>.
de: Standardmäßig listet die Queue-Ansicht nur Tickets in Queues auf, auf welche der Benutzer <emphasis>rw</emphasis>-Rechte hat, d. h. Tickets, an denen der Benutzer arbeiten muss. Wenn Sie dieses Verhalten ändern wollen, können Sie <link linkend="Ticket:Frontend::Agent::Ticket::ViewQueue:Ticket::Frontend::AgentTicketQueue_ViewAllPossibleTickets"> Ticket::Frontend::AgentTicketQueue###ViewAllPossibleTickets </link> auf <emphasis>Ja</emphasis> setzen.

source: Roles
de: Rollen

source: Roles are a powerful feature to manage the access rights of many agents in a very simple and quick manner. They are particularly applicable on large, complex support systems with a lot of agents, groups and queues. An example below explains when they may be used.
de: Rollen sind ein sehr nützliches und mächtiges Feature in OTRS, um schnell und einfach die Vergabe von Zugriffsrechten für viele Benutzer vorzunehmen. Vor allem bei großen und komplexen Installationen mit vielen Benutzern, Gruppen und Queues, zahlt sich dieses Feature schnell aus und erspart dem OTRS-Administrator viel Zeit und Arbeit. Das nachfolgende Beispiel stellt ein mögliches Szenario vor.

source: Suppose that you have a system with 100 agents, 90 of them with access to a single queue called "support" where all support requests are handled. The "support" queue contains some sub queues. The other 10 agents have permission to access all queues of the system. These 10 agents dispatch tickets, watch the raw queue and move spam messages into the "junk" queue.
de: Um den Nutzen von Rollen zu verdeutlichen, stellen Sie sich die Situation vor, dass Sie ein OTRS-System mit 100 Benutzern verwalten. 90 Benutzer haben Zugriff auf eine Queue namens Support, die mehrere themenspezifische Unter-Queues enthält und in der die Support-Anfragen Ihrer Kunden landen. Die restlichen Queues des Systems sind für die 90 Supporter nicht zugänglich, dies wurde durch Gruppenzugriffsrechte so festgelegt. Die übrigen 10 Benutzer haben Zugriff auf alle Queues im System. Sie sortieren falsch einsortierte Mails aus, behalten die "Raw"-Queue im Auge und verschieben Spam-Mails in die "Junk"-Queue.

source: The company now opens a new department that sells some products. Order request and acceptance, order confirmation, bills, etc. must be processed, and some of the company's agents shall do this via OTRS. The different agents have to get access to the new queues that must be created.
de: Im Rahmen einer Unternehmensumstrukturierung wird eines Tages zusätzlich eine Abteilung eröffnet, die Produkte verkaufen soll. Es müssen Angebote, Auftragsbestätigungen und Rechnungen erstellt, Anfragen bearbeitet, Bestellungen ans Lager weitergeleitet und Stornierungen entgegen genommen werden. Ein Teil der bisherigen Mitarbeiter soll in verschiedenen Bereichen der neuen Abteilung tätig werden und Sie als OTRS-Administrator haben nun die Aufgabe die neuen Queues anzulegen, die erweiterten Zugriffsrechte anzupassen und diese für die einzelnen Benutzer zu ändern.

source: Because it would take a long time to change the access rights for the different agents manually, roles that define the different access levels can be created. The agents can then be added to one or more roles, with their rights automatically changed. If a new agent account is created, it is also possible to add this account to one or more roles.
de: Da es mühsam und viel zu umständlich wäre, für einen Teil aller 100 Benutzer einzeln die Zugriffsrechte zu ändern, richten Sie Rollen ein die mit Hilfe von Gruppenberechtigungen die verschiedenen Zugriffsrechte regeln. Anschließend ändern Sie für die entsprechenden Benutzer auf einmal die Zugriffsberechtigungen, indem Sie diese der entsprechenden Rolle zuweisen. Beim Anlegen neuer Benutzer müssen Sie nicht mehr einzeln die Gruppen und Zugriffsrechte einstellen, auch hier genügt die Verknüpfung des neuen Benutzers mit einer Rolle.

source: Roles are really useful when maintaining larger OTRS installations. You should take care in their use though. Mixing Agent to Group with Agent to Role mappings can make for a complex access control scheme, difficult to understand and maintain. If you wish to use only roles and disable the Agents &lt;-&gt; Groups option in the Admin area, you can do so by modifying the <link linkend="Framework:Frontend::Admin::ModuleRegistration:Frontend::Module_AdminUserGroup">Frontend::Module###AdminUserGroup</link> in the SysConfig. Be aware that this won't remove already existing Agents to Group assignments!
de: Rollen sind wirklich hilfreich für die Verwaltung großer OTRS-Installationen. Allerdings sollten Sie nicht Gruppen und Rollen gleichzeitig einsetzen, um die Wartung nicht zu kompliziert zu machen. Sollten Sie sich also entscheiden, auf Rollen zu setzen, empfehlen wir Ihnen, die Verwaltung für die Benutzer-Gruppen-Zuordnungen abzuschalten, indem Sie <link linkend="Framework:Frontend::Admin::ModuleRegistration:Frontend::Module_AdminUserGroup"> Frontend::Module###AdminUserGroup </link> in der SysConfig deaktivieren. Dadurch werden existierende Gruppenzuordnungen natürlich nicht entfernt!

source: You can access the role management section (see Figure 5.8 below ) by clicking the <emphasis>Roles</emphasis> link on the Admin page.
de: Sie können die Rollenverwaltung durch Klick auf "Rollen" im Administrationsbereich erreichen.

source: Role management
de: Rollenverwaltung

source: <emphasis>Figure 5.8. Role management.</emphasis>
de: <emphasis>Abb. 5.8. Rollenverwaltung.</emphasis>

source: As with agent and groups, roles once created can be deactivated but not deleted. To deactivate, set the Valid option to <emphasis>invalid</emphasis> or <emphasis>invalid-temporarily</emphasis>.
de: In OTRS können Rollen deaktiviert, aber nicht gelöscht werden. Deaktivieren Sie eine Rolle, indem Sie für "Gültig" den Wert entweder auf "ungültig" bzw. "ungültig-temporär" setzen.

source: An overview of all roles in the system is displayed. To edit a role's settings, click on the role's name. In a fresh new OTRS installation, there are no roles defined by default. To register one, click on the "Add role" button, provide the needed data and submit it (see Figure 5.9 below).
de: Eine Übersicht aller Rollen im System erscheint, um einen Eintrag zu bearbeiten, klicken Sie einfach auf den Rollennamen. In einer Neuinstallation gibt es keine vordefinierten Rollen. Um eine anzulegen, klicken Sie auf den "Rolle hinzufügen"-Knopf und geben Sie die erforderlichen Daten an.

source: <emphasis>Figure 5.9. Adding a new role.</emphasis>
de: <emphasis>Abb. 5.9. Anlegen einer neuen Rolle.</emphasis>

source: To get an overview of all roles and agents in the system, click on the link Roles &lt;-&gt; Agents on the Admin page. You can also use filters to find a specific element. If you want to change the roles associated with an agent, just click on the agent's name (see Figure 5.10 below). To change the agents associated with a role, click on the role you want to edit (see Figure 5.11 below).
de: Um einen Überblick über alle Rollen und Agenten im System zu erhalten, klicken Sie auf den Link "Rollen &lt;-&gt; Benutzer" im Administrationsbereich. Sie könnnen die Filter verwenden, um einen bestimmten Eintrag zu finden. Wenn Sie die Rollenzordnungen eines Benutzers ändern wollen, klicken Sie auf den Benutzernamen. Um die Benutzerzuordnungen einer Rolle zu verändern, klicken Sie auf die Rolle.

source: Agent Role management
de: Verwaltung der Benutzer-Rollen

source: <emphasis>Figure 5.10. Change the Roles associated with an Agent.</emphasis>
de: <emphasis>Abb. 5.10. Bearbeiten der Rollenzuordnungen eines Agenten.</emphasis>

source: <emphasis>Figure 5.11. Change the Agents associated with a specific Role.</emphasis>
de: <emphasis>Abb. 5.11. Bearbeiten der Benutzerzuordnungen einer Rolle.</emphasis>

source: To get an overview of all roles and groups in the system, click on the link Roles &lt;-&gt; Groups on the Admin page. You will see a similar screen as the one shown in the Figure 5.12. You can also use filters to find a specific entity.
de: Um eine Übersicht aller Rollen und Gruppen im System zu erhalten, verwenden Sie den Link "Rollen &lt;-&gt; Gruppen" im Administrationsbereich.

source: Role Group management
de: Verwaltung der Rollen-Gruppen-Zuordnungen

source: <emphasis>Figure 5.12. Manage Roles-Groups relations.</emphasis>
de: <emphasis>Abb. 5.12. Rollen-Gruppen-Zuordnungen verwalten.</emphasis>

source: To define the different access rights for a role, click on the name of a role or a group (see below the Figures 5.13 and 5.14, respectively).
de: Klicken Sie auf eine Gruppe oder Rolel, um die jeweiligen Zuordnungen zu verändern.

source: Change Group relations for a Role
de: Gruppenzuordnungen einer Rolle verändern

source: <emphasis>Figure 5.13. Change Group relations for a Role.</emphasis>
de: <emphasis>Abb. 5.13. Gruppenzuordnungen einer Rolle verändern.</emphasis>

source: Change Role relations for a Group
de: Rollenzuordnungen für eine Gruppe verändern

source: <emphasis>Figure 5.14. Change Role relations for a Group.</emphasis>
de: <emphasis>Abb. 5.14. Rollenzuordnungen für eine Gruppe verändern.</emphasis>

source: Customers and Customer Groups
de: Kundenbenutzer und Kundengruppen

source: Customers
de: Kunden

source: OTRS supports different types of users. Using the link "Customers" (via the navigation bar, or the Admin page), you can manage the accounts of your customers (see Figure 5.14 below), who can log into the system via the Customers interface (customer.pl). Through this interface, your customers can create tickets and access them as they are updated. It is important to know that a customer is needed for the ticket history in the system.
de: OTRS unterstützt, wie bereits erwähnt, verschiedene Arten von Benutzern. Über den Link "Kunden", den Sie im Admin-Bereich von OTRS finden, können Sie die Benutzerdaten der im System angelegten Kunden verwalten. Ein Kunde kann sich mit Hilfe seines Accounts in das vom Ticket-System bereitgestellte Webinterface für Kunden einloggen, um dort die eigenen Tickets einzusehen, neue Tickets zu verfassen, usw. Weiterhin wird ein Kunden-Account vom System für die Historie von Tickets benötigt.

source: Customer management
de: Kundenverwaltung

source: <emphasis>Figure 5.14. Customer management.</emphasis>
de: <emphasis>Abb. 5.14. Kundenverwaltung.</emphasis>

source: You can search for a registered customer, or edit their settings by clicking on their name. You also have the possibility to change the customer back-end, for further information please refer to the chapter about <link linkend="external-backends">external back-ends</link>.
de: Neben der Möglichkeit in der Datenbank nach einem bestimmten Kunden zu suchen, kann das Backend umgestellt werden, über das auf die Kundendaten zugegriffen wird. In OTRS lassen sich mehrere Datenbanken mit Kundendaten einbinden, genauere Informationen hierzu finden Sie im Abschnitt <link linkend="external-backends">Einbinden externer Backends für Agents und Customer</link>.

source: To create a new customer account, click on the "Add customer" button (see Figure 5.15 below). Some of the fields are mandatory, i.e., they have to contain values, so if you leave one of those empty, it will be highlighted in red.
de: Um einen neuen Kunden hinzuzufügen, klicken Sie auf "Kunde hinzufügen". Einige Felder sind Pflichtfelder, müssen also ausgefüllt werden.

source: <emphasis>Figure 5.14. Adding a customer.</emphasis>
de: <emphasis>Abb. 5.14. Hinzufügen eines Kunden.</emphasis>

source: Customers can access the system by providing their username and password. The CustomerID is needed by the system to identify the user and associated tickets. Since the email address is a unique value, it can be used as the ID.
de: Der Kunde kann mit Benutzername und Passwort auf das System zugreifen. Die Kundennummer wird vom System benötigt, um den Kunden und seine Tickets zu erkennen. Da E-Mail-Adressen eindeutig sind, können sie als ID verwendet werden.

source: As with agents, groups and roles, customers can not be deleted from the system, only deactivated by setting the Valid option to <emphasis>invalid</emphasis> or <emphasis>invalid-temporarily</emphasis>.
de: In OTRS können Kunden deaktivert, aber nicht gelöscht werden. Sie können einen Kunden deaktivieren, indem Sie den Wert für "Gültig" auf "ungültig" oder "ungültig-temporär" setzen.

source: Customer Groups
de: Kundengruppen

source: Customer users can also be added to a group, which can be useful if you want to add customers of the same company with access to one or a few queues. First create the group to which your customers will belong, via the <link linkend="adminarea-groups">Group management module</link>. Then add the <link linkend="adminarea-queue">queues</link> and select the new group for the queues.
de: Kunden können auch Gruppen zugeordnet werden. Das ist nützlich, wenn Kunden nur auf bestimmte Queues zugreifen können sollen. Legen Sie zuerst die benötigten Gruppen in der <link linkend="adminarea-groups"> Gruppenverwaltung </link> an . Fügen Sie dann die <link linkend="adminarea-queue"> Queues </link> hinzu und ordnen Sie diese der neuen Gruppe zu.

source: The next step is to activate the customer group support. This can be done with the configuration parameter <link linkend="Framework:Frontend::Customer:CustomerGroupSupport">CustomerGroupSupport</link>, from the Admin SysConfig option. Using the parameter <link linkend="Framework:Frontend::Customer:CustomerGroupAlwaysGroups">CustomerGroupAlwaysGroups</link>, you can specify the default groups for a newly added customer, so that every new account will be automatically added to these groups.
de: Im nächsten Schritt aktivieren Sie mit Hilfe des Konfigurationsparameters <link linkend="Framework:Frontend::Customer:CustomerGroupSupport">CustomerGroupSupport</link> die Unterstützung für Kundengruppen. Mit Hilfe des Parameters <link linkend="Framework:Frontend::Customer:CustomerGroupAlwaysGroups">CustomerGroupAlwaysGroups</link> legen Sie fest, welchen Gruppen ein neu angelegter Kundenbenutzer automatisch zugeordnet werden soll.

source: Through the link "Customers &lt;-&gt; Groups" you can manage which customer shall belong to the different groups (see Figure 5.15 below).
de: Über den Link "Kunden &lt;-&gt; Gruppen" können Sie nun die Zuordnung der Kundenbenutzer in die gewünschten Gruppen vornehmen.

source: Customer Group management
de: Verwaltung der Kunden-Gruppen-Zuordnungen

source: <emphasis>Figure 5.15. Customer-Group relations management.</emphasis>
de: <emphasis>Abb. 5.15. Verwaltung der Kunden-Gruppen-Zuordnungen.</emphasis>

source: To define the different groups a customer should be part of and vice versa, click on the corresponding customer username or group (see below the Figures 5.16 and 5.17, respectively).
de: Klicken Sie auf den Kunden- oder Gruppennamen, um die jeweiligen Zuordnungen zu bearbeiten.

source: Change Group relations for a Customer
de: Gruppenzuordnungen eines Kunden bearbeiten

source: <emphasis>Figure 5.16. Change Group relations for a Customer.</emphasis>
de: <emphasis>Abb. 5.16. Gruppenzuordnungen eines Kunden bearbeiten.</emphasis>

source: Change Customer relations for a Group
de: Kundenzuordnungen einer Gruppe bearbeiten

source: <emphasis>Figure 5.17. Change Customer relations for a Group.</emphasis>
de: <emphasis>Abb. 5.17. Kundenzuordnungen einer Gruppe bearbeiten.</emphasis>

source: Clicking on the link "Queues" of the Admin page, you can manage the <link linkend="what-is-a-queue">queues</link> of your system (see Figure 5.18 below). In a new OTRS installation there are 4 default queues: Raw, Junk, Misc and Postmaster. All incoming messages will be stored in the "Raw" queue if no filter rules are defined. The "Junk" queue can be used to store spam messages.
de: Über den Link "Queue" innerhalb des Admin-Bereiches von OTRS können Sie die <link linkend="what-is-a-queue">Queues</link> Ihres Systems verwalten. Nach einer Standard-Installation sind bereits die Queues "Junk", "Misc", "Postmaster" und "Raw" im System angelegt. "Raw" ist die Default-Queue, in ihr landen alle neuen Tickets, so lange kein Filter definiert wurde. "Junk" kann z. B. zum Aussortieren von Spam-Mails genutzt werden.

source: Queue management
de: Queue-Verwaltung

source: <emphasis>Figure 5.18. Queue management.</emphasis>
de: <emphasis>Abb. 5.18. Queue-Verwaltung.</emphasis>

source: Here you can add queues (see Figure 5.19 below) and modify them. You can specify the group that should use the queue. You can also set the queue as a sub-queue of an existing queue.
de: Hier können Sie Queues anlegen und verändern. Zusätzlich zum Namen der neuen Queue kann angegeben werden, für welche Benutzergruppe die Queue bereitgestellt werden und ob die neue Queue eine Unter-Queue (sub queue) von einer bereits in Ihrem System vorhandenen Queue sein soll.

source: <emphasis>Figure 5.19. Adding a new queue.</emphasis>
de: <emphasis>Abb. 5.19. Hinzufügen einer Queue.</emphasis>

source: You can define an unlock timeout for a queue - if an agent locks a ticket and does not close it before the unlock timeout has passed, the ticket will be automatically unlocked and made available for other agents to work on.
de: Wurde ein Ticket von einem Agenten gesperrt, so können Sie mit Hilfe des Freigabezeit-Intervalls festlegen, wann ein Ticket wieder automatisch vom System freigegeben werden soll. So können auch die anderen Mitarbeiter wieder auf dieses Ticket zugreifen und es bearbeiten.

source: There are three escalation time settings that can be associated at queue level:
de: Drei Arten von Eskalationszeiten können pro Queue eingestellt werden:

source: Escalation - First Response Time
de: Eskalation - Zeit für die erste Reaktion

source: After creation of the ticket, if the time defined here expires without any communication to the customer, either by email or phone, the ticket is escalated.
de: Nach der Erstellung wird dieses Ticket eskalieren, wenn die hier definierte Zeit verstreicht, ohne dass eine Kommunikation zum Kunden (per E-Mail oder Telefonanruf) stattgefunden hat.

source: Escalation - Update Time
de: Eskalation - Aktualisierungszeit

source: If there is any customer followup via e-mail or the customer portal and recorded in the ticket, the escalation update time is reset. If there is no customer contact before the time defined here expires, the ticket is escalated.
de: Wenn ein Artikel vom Kunden hinzugefügt wird, als E-Mail-Antwort oder über die Kundenoberfläche, wird die Aktualisierungszeit zurückgesetzt. Wenn anschließend für die definierte Zeitdauer keine Rückmeldung an den Kunden erfolgt, eskaliert das Ticket.

source: Escalation - Solution Time
de: Eskalation - Lösungszeit

source: If the ticket is not closed before the time defined here expires, the ticket is escalated.
de: Wenn das Ticket nicht innerhalb der definierten Zeitdauer geschlossen werden kann, eskaliert es.
