Repository: xhoy/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: de

source: The distribution of incoming messages can be controlled if they need to be sorted by queue or by the content of the "To:" field. For the Dispatching field, if "Dispatching by selected queue" is selected, all incoming messages will be sorted into the specified queue. The address where the mail was sent to is disregarded in this case. If "Dispatching by email To: field" is selected, the system checks if a queue is linked with the address in the To: field of the incoming mail. You can link an address to a queue in the <link linkend="adminarea-emailaddresses">E-mail address management</link> section of the Admin page. If the address in the To: field is linked with a queue, the new message will be sorted into the linked queue. If no link is found between the address in the To: field and any queue, then the message flows into the "Raw" queue in the system, which is the <link linkend="Ticket:Core::PostMaster:PostmasterDefaultQueue">PostmasterDefaultQueue</link> after a default installation.
de: Weiterhin können Sie die Verteilung der abgerufenen Mails durch die Angabe steuern, ob die neuen Nachrichten nach dem To-Feld oder nach der Queue im System einsortiert werden sollen. Wählen Sie "Verteilung nach ausgewählter Queue" aus, landen die abgerufenen Mails auf jeden Fall in der Queue, die zusätzlich in der dafür vorgesehenen Listbox angegeben werden kann. Dabei spielt keine Rolle, an welche Adresse die Mail geschickt wurde. Wählen Sie "Verteilung nach To: Feld" aus, wird überprüft, welcher Queue die Adresse zugeordnet ist, an die die abgerufene Mail gesendet wurde. Die Zuordnung einer Mailadresse zu einer Queue kann über die <link linkend="adminarea-emailaddresses">Mailadressen Verwaltung</link> vorgenommen werden. Existiert eine Zuordnung der Adresse im To: Feld zu einer Queue innerhalb des Systems, wird die abgerufene Nachricht in die entsprechende Queue einsortiert. Kann keine Zuordnung gefunden werden, landet das Ticket in der Standard-Queue des Systems (Raw), die mit Hilfe des Konfigurationsparameters <link linkend="Ticket:Core::PostMaster:PostmasterDefaultQueue">PostmasterDefaultQueue</link> eingestellt werden kann.

source: All data for the mail accounts are saved in the OTRS database. The <filename>otrs.PostMasterMailbox.pl</filename> script, which is located in the <filename>bin</filename> directory of your OTRS installation, uses the settings in the database and fetches the mail. You can execute <filename>./bin/otrs.PostMasterMailbox.pl</filename> manually to check if all your mail settings are working properly.
de: Die Daten zu allen Mail-Konten werden in der Datenbank von OTRS gespeichert. Das Skript <filename>otrs.PostMasterMailbox.pl</filename>, welches sich im Verzeichnis <filename>bin</filename> innerhalb des OTRS-Homeverzeichnisses befindet, fragt die Einstellungen ab und holt die Mails von den einzelnen Mail-Konten. Sie können dieses Skript manuell ausführen, um zu prüfen, ob alle E-Mail-Einstellungen korrekt funktionieren.

source: On a normal installation, the mail will be fetched every 10 minutes by the <filename>postmaster_mailbox</filename> cron job. For further information about modifying cron jobs, please refer to the <link linkend="cronjobs">"Setting up the cron jobs for OTRS"</link> section.
de: Auf einer Standardinstallation holt der Cron-Job <filename>postmaster_mailbox</filename> die E-Mails alle 10 Minuten ab. Das Kapitel <link linkend="cronjobs">"Einrichten der von OTRS benötigten cron-Jobs"</link> beschreibt das Zusammenspiel zwischen OTRS und cron ausführlicher.

source: When fetching mail, OTRS deletes the mail from the POP or IMAP server. There is no option to also keep a copy on the server. If you want to retain a copy on the server, you should create forwarding rules on your mail server. Please consult your mail server documentation for details.
de: Beim Abholen löscht OTRS die E-Mails vom POP oder IMAP server. Es besteht keine Möglichkeit, die Mails dort zu erhalten. Wenn Sie dies wünschen, erstellen Sie am Besten Weiterleitungsregeln auf Ihrem Mail-Server. Lesen Sie hierzu bitte in der Dokumentation ihres Mail-Servers nach.

source: Via command line program and procmail (otrs.PostMaster.pl)
de: Via Kommandozeilen-Programm und z. B. procmail (otrs.PostMaster.pl)

source: If you cannot use mail accounts to get the email into OTRS, the command line program <filename>bin/otrs.PostMaster.pl</filename> might be a way around the problem. It takes the mails via STDIN and pipes them directly into OTRS. That means email will be available in your OTRS system if the MDA (mail delivery agent, e.g. procmail) executes this program.
de: OTRS ist in der Lage, E-Mails über ein Kommandozeilen-Programm (<filename>bin/otrs.PostMaster.pl</filename>) zu empfangen. Es nimmt die Mails über STDIN entgegen und fügt sie direkt in das OTRS-System ein. Das bedeutet, dass E-Mails im OTRS angezeigt werden, wenn der MDA (mail delivery agent, z. B. procmail) die E-Mails an <filename>bin/otrs.PostMaster.pl</filename>" weiterleitet.

source: To test <filename>bin/otrs.PostMaster.pl</filename> without an MDA, execute the command of the Script 7.1.
de: Um <filename>bin/otrs.PostMaster.pl</filename> ohne MDA zu testen, führen Sie die Kommandos in Skript 7.1 aus.

source: <emphasis>Script 7.1. Testing PostMaster without the MDA.</emphasis>
de: <emphasis>Skript 7.1. PostMaster-Test ohne MDA.</emphasis>

source: If the email is shown in the QueueView, then your setup is working.
de: Wird die E-Mail in der Queue-Ansicht angezeigt, sind Ihre Einstellungen in Ordnung.

source: Procmail is a very common e-mail filter in Linux environments. It is installed on most systems. If not, have a look at the <ulink url="http://www.procmail.org/"><citetitle>procmail homepage</citetitle></ulink>.
de: Procmail ist in der Linux-Umgebung ein sehr bekannter E-Mail-Filter, der höchstwahrscheinlich auf Ihrem System installiert sein wird. Falls nicht, erhalten Sie auf der <ulink url="http://www.procmail.org/"><citetitle>procmail Homepage</citetitle></ulink> weitere Informationen.

source: To configure procmail for OTRS (based upon a procmail configured MTA such as sendmail, postfix, exim or qmail), use the <filename>~otrs/.procmailrc.dist</filename> file and copy it to <filename>.procmailrc</filename> and add the lines of the Script 7.2.
de: Um procmail einzurichten (benötigt einen für procmail konfigurierten MDA (z. B. sendmail, postfix, exim oder qmail)), kann die Datei<filename>.procmailrc.dist</filename> aus dem OTRS-Homeverzeichnis verwendet werden. Kopieren Sie <filename>.procmailrc.dist</filename> nach <filename>.procmailrc</filename> und nehmen Sie die in Skript 7.2 dargestellten Änderungen vor.

source: <emphasis>Script 7.2. Configuring procmail for OTRS.</emphasis>
de: <emphasis>Skript 7.2. Konfiguration von procmail für OTRS.</emphasis>

source: All email sent to the local OTRS user will be piped into <filename>bin/otrs.PostMaster.pl</filename> and then shown in your QueueView.
de: Alle an den lokalen OTRS-Benutzer gesendeten E-Mails werden an <filename>bin/otrs.PostMaster.pl</filename> weitergeleitet und dadurch im Ticket-System gespeichert.

source: Fetching emails via POP3 or IMAP and fetchmail for otrs.PostMaster.pl
de: E-Mails via POP3 oder IMAP und fetchmail für otrs.PostMaster.pl empfangen

source: In order to get email from your mail server, via a POP3 or IMAP mailbox, to the OTRS machine/local OTRS account and to procmail, use <ulink url="http://fetchmail.berlios.de/">fetchmail</ulink>.
de: Um E-Mails von Ihrem Mailserver via POP3 oder IMAP für den OTRS-Rechner/lokalen OTRS-Benutzer und procmail abzuholen, benutzen Sie <ulink url="http://fetchmail.berlios.de/">fetchmail</ulink>.

source: A working SMTP configuration on the OTRS machine is required.
de: Voraussetzung ist eine funktionierende SMTP-Konfiguration auf dem OTRS-Rechner.

source: You can use the <filename>.fetchmailrc.dist</filename> in the home directory of OTRS and copy it to <filename>.fetchmailrc</filename>. Modfiy/change it for your needs (see the Example 7-1 below).
de: Eine Beispielkonfiguration finden Sie in der Datei <filename>.fetchmailrc.dist</filename> im Homeverzeichnis von OTRS. Kopieren Sie diese Datei nach <filename>.fetchmailrc</filename> und erweitern Sie die Datei um die Daten Ihrer E-Mail-Accounts (siehe Beispiel 7-1).

source: Don't forget to set the .fetchmailrc to 710 ("chmod 710 .fetchmailrc")!
de: Vergessen Sie nicht, die Zugriffsrechte von <filename>.fetchmailrc</filename> auf 710 zu setzen.

source: With the <filename>.fetchmailrc</filename> from the Example 7-1 above, all email will be forwarded to the local OTRS account, if the command <command>fetchmail -a</command> is executed. Set up a cronjob with this command if you want to fetch the mails regularly.
de: Wird das Kommando <command>"fetchmail -a</command> mit dieser Konfiguration ausgeführt, werden alle E-Mails auf das lokale OTRS-Konto weitergeleitet. Richten Sie ggf. einen Cronjob ein, wenn die E-Mails regelmäßig geholt werden sollen.

source: Filtering/dispatching by OTRS/PostMaster modules (for more complex dispatching)
de: Filterung/Verteilung über PostMaster-Module (für komplexere Verteilungsszenarien)

source: If you use the bin/otrs.PostMaster.pl or bin/otrs.PostMasterMailbox.pl method, you can insert or modify X-OTRS header entries with the PostMaster filter modules. With the X-OTRS headers, the ticket system can execute some actions on incoming mails, sort them into a specific queue, change the priority or change the customer ID, for example. More information about the X-OTRS headers are available in the section about <link linkend="adminarea-postmasterpop3-account">adding mail accounts</link> from the OTRS Admin page.
de: Falls die <filename>bin/otrs.PostMaster.pl</filename> oder <filename>bin/otrs.PostMasterMailbox.pl</filename> Methoden verwendet werden, können X-OTRS-Header mit Hilfe der PostMaster-Filtermodule in die eingehenden Mails eingefügt bzw. bereits vorhandene X-OTRS-Header verändert werden. Mit Hilfe von X-OTRS-Headern kann das Ticket System bestimmte Aktionen für Mails ausführen, z. B. diese in eine bestimmte Queue einsortieren, sie einem bestimmten Kunden zuordnen, die Priorität ändern usw. Eine nähere Beschreibung der X-OTRS-Header finden Sie im Kapitel zum <link linkend="adminarea-postmasterpop3-account">Einrichten von Mail-Accounts</link> über den Administrations-Bereich von OTRS.

source: There are some default filter modules:
de: Es gibt verschiedene Standard-Filtermodule:

source: The job name (e.g. $Self-&gt;{'PostMaster::PreFilterModule'}-&gt;{'JobName'}) needs to be unique!
de: Der Jobname (z. B. $Self-&gt;{"PostMaster::PreFilterModule"}-&gt;{"Jobname"}) muss eindeutig sein!

source: Kernel::System::PostMaster::Filter::Match is a default module to match on some email header (e.g. From, To, Subject, ...). It can set new email headers (e.g. X-OTRS-Ignore: yes or X-OTRS-Queue: spam) if a filter rule matches. The jobs of the Example 7-2 can be inserted in <filename>Kernel/Config.pm</filename>
de: Kernel::System::PostMaster::Filter::Match ist ein Standard-Modul, um einige E-Mail-Header (z. B. From, To, Subject) zu prüfen und dann den neuen E-Mail-Header zu setzen (z. B. X-OTRS-Ignore: yes oder X-OTRS-Queue: spam).

source: Example jobs for the filter module Kernel::System::PostMaster::Filter::Match
de: Beispiel-Jobs für das Filtermodul Kernel::System::PostMaster::Filter::Match

source: Kernel::System::PostMaster::Filter::CMD is a default module to pipe the email into an external command. The output is given to STDOUT and if the result is true, then set new email header (e.g. X-OTRS-Ignore: yes or X-OTRS-Queue: spam). The Example 7-3 can be used in <filename>Kernel/Config.pm</filename>
de: Kernel::System::PostMaster::Filter::CMD ist ein Standard-Modul, um die E-Mails an ein externes Kommando zu leiten. Dessen Ergebniss wird an STOUT ausgegeben und, falls das Ergebnis aus STDOUT true ist, wird ein neuer E-Mail-Header gesetzt (z. B. X-OTRS-Ignore: yes oder X-OTRS-Queue: spam).

source: Example job for the filter module Kernel::System::PostMaster::Filter::CMD
de: Beispiel-Job für das Filtermodul Kernel::System::PostMaster::Filter::CMD

source: Of course it's also possible to develop your own PostMaster filter modules.
de: Natürlich ist es auch möglich, eigene PostMaster-Filtermodule zu entwickeln.

source: Time related functions
de: Zeitabhängige Funktionen in OTRS

source: Setting up business hours, holidays and time zones
de: Arbeitszeiten, Feiertage und Zeitzonen für das System festlegen

source: Some functions in OTRS, like escalations and <link linkend="unlock-tickets">automatic unlocking of tickets</link>, depend on a proper configuration of business hours, time zones and holidays. You can define these via the <link linkend="sysconfig">SysConfig interface</link>, in <link linkend="Framework:Core::Time">Framework &gt; Core::Time</link>. You can also specify different sets of business hours, holidays and time zones as separate 'Calendars' in <link linkend="Framework:Core::Time::Calendar1">Framework &gt; Core::Time::Calendar1</link> through <link linkend="Framework:Core::Time::Calendar9">Framework &gt; Core::Time::Calendar9</link>. Calendars can be defined by <link linkend="adminarea-queue">queue settings</link>, or on SLA levels. This means that, for example, you can specify a calendar with 5 x 8 business hours for your 'standard' SLA, but create a separate calendar with 7 x 24 support for your 'gold' SLA; as well as set a calendar for your 'Support-USA' queue with a different time window than your 'Support-Japan' queue. OTRS can handle up to 99 different calendars.
de: Einige Funktionen in OTRS, wie <link linkend="unlock-tickets">das automatische Entsperren von Tickets</link>, setzen eine korrekte Konfiguration von Arbeitszeiten, Zeitzonen und Feiertagen voraus. Sie können diese in der <link linkend="sysconfig"> SysConfig </link> definieren, in <link linkend="Framework:Core::Time">Framework &gt; Core::Time</link>. Ebenso können Sie verschiedene Typen von Arbeitszeiten, Feiertagen und Zeitzonen als separate "Kalender" in <link linkend="Framework:Core::Time::Calendar1">Framework > Core::Time::Calendar1</link> bis <link linkend="Framework:Core::Time::Calendar9">Framework > Core::Time::Calendar9</link> definieren. Kalender können auf <link linkend="adminarea-queue">Queue</link>- oder SLA-Ebene definiert werden. Das heißt, dass Sie z. B. einen Kalender mit 5x8 Arbeitsstunden pro Woche für Ihren "Standard"-SLA definieren können, zusätzlich jedoch auch einen mit 7x24 für Ihren "Gold"-SLA. Ebenso kann der Kalender für Ihre Queue "Support-USA" ein anderes Arbeitszeitfenster haben als ihre Queue "Support-Japan". OTRS kann bis zu 99 verschiedene Kalender verwalten.

source: Business Hours
de: Arbeitszeiten

source: Set up the working hours for your system in SysConfig <link linkend="Framework:Core::Time:TimeWorkingHours">Framework &gt; Core::Time::TimeWorkingHours</link>, or for your specific calendar in the calendar's configuration. OTRS can handle a granularity of one hour. Checking the marks in the boxes 8, 9, 10 ... 18 corresponds with business hours of 8 AM - 6 PM.
de: Setzen Sie die Arbeitszeiten für Ihr System in der SysConfig fest, in <link linkend="Framework:Core::Time:TimeWorkingHours"> Framework> Core::Time::TimeWorkingHours </link> oder in der Konfiguration Ihrer Kalender. OTRS unterstützt eine Granularität von einer Stunde. Um z. B. 8:00 bis 18:00 als Arbeitszeit festzulegen, müssen die Auswahlkästchen 8, 9, 10 .. 17 aktiviert werden.

source: Only during business hours can tickets escalate, notifications for escalated and pending tickets be sent, and tickets be unlocked.
de: Nur während dieser Stunden können Tickets eskalieren, Benachrichtigungen zu Erinnerungs-Tickets versendet oder Tickets automatisch freigegeben werden. Weiterhin werden auch nur diese Stunden in die Berechnung der Eskalationszeit und der Zeit für die automatische Freigabe mit einbezogen.

source: Fixed date holidays
de: Feiertage mit festem Datum

source: Holidays that are on a fixed date every year, such as New Year's Day or the Fourth of July, can be specified in <link linkend="Framework:Core::Time:TimeVacationDays">TimeVacationDays</link>, or in the corresponding section for the calendars 1-9.
de: Feiertage deren Datum jedes Jahr gleich ist, können dem System in <link linkend="Framework:Core::Time:TimeVacationDays"> TimeVacationDays </link> oder im entsprechenden Abschnitt in den Kalendern 1-9 bekannt gemacht werden.

source: Tickets will not escalate nor get unlocked on dates defined in TimeVacationDays.
de: Während der hier festgelegten Tage werden keine zeitabhängigen Aktionen oder Berechnungen auf Tickets im system ausgeführt.

source: By default, OTRS ships with the <emphasis>German</emphasis> holidays installed.
de: In OTRS sind die <emphasis>deutschen</emphasis> Feiertage voreingestellt.

source: Holidays such as Easter that do not have a yearly fixed date but instead vary each year, can be specified in <link linkend="Framework:Core::Time:TimeVacationDaysOneTime">TimeVacationDaysOneTime</link>.
de: Freie oder Feiertage, für die sich jährlich das Datum ändert, können in <link linkend="Framework:Core::Time:TimeVacationDaysOneTime"> TimeVacationDaysOneTime </link> angegeben werden.

source: Tickets will not escalate and will not be unlocked on dates defined in TimeVacationDaysOneTime.
de: Während der hier festgelegten Tage werden keine zeitabhängigen Aktionen oder Berechnungen auf Tickets im system ausgeführt.

source: OTRS does not ship with any One-Time holidays pre-installed. This means that you need to add holidays, such as Easter or Thanksgiving, to the system when configuring OTRS.
de: OTRS hat für diese Feiertage keine Voreinstellung. Sie müssen diese, wie z. B. Ostern, dem System also selbst bekannt machen.

source: Automated Unlocking
de: Automatische Ticket-"Freigabe" (unlock)

source: Locked tickets can be automatically unlocked by the system. This feature might be useful if, for example, an agent has locked tickets that need to be processed, but he can't work on them for some reason, say because he is out of the office on an emergency. The automated unlock feature unlocks tickets after a given time to ensure that no locked tickets will be forgotten, thereby allowing other agents to process them.
de: Gesperrte Tickets können automatisch vom System freigegeben werden. Diese Funktion kann z. B. dann nützlich sein, wenn sich ein Agent im Urlaub befindet und noch Tickets gesperrt hat, die bearbeitet werden sollen / müssen. Dieses Feature entsperrt Tickets nach einer bestimmten Zeit, um sicherzustellen, dass gesperrte Tickets nicht vergessen werden und andere Agenten darauf zugreifen können.

source: The amount of time before a ticket is unlocked can be specified in the <link linkend="adminarea-queue">queue settings</link> for every queue. The module <filename>bin/otrs.UnlockTickets.pl</filename>, which is executed periodically as a cron job, performs the automated unlocking of tickets.
de: Die Zeit, nach der gesperrte Tickets automatisch freigegeben werden, kann in den <link linkend="adminarea-queue">Einstellungen jeder Queue</link> festgelegt werden. Mit Hilfe des Moduls <filename>bin/otrs.UnlockTickets.pl</filename>, das als cron-Job regelmäßig ausgeführt werden sollte, wird die automatische Freigabe von Tickets umgesetzt.

source: Notifications on unlocked tickets are sent out only to those agents that have the queue with the unlocked tickets set in "My queues", and that have activated the notification on unlocked tickets in their personal <link linkend="user-preferences">preferences</link>.
de: Benachrichtigungen für entsperrte Tickets werden nur zu den Benutzern versendet, die die jeweilige Queue in "Meine Queues" eingetragen und die Benachrichtigung für entsperrte Tickets in ihren <link linkend="user-preferences"> persönlichen Einstellungen </link> aktiviert haben.

source: Tickets will be unlocked if all of the following conditions are met:
de: Tickets werden entsperrt wenn folgende Bedingungen zutreffen:

source: There is an <emphasis>unlock timeout</emphasis> defined for the queue the ticket is in.
de: In der Queue des Tickets ist ein <emphasis>Freigabe-Zeitintervall</emphasis> definiert.

source: The ticket is set to <emphasis>locked</emphasis>.
de: Das Ticket ist <emphasis>gesperrt</emphasis>.

source: The ticket state is <emphasis>open</emphasis>.
de: Der Status des Tickets is <emphasis>offen"</emphasis>.

source: The unlock timer will be reset if an agent adds a new external article to the ticket. It can be of any of the following types: <emphasis>email-external</emphasis>, <emphasis>phone</emphasis>, <emphasis>fax</emphasis>, <emphasis>sms</emphasis>, or <emphasis>note-external</emphasis>.
de: Die Freigabezeit wird zurückgesetzt, wenn ein Agent einen neuen externen Artikel zum Ticket hinzufügt. Das kann einer der folgenden Artikeltypen sein: <emphasis>email-external</emphasis>, <emphasis>phone</emphasis>, <emphasis>fax</emphasis>, <emphasis>sms</emphasis>, or <emphasis>note-external</emphasis>.

source: Also, if the last article in the ticket is created by an agent, and a customer adds another one, either via web or email response, the unlock timer will be reset.
de: Die Freigabezeit wird auch zurückgesetzt, wenn der letzte Artikel von einem Agent stammt und dann der Kunde einen hinzufügt, per E-Mail oder Weboberfläche.

source: The last event that will reset the unlock timer is when the ticket is assigned to another agent.
de: Zuletzt wird die Freigabezeit auch dann zurückgesetzt, wenn das Ticket einem anderen Agenten zugewiesen wird.

source: Ticket Responsibility &amp; Ticket Watching
de: Ticket-Verantwortlicher und Beobachten von Tickets

source: From OTRS 2.1 on, it is possible to assign a person as being responsible for a ticket, additionally to its owner. Moreover, all activities connected with the ticket can be watched by someone other than the ticket owner. These two functionalities are implemented with the TicketResponsible and TicketWatcher features, and facilitate the assignment of tasks and working within hierarchical team structures.
de: Seit OTRS 2.1 kann zusätzlich zum Besitzer ein Verantwortlicher für das Ticket festgelegt werden. Zudem können alle Aktivitäten rund um das Ticket beobachtet werden. Diese beiden Funktionalitäten sind mit den TicketResponsible- und dem TicketWatcher-Funktionen implementiert, und erleichtern das Zuweisen von Aufgaben und die Arbeit in hierarchischen Teamstrukturen.

source: Ticket Responsibility
de: Ticket-Verantwortlicher

source: The ticket responsiblility feature facilitates the complete processing of a ticket by an agent other than the ticket owner. Thus an agent who has locked a ticket can pass it on to another agent, who is not the ticket owner, in order for the second to respond to a customer request. After the request has been dealt with, the first agent can withdraw the ticket responsibility from the second agent.
de: Die Funktion "Verantwortlicher" eines Tickets macht es möglich, das Ticket einem anderen als dem aktuellen Besitzer zur Bearbeitung zu übergeben. Ein Benutzer, der ein Ticket gesperrt hat, kann es einem anderen Agenten, der nicht der Ticketbesitzer ist, zur Beantwortung übergeben. Nach der Bearbeitung kann der erste Benutzer die Ticketverantwortung vom zweiten wieder entfernen.
