Repository: xhoy/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: de

source: Adding own (internal or external) notes to a ticket (text and attachments).
de: Hinzufügen eigener (interner oder externer) Notizen zu einem Ticket (eigener Text und Dateianhänge).

source: Ticket zooming.
de: Möglichkeit zum Zoomen von Tickets.

source: Access control lists for tickets can be defined.
de: Definition von ACLs (access control lists) für Tickets.

source: Forwarding or bouncing tickets to other mail addresses.
de: Tickets können an andere E-Mail-Adressen weiter- oder umgeleitet werden (forwarding, bouncing).

source: Moving tickets between queues.
de: Verschieben von Tickets zwischen verschiedenen Queues.

source: Changing/setting the priority of a ticket.
de: Festlegen der Priorität für Tickets.

source: The working time for every ticket can be counted.
de: Erfassung der Bearbeitungsdauer für Tickets.

source: Up-coming tasks for a ticket can be defined (pending features).
de: Anstehende Aufgaben für ein Ticket festlegen (pending features).

source: Bulk actions on tickets are possible.
de: Massenoperationen auf Tickets sind möglich (bulk features).

source: Automatic and timed actions on tickets are possible with the "GenericAgent".
de: Automatische und zeitgesteuerte Aktionen können mit Hilfe eines sog. "GenericAgent" auf Tickets ausgeführt werden.

source: Full text search on all tickets is possible.
de: Volltextsuche über den gesamten Ticketbestand und Export der Suchergebnisse als PDF.

source: OTRS runs on many operating systems (Linux, Solaris, AIX, FreeBSD, OpenBSD, Mac OS 10.x, Microsoft Windows).
de: OTRS läuft unter vielen Betriebssystemen (Linux, Solaris, AIX, FreeBSD, OpenBSD, Mac OS 10.x, Microsoft Windows).

source: ASP support (active service providing).
de: Unterstützung von ASP (active service providing).

source: Linking several objects is possible, e.g. tickets and FAQ entries.
de: Verknüpfung von Objekten wie z. B. Tickets, FAQ-Einträgen o.ä. innerhalb des Systems.

source: Integration of external back-ends for the customer data, e.g. via AD, eDirectory or OpenLDAP.
de: Einbindung externer Datenquellen für die Kundendaten, z. B. über AD, eDirectory oder OpenLDAP).

source: Setting up an own ticket identifier, e.g. Call#, Ticket# or Request#.
de: Festlegen einer eigenen Kennzeichnung für Tickets, z. B. Call#, Ticket#, Request# o.ä.

source: The integration of your own ticket counter is possible.
de: Festlegen einer eigenen Nummerierung für Tickets.

source: Support of several database systems for the central OTRS back-end, e.g. MySQL, PostgreSQL, Oracle, DB2).
de: Unterstützung verschiedener Datenbanktypen für die zentrale Datenbank von OTRS (MySQL, PostgreSQL, Oracle MSSQL, DB2, usw.).

source: Framework to create stats.
de: Framework für die Erstellung von Statistiken über die Web-Oberfläche, Export und Import von Reports und Statistikmodulen, Export von Statistiken als PDF ist möglich.

source: utf-8 support for the front- and back-end.
de: Unicode-Unterstützung für Front- und Back-End.

source: Authentication for customers via database, LDAP, HTTPAuth or Radius.
de: Die Authentifikation für Agenten oder Kunden kann unabhängig voneinander über eine Datenbank, LDAP, HTTPAuth oder Radius realisiert werden.

source: Support of user accounts, user groups and roles.
de: Unterstützung von Benutzer-Accounts, Benutzergruppen und Rollen.

source: Support of different access levels for several systems components or queues.
de: Unterstützung verschiedener Zugriffsrechte, z. B. auf Queues oder Systembereiche.

source: Integration of standard answer texts.
de: Die Erstellung von Standardantworten ist möglich.

source: Support of sub queues.
de: Unter-Queues werden unterstützt.

source: Different salutations and signatures can be defined for every queue.
de: Anreden und Signaturen können abhängig von der Queue definiert werden.

source: Email notifications for admins.
de: E-Mail-Benachrichtigungen für Administratoren.

source: Information on updates via mail or the web interface.
de: Bekanntgabe von Informationen zu Updates über die Weboberfläche oder via E-Mail.

source: Escalation for tickets.
de: Festlegen von Ablauffristen für problematische Tickets.

source: Support for different time zones.
de: Benutzerabhängige Unterstützung für verschiedene Zeitzonen.

source: Simple integration of own add-ons or applications with the OTRS API.
de: Einfache Einbindung eigener Addons und Module mit Hilfe der OTRS API.

source: Simple creation of own front-ends, e.g. for X11, console.
de: Einfache Erstellung eigener Front-Ends, z. B. X11, Console usw.

source: Top new features of OTRS 3.0
de: Die wichtigsten neuen Features von OTRS 3.0

source: Context
de: Kontext

source: User Centered redesign of the Graphical User Interface which results in a dramatic shift from a comprehensive but static to a more powerful and dynamic application using state-of-the art technologies like Ajax, xHTML and optimized CSS.
de: Benutzerzentriertes Redesign der graphischen Benutzerschnittstelle, welches einen Übergang zu dynamischen Technologien wie AJAX, XHTML und CSS beinhaltet.

source: New Ticket and Article Indicator
de: Hervorhebung für "neue Tickets" und "neue Artikel"

source: This new feature has been implemented on both ticket and article level. It allows an agent at a glance to check for any updates within a ticket or on the article level to check for new and unread articles. You benefit from increased transparency and decreased response times.
de: Dieses neue Feature wurde für Tickets und Artikel implementiert. Es erlaubt einem Agenten, auf einen Blick zu erkennen, ob zu bestimmten Tickets oder auch innerhalb eines Artikels neue, ungelesene Artikel gibt. Sie profitieren durch erhöhte Transparenz und kürzere Reaktionszeiten.

source: Optimized Fulltext Search
de: Optimierte Volltextsuche

source: The new search feature allows you to flexibly customize the way you browse the information base. Options the new search feature provides range from single search-string searches to complex multi-string boolean search operations including various operators. You benefit from fully customizable searches according to your needs.
de: Das neue Such-Feature erlaubt es, die vorhandenen Informationen flexibel zu durchforsten. Die Optionen reichen von einfachem Suchwort bis hin zu komplexen, multi-Wort-fähigen booleschen Suchoperationen, in denen man verschiedene Operatoren verwenden kann. Somit stehen ihnen gemäß Ihrer Anforderungen anpassbare Suchmöglichkeiten zur Verfügung.

source: New Ticket Zoom View
de: Neue Ticket-Zoom-Ansicht

source: The redesign based on Ajax technology allows agents to display complex and linked information structures in real-time while keeping the agents' current working environment. The agent will benefit from increased orientation and increased workflow efficiency.
de: Die neue, AJAX-basierte Ticket-Zoom-Ansicht erlaubt die Darstellung komplexer und verknüpfter Informationen in Echtzeit unter Beibehaltung der aktuellen Arbeitsumgebung des Agenten. Letzterer profitiert von verbesserter Orientierung und daraus folgend höherer Arbeitseffizienz.

source: Global Ticket Overviews
de: Globale Ticketübersichten

source: Well known from OTRS 2.4 the global ticket overviews have been optimized to achieve increased inter- activity. Depending on the use case and preferences of your agents they can easily change the ticket overviews layout according to their special needs. Options are small, medium and large, each providing a different degree of information details.
de: Die seit OTRS 2.4 wohlbekannten Ticketübersichten wurden für verbesserte Interaktivität optimiert. Je nach Anwendungszenario können Ihre Agenten die Ticketübersicht leicht wechseln. Klein, Mittel und Groß stehen zur Verfügung und stellen jeweils eine unterschiedliche Detailtiefe bereit.

source: Accessability
de: Zugänglichkeit

source: The redesign includes common accessibility standards WCAG and WAI-ARIA which also allows disabled users to better interact with OTRS Help Desk. The US Rehabilitation Acts Section 508 has been fulfilled.
de: Das Redesign berücksichtigt die anerkannten Zugänglichkeits-Standards WCAG und WAI-ARIA. Dadurch können behinderte Nutzer besser mit OTRS arbeiten. Die Bestimmungen des Abschnitt 508 des US Rehabilitation Act werden erfüllt.

source: New Customer Interface
de: Neues Kunden-Interface

source: The customer web front-end can be integrated to your organizations intranet and is fully integrated into the redesigned help desk system.
de: Das Kunden-Web-Interface kann in das Intranet Ihrer Organisation integriert werden und ist eng mit dem neuen OTRS-System verzahnt.

source: Archive Feature
de: Archivierungs-Feature

source: OTRS 3.0 now offers a new archiving feature. With a separated archive you'll benefit from a reduced time spent for searches and increased display of results.
de: Mit OTRS 3.0 können Sie Tickets archivieren. Dadurch verkürzen sich Zeiten für Suchabfragen und deren Ergebnisauswertung.

source: New features of OTRS 2.4
de: Neue Features von OTRS 2.4

source: Licensing changed to AGPL Version 3
de: Lizenzwechsel auf die AGPL Version 3

source: Why AGPL instead of GPL? - AGPL and GPL are identical, with one exception: For software used in an SaaS environment Copyleft is effective in AGPL - which is not the case when using GPL. Keeping in mind the growing world of SaaS, ((otrs)) wants to ensure that future developments continue to return to the OTRS community. This is the reason for the switch to AGPL.
de: Warum AGPL statt GPL? AGPL und GPL sind bis auf einen einzigen Punkt identisch. Wird Software im Bereich SaaS eingesetzt, greift bei der AGPL das Copyleft, bei der GPL nicht. Wir möchten, dass auch im wachsenden SaaS-Umfeld Weiterentwicklungen an OTRS in die Community zurückfließen.

source: Why v3 instead of v2? - GPL v2 is getting older and has, especially in the USA, various legal uncertainties. In the opinion of ((otrs)) GPL v3 is keeping the spirit of GPL v2, and at the same time has been tailored to new needs. ((otrs)) views GPLv3, more specifically AGPLv3, as being the best balanced Copyleft Open Source License available today, offering Protection for copyright owners and users and providing the best security under the law.
de: Warum v3 statt v2? Die GPL v2 ist in die Jahre gekommen und hat insbesondere außerhalb der USA diverse rechtliche Unsicherheiten. Die GPLv3 bzw. AGPLv3 ist unter den Open Source Lizenzen diejenige Copyleft-Lizenz, die sowohl den Copyright-Inhabern als auch dem Anwender den besten Schutz und die größte Rechtssicherheit bietet.

source: New Management Dashboard
de: Neues Management-Dashboard

source: The need for a system-spanning, next to real-time, and personalized presentation of useful information led to an integrated Management Dashboard. It is possible to create plug-ins to display content from individual extensions alongside the standard content. Standard plug-ins are:
de: Der Bedarf an einer systemweiten, personalisierten und aktuellen Präsentation wichtiger Informationen hat zur Entwicklung des Management-Dashboards geführt. Dafür können Plugins erstellt werden, die Inhalte von Erweiterungsmodulen zusätzlich zu den standardmäßig verfügbaren Informationen darstellen. Standard-Plugins sind:

source: Ticket volume (new &amp; open) from the last 24h, 48h and 72h
de: Ticket-Volumen (neu &amp; offen) der letzten 24h, 48h und 72h

source: Calendar including an overview of upcoming events (escalations, auto-unlocks, etc.)
de: Kalender mit anstehenden Ereignissen (Eskalationen, automatische Ticketentsperrungen usw.)

source: System-wide overview of ticket distribution within the queues
de: Systemweite Übersicht der Ticketverteilung in den Queues

source: First Response Time/Solution Time of Queues
de: Zeit für die erste Reaktion / Lösungszeit von Queues

source: Integration of RSS
de: RSS-Integration

source: New Standard Reports
de: Weitere Standard-Reports

source: The new reports provided with OTRS 2.4 are:
de: Die zusätzlichen Standardreports von OTRS 2.4 sind:

source: Created Tickets
de: Erstellte Tickets

source: Closed Tickets
de: Geschlossene Tickets

source: SLA Analysis
de: SLA-Analyse

source: Required working time per customer / per queue
de: Benötigte Bearbeitungszeit pro Kunde / pro Queue

source: Solution time analysis per customer / per queue
de: Analyse der Lösungszeit pro Kunde / pro Queue

source: Answer time analysis per customer / per queue
de: Analyse der Antwortzeit pro Kunde / pro Queue

source: New Master/Slave Ticket Feature
de: Neues Master/Slave Ticket-Feature

source: With the Master/Slave Ticket, it is possible to link multiple tickets of a similar nature, and handle them collectively. As soon as the problem is solved, only the master ticket must be closed. All other tickets will be closed automatically, and the solution text for the master ticket will be sent to all customers of slave tickets.
de: Die Master Slave Funktion erlaubt Ihnen, Tickets zum gleichen Thema zu markieren, um sie über das Master-Ticket gebündelt abzuarbeiten. Die Slave-Tickets werden automatisch gelöst und Ihre Kunden mit der im Master-Ticket hinterlegten Antwort benachrichtigt, wenn das Master-Tickt auf gelöst gesetzt wird.

source: A new link type 'Slave' will be available. All tickets with this Type of link will inherit the following actions from their Master ticket:
de: Alle Slave-Tickets, 'erben' die folgenden Aktionen ihres Masters:

source: Status change
de: Status ändern

source: Email answers
de: Email-Antworten

source: Change in FreeText fields
de: Freitextfelder verändern

source: Notes
de: Anmerkungen

source: Pending time changes
de: Wartezeit ändern

source: Priority changes
de: Priorität ändern

source: Owner changes
de: Besitzer ändern

source: Responsibility changes
de: Verantwortlichen ändern

source: New Rich-Text/HTML E-Mail Support (WYSIWYG)
de: HTML E-Mail Unterstützung

source: With this feature, it is now possible to write e-mails, notes, and notifications in rich text format (HTML format). Using a WYSIWYG editor (What You See Is What You Get), it is possible to comfortably write using formatted text and even include in-line pictures.
de: Erstellen und formatieren Sie E-Mails, Notizen &amp; Benachrichtigungen nun auch im Rich-Text-Format (HTML-Format) oder binden Sie Bilder über der WYSIWYG-Editor ein.

source: New Out-Of-Office Feature
de: Neue Out-Of-Office-Funktion

source: With this new feature it is possible for all users to activate "out-of-office" to notify colleagues and OTRS of the period of their absence. The out-of-office feature is active for a time frame set by the user. Activation of this feature has the following effects:
de: Definieren Sie über Ihre persönlichen Einstellungen den Zeitraum Ihrer Abwesenheit. Aktivierung hat folgende Auswirkungen:

source: In the lists in which an agent can be selected as owner or responsible (i.e. Ticket creation or changing ownership), the period of absence and the time till return will be shown behind the user's name. This will help making the absence of the user more transparent.
de: In Auswahllisten, die der Zuweisung eines Besitzers oder Verantwortlichen dienen, wird die Abwesenheitszeit und -dauer hinter Ihrem Namen dargestellt.

source: If an agent receives a follow-up during a period of absence, the ticket is automatically unlocked and a notification is sent to all agents in the queue. This allows immediate reaction to the customer follow-up by another service employee.
de: Bei FollowUps, wird das Ticket vollautomatisch "entsperrt" und das Bearbeitungs-Team der Queue erhält eine Benachrichtigung.

source: New Ticket Overviews and global Bulk Action
de: Neue Ticket-Übersichten und globale Sammelaktion

source: Flexibility of presentation within the ticket overview is a must. Based on the "S/M/L" (Small/Medium/Large) Ticket View every agent has the possibility to change the view for each type of overview (Queue View, Status View, etc) on-the-fly with a simple mouse click on the appropriate icon. This allows for the highest possible level of individualization and adjustment to any operational situation.
de: Flexibel zur Laufzeit gestaltbare Ticket-Übersichten erleichtern Ihnen die tägliche die Arbeit. Ob tabellarische Übersicht oder Ticket-Vorschau, ein Small / Medium / Large View Icon erlaubt es Ihnen, sich je nach Einsatzszenario Ihre Übersichten, z. B. den Queue View, Status View, Escalation View oder Suchergebnisse individuell einzurichten.

source: Additionally, decentralization of the Bulk Action feature integrated the Bulk Action in all ticket overviews (Bulk Action allows processing of multiple tickets at a time).
de: Die systemweit in allen Ticket-Übersichten integrierte Sammelaktion erlaubt Ihnen die gleichzeitige Bearbeitung mehrerer Tickets.

source: Postmaster Filter recognizes Follow-Ups to internal forwarded messages
de: Postmaster-Filter erkennen Follow-Ups zu intern weitergeleiteten Nachrichten

source: Currently, e-mail replies to forwarded articles arrive in OTRS as email-external. The problem is that the answers to these forwarded articles can be seen by the customer in the web- interface. Although it is possible to classify e-mails of an entire domain as email-internal, this only shifts the problem. Also, such step makes it impossible to properly service customers in the domain, as the customer would not be able to track tickets in the customer web-interface any more. With this new feature, e-mail replies can be traced back, and email- internal or email-external will be set based upon the original Forward-Article type.
de: Derzeit werden E-Mail-Antworten auf weitergeleitete Artikel in OTRS als "email-extern" aufgenommen. Das Problem dabei ist, dass diese Antworten vom Kunden im Web-Interface eingesehen werden können. Zwar wäre es möglich, E-Mails generell als "email-intern" zu klassifizieren, doch dann können Kunden nicht mehr angemessen bedient werden, weil sie ihre Tickets im Web-Interface nicht mehr korrekt nachverfolgen könnten. Mit diesem neuen Feature können E-Mail-Antworten zurückverfolgt werden, und der Artikeltyp "email-extern" oder "email-intern" wird je nach dem Typ des ursprünglichen Artikels automatisch gesetzt.

source: Configurable event based notifications
de: Konfigurierbare Event-basierte Benachrichtigungen

source: Until now, a very inflexible notification could be sent to an agents and customers, for example Agent: New Ticket or Customer: Status Change. In order to make the notification system more flexible, a complete overhaul was performed on the messaging mechanism. The new system allows messaging to agents, customers, or a dedicated email address, based on the event taking place.
de: Um eine höhere Flexibilität für E-Mail-Benachrichtigungen zu erreichen, wurde ein komplett neuer Benachrichtigungs-Mechanismus implementiert. Dieser ermöglicht es, event-basierte Benachrichtigungen an Agenten, Kunden oder dedizierte Email-Adressen zu versenden.

source: With this, it is now possible to just inform the customer when the ticket has been closed. Or, for example, when a VIP customer creates a ticket, a message can be sent to a specific address. Events (i.e. TicketCreate, TicketStateUpdate, TicketPriorityUpdate, ArticleCreate), and all known message variables (i.e. &lt;OTRS_TICKET_TicketNumber&gt; &lt;OTRS_TICKET_Priority&gt;), are freely selectable for creating triggered messages via the web interface.
de: Somit ist es einfach möglich, nur beim Schließen eines Tickets eine E-Mail-Benachrichtigung an den Kunden eines Tickets zu senden. Oder z. B. beim Erstellen von VIP Tickets für einen bestimmten Kundenkreis mit sehr hoher Priorität, eine bestimmte E-Mail-Adresse (z. B. ein Bereitschaftshandy) zu benachrichtigen. Die dabei jeweils zu berücksichtigenden Events (z. B. Erstellung neuer Tickets, Ticketstatus-Update, Queue-Update, Erstellung neuer Artikel, usw.) und Inhalt der Benachrichtigungen (inkl. OTRS-Platzhalter) sind frei über ein Web-Interface konfigurierbar.

source: READ-ONLY Permissions and Notifications with watched Tickets
de: Leserechte und Benachrichtigungen auf Tickets der Watchliste

source: In the current release of OTRS it is possible for a user to maintain a Watched Tickets List. This feature is dealing with tickets marked as "subscribed" by a user. It has the advantage that users no longer lose track of tickets marked as "sub- scribed", and are able to view them on an individual list. The "Read-Only" Feature - Up to now, tickets marked as "sub- scribed" were shown in a list, however, the agent could only actually view them if they were in a queue for which the agent had read permissions. With the "Read-Only" Feature, agents subscribed to a ticket always have read permissions on the ticket, even if the ticket is moved to a queue where the agent has no permissions. "Notify" Feature - Via a personalized setting, every agent can define whether or not to receive notifications about tickets, just as the owner and responsible of a ticket would receive. This allows for active tracking of watched tickets.
de: Mit der "Read-Only"-Feature haben Sie Leserechte auf ein Ticket in Ihrer Watchliste, auch wenn das Ticket in eine Queue verschoben wurde, in der Sie keine Leserechte haben. Über Ihre persönlichen Einstellungen haben Sie die Möglichkeit zu definieren, ob Sie bei beobachteten Tickets, wie ein Besitzer oder Verantwortlicher über Änderungen per E-Mail benachrichtigt werden soll.

source: Secure SMTP
de: Secure SMTP-Unterstützung

source: OTRS can receive and send mails in multiple ways. All currently available methods for receiving emails have been implemented within OTRS 2.3 (POP3,POP3S,IMAP,IMAPS). Until now, there were two options for sending emails: using a local MTA (Sendmail, Postfix, etc.) or per SMTP. In OTRS 2.4.x, SMTPS (Secure SMTP) has been implemented in order to keep up to the growing security standards.
de: Beim Empfang von E-Mails unterstützt OTRS bislang POP3, POP3s, IMAP und IMAPs. Beim Versand neben lokalen Mail-Transfer-Agents (z. B. Sendmail, Postfix, Exim) und SMTP nun auch SMTPS (Secure-SMTP).

source: New features of OTRS 2.3
de: Neue Features von OTRS 2.3

source: Data base- and code-improvements increase lead to a general performance gain of up to 20%.
de: Datenbank- und Codeverbesserungen führen zu einem allgemeinen Performance-Gewinn von bis zu 20%.

source: The support of an indexed full text search has been added. The feature is disabled per default because additional disc space is needed. The expected performance gain is 50%.
de: Es wurde eine indizierte Volltextsuche hinzugefügt. Standardmässig ist dieses Feature deaktiviert, da zusätzlicher Festplattenplatz erforderlich ist. Der erwartete Performance-Gewinn liegt bei 50%.

source: Reduced reloads by using AJAX technology.
de: Reduziertes Neu-Laden von Seiten durch AJAX-Technologie.

source: Instead of an ongoing recalculating of the escalation time during run time, it is only recalculated when it changes due to an event in OTRS. It is then being stored in the ticket object which allows a direct access of external reporting tools to the data base as well as a more efficient reporting on escalations. This will also lead into a substantial performance improvement.
de: Anstatt die Eskalationszeiten während der Laufzeit ständig neu zu berechnen, werden sie nur noch dann neu berechnet, wenn sie sich durch ein Event in OTRS verändern. Die Eskalationszeiten werden im Ticket-Objekt gespeichert, dadurch können externe Reporting-Tools direkt darauf zugreifen. Ausserdem wird die Performance signifikant erhöht.

source: Search functionality
de: Such-Funktionalität
