Repository: xhoy/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: de

source: With 'Ticket lock after a follow-up', you can define if a ticket should be set to 'locked' to the old owner if a ticket that has been closed and later is re-opened. This ensures that a follow up for a ticket is processed by the agent that has previously handled that ticket.
de: Weiterhin können Sie festlegen, dass bei einem Follow-Up auf ein Ticket wieder der Mitarbeiter Eigentümer dieses Tickets wird, der zuletzt als Eigentümer im System für dieses Ticket vermerkt war. Dies stellt sicher, dass die Nachfrage eines Kunden zuerst bei demselben Mitarbeiter landet, der sich zuletzt um dieses Ticket gekümmert hat.

source: The parameter for the system address specifies the email address that will be used for the outgoing tickets of this queue. There is also possibility to associate a queue with a salutation and a signature, for the email answers. For more detailed information, please refer to the sections <link linkend="adminarea-emailaddresses">email addresses</link>, <link linkend="adminarea-salutations">salutations</link> and <link linkend="adminarea-signatures"> signatures</link>.
de: Der Parameter für die Systemadresse legt fest, mit welcher Absenderadresse Mails aus dieser Queue versendet werden sollen. Mit Hilfe der Parameter für Anrede und Signatur kann eingestellt werden, welche Vorgaben hier standardmäßig bei Antworten auf Tickets in dieser Queue genutzt werden. In den Abschnitten <link linkend="adminarea-emailaddresses">E-Mail-Adressen</link>, <link linkend="adminarea-salutations">Anreden</link> und <link linkend="adminarea-signatures">Signaturen</link> erfahren Sie mehr über die Einrichtung dieser Parameter.

source: As with agents, groups and customers, queues cannot be deleted, only deactivated, by setting the Valid option to <emphasis>invalid</emphasis> or <emphasis>invalid-temporarily</emphasis>.
de: In OTRS können Queues deaktiviert, aber nicht gelöscht werden. Sie können eine Queue deaktivieren, indem Sie den Wert für "Gültig" auf "ungültig" oder "ungültig-temporär" setzen.

source: Salutations, signatures, attachments and responses
de: Anreden, Signaturen, Anlagen und Antwortvorlagen

source: Salutations
de: Anreden

source: A salutation is a text module for a response. Salutations can be linked to one or more queues, as described in the section about <link linkend="adminarea-queue">queues</link>. A salutation is used only if a ticket from a queue the salutation is linked to, is answered. To manage the different salutations of your system, use the "Salutations" link of the admin area (see Figure 5.20 below).
de: Ein Textbaustein für eine Antwortvorlage ist die Anrede. Anreden können einer Queue zugeordnet werden, wie im Abschnitt zu den <link linkend="adminarea-queue">Queues</link> beschrieben, nur so werden Sie bei Antworten für Tickets aus dieser Queue verwendet. Über den Link "Anreden" innerhalb des Admin-Bereiches, können Sie die verschiedenen Anreden Ihres Systems verwalten.

source: Salutation management
de: Verwaltung der Anreden

source: <emphasis>Figure 5.20. Salutation management.</emphasis>
de: <emphasis>Abb. 5.20. Verwaltung der Anreden.</emphasis>

source: After a default installation there is already one salutation available, "system standard salutation (en)".
de: Nach einer Standardinstallation von OTRS sind bereits eine Anrede im System gespeichert, "system standard salutation (en)".

source: To create a new salutation, press the button "Add salutation", provide the needed data and submit it (see Figure 5.21 below).
de: Um eine neue Anrede anzulegen, verwenden Sie den Knopf "Anrede hinzufügen" und geben Sie die erforderlichen Daten an.

source: Add a salutation
de: Anrede hinzufügen

source: <emphasis>Figure 5.21. Adding a new salutation.</emphasis>
de: <emphasis>Abb. 5.21. Anrede hinzufügen.</emphasis>

source: It is possible to use variables in salutations. When you respond to a ticket, the variable names will be replaced by their values.
de: In Anreden können Variablen verwendet werden. Wenn Sie auf ein Ticket antworten, werden die Variablennamen durch die zugehörigen Werte ersetzt.

source: The different variables you can use in responses are listed in the lower part of the salutation screen. If you use, for example, the variable &lt;OTRS_LAST_NAME&gt; the last name of the ticket's sender will be included in your reply.
de: Im unteren Teil der Bildschirmmaske zum Ändern oder Anlegen einer Anrede finden Sie die verschiedenen OTRS-Variablen, die Sie für die dynamische Aufbereitung eines Anredentextes verwenden können. Bauen Sie z. B. in Ihrem Anredentext die Variable &lt;OTRS_LAST_NAME&gt; ein, so wird diese später durch den Nachnamen der Person ersetzt, deren Ticket Sie beantworten.

source: As with other OTRS entities, salutations cannot be deleted, only deactivated by setting the Valid option to <emphasis>invalid</emphasis> or <emphasis>invalid-temporarily</emphasis>.
de: In OTRS können Anreden deaktiviert, aber nicht gelöscht werden. Sie können eine Anrede deaktivieren, indem Sie den Wert für "Gültig" auf "ungültig" oder "ungültig-temporär" setzen.

source: Signatures
de: Signaturen

source: Another text module for a response is the signature. Signatures can be linked to a queue, as described in the section about the <link linkend="adminarea-queue">queues</link>. Only if a signature is linked to a queue will it be included into the response text. Through the "Signatures" link of the Admin page, you can manage the signatures in your system (see Figure 5.22 below).
de: Ein weiterer Textbaustein für eine Antwortvorlage, ist die Signatur. Signaturen können einer Queue zugeordnet werden, wie im Abschnitt zu den <link linkend="adminarea-queue">Queues</link> beschrieben, nur so werden Sie bei Antworten für Tickets aus dieser Queue verwendet. Über den Link "Signaturen" innerhalb des Admin-Bereiches, können Sie die verschiedenen Signaturen Ihres Systems verwalten.

source: Management of Signatures
de: Signaturverwaltung

source: <emphasis>Figure 5.22. Signatures management.</emphasis>
de: <emphasis>Abb. 5.22. Signaturverwaltung.</emphasis>

source: After a fresh installation of OTRS, there is one predefined signature stored in your system, "system standard signature (en)".
de: Nach einer Standardinstallation von OTRS ist bereits eine Signatur im System vorhanden, "system standard signature (en)".

source: To create a new signature, press the button "Add signature", provide the needed data and submit it (see Figure 5.23 below).
de: Verwenden Sie den Knopf "Signatur hinzufügen", um eine neue Signatur anzulegen.

source: Add a signature
de: Signatur hinzufügen

source: <emphasis>Figure 5.23. Adding a new signature.</emphasis>
de: <emphasis>Abb. 5.23. Signatur hinzufügen.</emphasis>

source: Like salutations, signatures can also contain dynamical content, such as the first and last name of the agent who answers the ticket. Here too, variables can be used to replace the content of the signature text for every ticket. See the lower part of the signatures screen for the variables which can be used. If you include the variable &lt;OTRS_LAST_NAME&gt; in a signature for example, the last name of the agent who answers the ticket will replace the variable.
de: Auch in Signaturen können dynamische Inhalte eingebaut werden, wie etwa Vor- und Nachname des Agenten. Dies geschieht, genauso wie bei den Anreden, mit Hilfe verschiedener OTRS-Variablen, die in den Text der Signatur integriert werden können. Ein variabler Textteil könnte z. B. der Name des Mitarbeiters sein, der das Ticket beantwortet hat (&lt;OTRS_LAST_NAME&gt;).

source: As with salutations, signatures too cannot be deleted, only deactivated by setting the Valid option to <emphasis>invalid</emphasis> or <emphasis>invalid-temporarily</emphasis>.
de: In OTRS können Signaturen deaktiviert, aber nicht gelöscht werden. Sie können eine Signatur deaktivieren, indem Sie den Wert für "Gültig" auf "ungültig" oder "ungültig-temporär" setzen.

source: Attachments
de: Anlagen

source: You can also optionally add one or more attachments for a response. If the response is selected, the attachments will be attached to the message composition window. If necessary, the agent can remove the attachment from an individual response before sending it to the customer.
de: Ein weitere optionaler Teil einer Antwortvorlage kann eine Anlage sein. Diese wird bei der Benutzung einer Antwortvorlage als Anhang an das zu beantwortende Ticket angehängt, kann aber über eine Checkbox im Antworten-Bildschirm für Tickets leicht deaktiviert werden.

source: Through the "Attachment" link of the Admin page, you can load the attachments into the database of the system (see Figure 5.24 below).
de: Über den "Anlagen"-Link im Admin-Bereich können Sie neue Anlagen in das System integrieren.

source: Managing Attachments for Responses
de: Verwaltung der Anlagen von Antworten

source: <emphasis>Figure 5.24. Attachments management.</emphasis>
de: <emphasis>Abb. 5.24. Verwaltung der Anlagen.</emphasis>

source: To create a new attachment, press the button "Add attachment", provide the needed data and submit it (see Figure 5.25 below).
de: Verwenden Sie den "Anlage hinzufügen"-Knopf, um eine neue Anlage zu erstellen.

source: Add an Attachment
de: Anlage hinzufügen

source: <emphasis>Figure 5.25. Adding a new attachment.</emphasis>
de: <emphasis>Abb. 5.25. Anlage hinzufügen.</emphasis>

source: If an attachment is stored it can be linked to one or more responses. Click on the "Attachment &lt;-&gt; Responses" link of the Admin page (see Figure 5.26 below).
de: Wenn eine Anlage erstellt wurde, kann sie einer order mehreren Antworten zugeordnet werden. Folgen Sie dazu dem Link "Anlagen &lt;-&gt; Antworten" im Administrationsbereich.

source: Linking Attachments to Responses
de: Zuordnung von Anlagen zu Antworten

source: <emphasis>Figure 5.26. Linking Attachments to Responses.</emphasis>
de: <emphasis>Abb. 5.26. Zuordnung von Anlagen zu Antworten.</emphasis>

source: To associate different attachments with a specific response and vice versa, click on the corresponding response name or attachment (see below the Figures 5.27 and 5.28, respectively).
de: Klicken Sie auf den Namen einer Anlage oder einer Antwortvorlage, um die jeweiligen Zuordnungen zu verändern.

source: Change Attachment relations for a Response
de: Anlagenzuordnungen einer Antwortvorlage verändern

source: <emphasis>Figure 5.27. Change Attachment relations for a Response.</emphasis>
de: <emphasis>Abb. 5.27. Anlagenzuordnungen einer Antwortvorlage verändern.</emphasis>

source: Change Response relations for an Attachment
de: Antwortvorlagen-Zuordnungen einer Anlage verändern

source: <emphasis>Figure 5.28. Change Response relations for an Attachment.</emphasis>
de: <emphasis>Abb. 5.28. Antwortvorlagen-Zuordnungen einer Anlage verändern.</emphasis>

source: Responses
de: Antwortvorlagen

source: To speed up the answering of tickets and to standardize the look of answers, you can define responses in OTRS. A response can be linked to one or more queues and vice versa. In order to be able to use a response quickly, the different responses are displayed below every ticket in the QueueView or in "My Queues".
de: Um das Antworten auf Tickets zu beschleunigen und das Aussehen beantworteter Tickets zu vereinheitlichen, können in OTRS Antwortvorlagen erstellt werden. Jede Antwortvorlage kann einer oder mehreren Queues bzw. Unter-Queues zugeordnet werden, es können mehrere Antwortvorlagen für jede Queue definiert werden.

source: On a fresh OTRS installation, the "empty answer" response is defined for every queue. Clicking the "Responses" link on the Admin page brings you to the Responses management page (see Figure 5.29 below).
de: Nach einer Standardinstallation ist für jede Queue die Antwortvorlage "empty answer" vorhanden. Im Admin-Bereich kann über den Link "Antworten" auf die im System gespeicherten Antwortvorlagen zugegriffen und diese bearbeitet werden.

source: <emphasis>Figure 5.29. Responses management.</emphasis>
de: <emphasis>Abb. 5.29. Verwaltung der Antwortvorlagen.</emphasis>

source: To create a new response, click on the "Add response" button, provide the required data and submit it (see Figure 5.30 below).
de: Verwenden Sie den "Antwort hinzufügen"-Knopf zur Erstellung einer neuen Antwortvorlage.

source: <emphasis>Figure 5.30. Adding a response.</emphasis>
de: <emphasis>Abb. 5.30. Antwortvorlage hinzufügen.</emphasis>

source: To add/remove responses to one or more queues, click on the "Responses &lt;-&gt; Queues" link on the Admin page (see Figure 5.31 below). You can also use filters to get information on a specific entity.
de: Um eine Antwortvorlage einer oder mehreren Queues zuzuweisen, aktivieren Sie im Admin-Bereich den Link "Antworten &lt;-&gt; Queues". Sie können die Filter verwenden, um bestimmte Elemente zu finden.

source: Manage Response-Queue relations
de: Queue-Antwort-Zuordnungen verwalten

source: <emphasis>Figure 5.31. Response-Queue relations management.</emphasis>
de: <emphasis>Abb. 5.31. Queue-Antwort-Zuordnungen verwalten.</emphasis>

source: To define the different responses that will be available for a queue and vice versa, click on the corresponding response or queue (see below the Figures 5.32 and 5.33, respectively).
de: Klicken Sie auf den Namen einer Queue oder Antwortvorlage, um die jeweiligen Zuordnungen zu bearbeiten.

source: Change Queue relations for a Response
de: Queue-Zuordnungen einer Antwortvorlage ändern

source: <emphasis>Figure 5.32. Change Queue relations for a Response.</emphasis>
de: <emphasis>Abb. 5.32. Queue-Zuordnungen einer Antwortvorlage ändern.</emphasis>

source: Change Response relations for a Queue
de: Antwort-Zuordnungen einer Queue ändern

source: <emphasis>Figure 5.33. Change Response relations for a Queue.</emphasis>
de: <emphasis>Abb. 5.33. Antwort-Zuordnungen einer Queue ändern.</emphasis>

source: The structure of a response is intuitive. It includes the salutation associated with the queue, then the text of the response, then the quoted ticket text, and finally the signature associated with the queue.
de: Die Struktur einer Antwort ist intuitiv. Sie enthält eine mit der Queue verknüpfte Anrede, den Text der Antwort, den zitierten Ticket-Text und schließlich die Signatur der Queue.

source: Auto responses
de: Automatische Antworten

source: OTRS allows you to send automatic responses to customers on the occurence of certain events, such as the creation of a ticket in certain queue, reception of a follow-up message on a ticket, closure or rejection of a ticket, etc. To manage such responses, click the link "Auto responses" on the Admin page (see Figure 5.34 below).
de: OTRS bietet die Möglichkeit, automatische Antworten an Kundenbenutzer zu verschicken. Automatische Antworten sind an bestimmte Ereignisse im System gebunden, z. B. an das Anlegen eines neuen Tickets in einer Queue, wenn ein Followup eines Tickets stattfindet, wenn ein Ticket geschlossen oder vom System zurückgewiesen wird. Über den Link "Auto Antworten" innerhalb des Admin-Bereiches erreichen Sie die Verwaltung der automatischen Antworten.

source: Auto Response management
de: Verwaltung automatischer Antworten

source: <emphasis>Figure 5.34. Auto Response management.</emphasis>
de: <emphasis>Abb. 5.34. Verwaltung automatischer Antworten.</emphasis>

source: To create an automatic response, click on the button "Add auto response", provide the needed data and submit it (see Figure 5.35 below).
de: Verwenden Sie den Knopf "Automatische Antwort hinzufügen", um eine neue anzulegen.

source: Adding an Auto Response
de: Automatische Antwort hinzufügen

source: <emphasis>Figure 5.35. Adding an Auto Response.</emphasis>
de: <emphasis>Abb. 5.35. Automatische Antwort hinzufügen.</emphasis>

source: The subject and text of auto responses can be generated by variables, just as in signatures and salutations. If you insert, for example, the variable &lt;OTRS_CUSTOMER_EMAIL[5]&gt; into the body of the auto answer, the first 5 lines of the customer mail text will be inserted into the auto answer. You will find more details about the valid variables that can be used at the bottom of the screen shown in the Figure 5.35.
de: Für die Betreffzeile und den Text von automatischen Antworten kann genauso wie bei Signaturen oder Anreden, der Inhalt mit Hilfe von OTRS-Variablen dynamisch erzeugt werden. So werden über die Variable &lt;OTRS_CUSTOMER_EMAIL[5]&gt; die ersten 5 Zeilen der an das System gesendeten E-Mail in die automatische Antwort eingefügt, oder durch &lt;OTRS_CUSTOMER_FROM&gt; die From-Zeile. Die Anmerkungen im unterem Bereich der Bildschirmmaske zur Verwaltung der automatischen Antworten listen alle OTRS-Variablen auf, die verwendet werden können.

source: For every automatic answer, you can specify the event that should trigger it. The system events that are available after a default installation are described in the Table 5-3.
de: Für jede automatische Antwort können Sie angeben, durch welches Ereignis sie ausgelöst werden soll. Folgende Ereignisse sind in einer Standardinstallation verfügbar:

source: Events for Auto answers
de: Ereignisse für automatische Antworten

source: Creation of a ticket in a certain queue.
de: Dieses Ereignis tritt ein, wenn ein neues Ticket in einer Queue angelegt wird.

source: Reopening of an already closed ticket, e.g. if a customer replies to such ticket.
de: Dieses Ereignis tritt ein, wenn ein bereits geschlossenes Ticket, z. B. durch die Antwort eines Kunden, mit einer neuen Ticketnummer erneut geöffnet wird.

source: Reception of a follow-up for a ticket.
de: Dieses Ereignis tritt ein, wenn ein Follow up für ein bereits vorhandenes Ticket eintrifft.

source: Automatic rejection of a ticket, done by the system.
de: Dieses Ereignis tritt ein, wenn ein Ticket vom System zurückgewiesen wird.

source: Deletion of a ticket, done by the system.
de: Dieses Ereignis tritt ein, wenn ein Ticket vom System entfernt wird.

source: As with other OTRS entities, Auto responses too cannot be deleted, only deactivated, by setting the Valid option to <emphasis>invalid</emphasis> or <emphasis>invalid-temporarily</emphasis>.
de: In OTRS können automatische Antworten deaktiviert, aber nicht gelöscht werden. Zum Deaktivieren einer automatischen Antwort können Sie den Wert für "Gültig" auf "ungültig" oder "ungültig-temporär" setzen.

source: To add an auto response to a queue, use the "Auto Response &lt;-&gt; Queues" link on the Admin page (see Figure 5.36 below). All system events are listed for every queue, and an auto answer with the same event can be selected or removed via a listbox.
de: Um eine automatische Antwort einer oder mehreren Queues zuzuweisen, folgen Sie im Admin-Bereich den Link "Auto Antworten &lt;-&gt; Queues". Dort sind für jede Queue die verschiedenen Ereignistypen aufgelistet und es kann eine Zuordnung einer Auto-Antwort vom gleichen Ereignistyp durchgeführt bzw. entfernt werden.

source: Manage Queue - Auto Response relations
de: Zuordnungen von Queues zu automatischen Antworten verwalten

source: <emphasis>Figure 5.36. Queue-Auto Response relations management.</emphasis>
de: <emphasis>Abb. 5.36. Zuordnungen von Queues zu automatischen Antworten verwalten.</emphasis>

source: To define the different auto responses that will be available for a queue, click on the corresponding queue name (see Figure 5.37 below). It is also possible to edit an existing auto response - to do so, click on the reponse and edit in the same manner as editing a new auto response.
de: Um die Zuordnungen von automatischen Antworten zu Queues zu verändern, klicken sie auf den Namen der Queue. Durch einen Klick auf den Namen einer automatischen Antwort können Sie diese direkt bearbeiten.

source: Change Auto Response relations for a Queue
de: Zuordnung von automatischen Antworten zu einer Queue bearbeiten

source: <emphasis>Figure 5.37. Change Auto Response relations for a Queue.</emphasis>
de: <emphasis>Abb. 5.37. Zuordnung von automatischen Antworten zu einer Queue bearbeiten.</emphasis>

source: Email addresses
de: E-Mail-Adressen

source: To enable OTRS to send emails, you need a valid email address to be used by the system. OTRS is capable of working with multiple email addresses, since many support installations need to use more than one. A queue can be linked to many email addresses, and vice versa. The address used for outgoing messages from a queue can be set when the queue is created. Use the "Email Addresses" link from the Admin page to manage all email addresses of the system (see Figure 5.38 below).
de: Um aus OTRS heraus E-Mails verschicken zu können, benötigen Sie mindestens eine gültige Mailadresse. Da in vielen Fällen eine Mailadresse nicht ausreicht, ist OTRS auch in der Lage, mit mehreren Mailadressen zu arbeiten. Eine Queue mit mehreren E-Mail-Adressen verknüpft werden, und umgekehrt. Die Adresse, die für ausgehende Nachrichten einer Queue benutzt werden soll, kann bei Erstellung oder Bearbeitung der Queue ausgewählt werden. Verwenden Sie den Link "E-Mail-Adressen" im Administrationsbereich, um die Adressen des Systems zu verwalten.

source: Managing Email Addresses
de: E-Mail-Adressen verwalten

source: <emphasis>Figure 5.38. System Email Addresses management.</emphasis>
de: <emphasis>Abb. 5.38. Verwaltung der E-Mail-Adressen des Systems.</emphasis>

source: If you create a new mail address (see Figure 5.39 below) you can select the queue or sub queue to be linked with it. This link enables the system to sort incoming messages via the address in the To: field of the mail into the right queue.
de: Im Formular zur Verwaltung der E-Mail-Adressen können Sie u.a. direkt auswählen, mit welcher Queue oder Unter-Queue die neue Mailadresse verknüpft werden soll. Diese Verknüpfung ist wichtig, da so eingehende Mails anhand der Adresse im To: Feld der entsprechenden Queue zugewiesen werden können.

source: Adding a system Email Address
de: Hinzufügen einer System-E-Mail-Adresse

source: <emphasis>Figure 5.39. Adding a system Email Address.</emphasis>
de: <emphasis>Abb. 5.39. Hinzufügen einer System-E-Mail-Adresse.</emphasis>

source: As with other OTRS entities, email addresses cannot be deleted, only deactivated by setting the Valid option to <emphasis>invalid</emphasis> or <emphasis>invalid-temporarily</emphasis>.
de: In OTRS können E-Mail-Adressen deaktiviert, aber nicht gelöscht werden. Sie können eine Adresse deaktivieren, indem Sie den Wert für "Gültig" auf "ungültig" oder "ungültig-temporär" setzen.

source: Notifications
de: Benachrichtigungen

source: OTRS allows notifications to be sent to agents and customers, on the occurence of certain events. Agents can set the system events for their own notifications via the <link linkend="user-preferences">preferences</link> link.
de: Kunden und Mitarbeiter können im <link linkend="user-preferences">Einstellungs-Bereich</link> ihres Accounts festlegen, bei welchen Ereignissen Sie automatisch vom System per Mail benachrichtigt werden wollen.

source: Through the "Agent Notifications" link on the Admin page, you can manage the notifications of your system (see Figure 5.40 below). You can use filters to list only certain notifications.
de: Über den "Benachrichtigungen"-Link im Admin-Bereich erreichen Sie die Verwaltung der Benachrichtigungen. Mit den Filtern können Sie bestimmte Einträge finden.

source: Managing Notifications
de: Verwaltung der Benachrichtigungen

source: <emphasis>Figure 5.40. Notification management.</emphasis>
de: <emphasis>Abb. 5.40. Verwaltung der Benachrichtigungen.</emphasis>
