Repository: xhoy/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: de

source: Support of logical expressions: ticket-, customer- and FAQ- search supports logical expressions, utilizing the AND, OR and ! operators as well as structuring expressions with parentheses.
de: Unterstützung von logischen Ausdrücken: Die Ticket-, Kunden-, und die FAQ-Suche unterstützen logische Ausdrücke, wie die Operatoren UND, ODER, !, als auch Klammern, um Ausdrücke zu strukturieren.

source: Search for ticket numbers by using the Browser OpenSearch feature (OpenSearch format).
de: Die Suche nach Ticket-Nummern direkt aus dem Browser heraus, mithilfe des OpenSearch features (OpenSearch Format).

source: Search for ticket titles in the agent ticket search form and in the generic agent.
de: Die Suche nach dem Ticket-Titel im Agenten-Interface und im GenericAgent.

source: Search for ticket close time in the agent ticket search form and in the generic agent.
de: Die Suche nach Schließ-Zeiten von Tickets im Agenten-Interface und im GenericAgent.

source: Ticket zoom and ticket move
de: Ticket-Inhalt und Verschieben von Tickets

source: Expand/Collapse of articles: the article view can be expanded to display all articles at once. The current article will remain in focus, and the preceding, or following articles will be displayed.
de: Aus-/zuklappen von Artikeln: Die Artikel-Ansicht kann ausgeklappt werden, um alle Artikel auf einmal zu sehen. Der aktuelle Artikel bleibt im Fokus, und der vorherige und nachfolgende Artikel werden zusätzlich angezeigt.

source: Structured article tree - The article tree has been changed to a table.
de: Strukturierter Artikel-Baum: Die Artikel-Baum-Ansicht wird jetzt als Tabelle dargestellt.

source: Printing of articles has been realized.
de: Das Ausdrucken von Artikeln ist jetzt möglich.

source: The ticket title of linked tickets are displayed in case of a mouse over action.
de: Der Ticket-Titel von verknüpften Tickets wird als Mouse-Over Effekt angezeigt.

source: Merged tickets are displayed crossed out.
de: Verknüpfte Tickets werden nun durchgestrichen dargestellt.

source: Multiple files can be attached while moving a ticket using the ticket move mask.
de: Beim Verschieben von Tickets können mehrere Dateien als Anhänge hinzugefügt werden.

source: Ticket FreeText and FreeTime opportunities
de: Ticket FreeText und FreeTime Features

source: When splitting a ticket, all FreeText and Free Time data will be copied to the new ticket.
de: Beim Teilen eines Tickets werden nun alle FreeText und FreeTime Felder in das neue Ticket kopiert.

source: Ticket Free Time fields can be declared as mandatory.
de: Ticket-FreeTime Felder können als Pflichtfeld definiert werden.

source: A URL can be configured that takes the value of a FreeText field and displays it as an URL link in the ticket.
de: Eine URL kann als Wert für FreeText-Felder konfiguriert werden, die dann als Link in einem Ticket dargestellt wird.

source: Added X-OTRS-TicketTime and X-OTRS-FollowUp-TicketTime email headers.
de: Die Email-Header X-OTRS-TicketTime und X-OTRS-FollowUp-TicketTime wurden hinzugefügt.

source: IMAP, IMAPS and POP3S support
de: Unterstützung von IMAP, IMAPS und POP3S

source: With OTRS 2.3 additionally to POP3, POP3S, IMAP and IMAPS is supported to fetch mails from your MTA.
de: Mit OTRS 2.3 werden zusätzlich zu POP3 die Email-Protokolle POP3S, IMAP und IMAPS unterstützt.

source: Security
de: Sicherheit

source: In case of a lost password, OTRS is sending an e-mail to the user with a "password reset link". After clicking this link the new password is sent to the user in a second e-mail.
de: Im Falle eines vergessenen Passworts sendet OTRS mit Hilfe des "Password Reset Links" eine E-mail an den Benutzer. Nach dem der Benutzer auf den Bestätigungs-Link in der Mail klickt, wird das Passwort in einer zweiten E-mail verschickt.

source: Notifications and escalations
de: Benachrichtigungen und Eskalationen

source: All agents that have a read permission on a certain queue can be selected for notification.
de: Alle Agenten mit Leseberechtigung für eine bestimmte Queue können für Benachrichtigungen ausgewählt werden.

source: An escalation view has been added that displays all tickets sorted by their remaining time to escalation.
de: Eine neue Eskalationsübersicht wurde hinzugefügt. Sie zeigt alle Tickets, sortiert nach der verbleibenden Zeit bis zur Eskalation.

source: New features of OTRS 2.2
de: Neue Features von OTRS 2.2

source: Support of Services and SLAs: As major step towards IT Service Management OTRS 2.2 brings in the new attributes 'Service' and 'Service Level Agreements (SLA)'. While creating a new ticket a service requester has to select both a service (e. g. email-service) and a related SLA . SLA attributes are "response time", "update time" and "solution time". These attributes are used by the IT Service Organization for notification and escalation purposes in order to keep the agreed SLA. Service- and SLA-related informations within incoming email headers might also be used by the Postmaster-Filter as already known before.
de: Services und SLAs: Auf dem Weg hin zu einem IT-Servicemanagement-Werkzeug, wurden in OTRS 2.2 die neuen Attribute 'Service' und 'Service Level Agreements (SLA)' integriert. Bei der Erstellung eines neuen Tickets kann der Anfragesteller einen Service (z. B. Email-Service) und ein zugehöriges SLA auswählen. SLA Atribute sind "response time" (Antwortzeit), "update time" (Updatezeit) und "solution time" (Lösungszeit). Diese Attribute können vom IT-Service für Benachrichtigungen oder für die Eskalation von Tickets herangezogen werden, um bestehende SLAs einzuhalten. Service- und SLA-spezifische Informationen innerhalb der Header neuer Emails können weiterhin mit Hilfe des PostMasterFilter-Moduls ausgewertet werden.

source: Support of native ticket types: Ticket types can now be managed over the admin interface. You do not longer need to use ticket free text field for this purpose. Installations which already use a ticket free text field for ticket type classification do not need to migrate. This feature will also be shown in zoom and print view for agents and customers and can be changed via the agent interface.
de: Unterstützung nativer Tickettypen: Verschiedene Tickettypen können nun über das Admin-Interface verwaltet werden. Die Benutzung von Freitext-Feldern für die Spezifikation von Tickettypen ist somit nicht mehr notwendig. Installationen, die Freitextfelder für die Klassifikation von Tickettypen verwenden, müssen nicht migriert werden. Dieses neue Feature wird ebenfalls im ticketinhalt und auch in der Druckansicht für Agenten und Kunden angezeigt und kann über das Agenten-Interface angepasst werden.

source: Support of multiple authentication backends: Added support of multi authentication feature for agent and customer backend. By using this feature it is now possible to use multiple trusted authentication sources (i.e. use LDAP as a first source for authentication and in case of an unsuccessful authentication try a SQL DB as a second source).
de: Unterstützung multipler Authentifikation-Quellen: Durch die Unterstützung multipler vertrauenswürdiger Authentifikations-Quellen wird es möglich, mehrere Backends für die Anmeldung von Kunden und Agenten einzubinden. Schlägt die Authentifikation für die erste Quelle fehl (z. B. für ein LDAP-Backend), kann als 2. Quelle ein weiteres Backend (z. B. eine SQL-Datenbank) eingebunden werden.

source: Support of different password crypt types: Supported and permitted password authentication types for agent and/or customer login are:
de: Support von Kennworten mit verschiedener Verschlüsselung: Die verschiedenen unterstützten und erlaubten Verschlüsselungen für Agenten- und Kundenkennworte sind:

source: Default is 'unix_crypt()'. The administrator can easily switch from unix_crypt() to md5() on the fly by changing the related configuration parameter.
de: Die Standardeinstellung ist 'unix_crypt()'. Für ein laufendes System ist ein Wechsel ohne großen Aufwand von unix_crypt() zu md5() möglich, es muss lediglich der entsprechende Konfigurationsparameter angepasst werden.

source: Changed OTRS internal CustomerUser structure: Customer datas (CustomerUser) are restructured and split into the objects "CustomerCompany" and "CustomerUser" within the internal OTRS database. Company related attributes like company name and address will be managed separately from those attributes related to a single contact (e.g. first name, surname, phone etc.).
de: Änderung der OTRS-internen Struktur zur Speicherung der Kundendaten: Die Speicherung der Kundendaten wurde restrukturiert und in die Objekte "CustomerCompany" und "CustomerUser" aufgeteilt. Firmenspezifische Daten (Company) wie z. B. der Firmenname, die Firmenadresse, usw. werden nun gegenüber den personenspezifischen Daten (Vor- und Nachname, Anrede, etc.) gesondert gepflegt.

source: This information will be shown in zoom and print like the current customer info.
de: Diese Informationen werden wie gewohnt innerhalb des Agent-Interfaces angezeigt.

source: Enhanced OPM-Format: OPM Packages are now delivered with an additional on-line help. The introduction page will inform the user about new features and will also give a short overview about the next steps to do after having installed the packages.
de: Erweitertes OPM-Format: OPM Pakete werden nun mit einer zusätzlichen Beschreibung ausgeliefert. Die einleitende Seite für ein OPM Paket informiert den Benutzer über neue Features und über die Schritte, die nach der Installation des Paketes nötig sind.

source: PostMaster-Admin-Interface: The improvement has lead to a more detailed definition of those email addresses which have to be matched by PostMaster filter.
de: PostMaster-Admin-Interface: Durch diese Erweiterung kann genauer definiert werden, welche Email-Adressen vom PostMasterFilter-Modul behandelt und in Betracht gezogen werden sollen.

source: SysConfig Improvement: A quicker page view and page saving leads to essential time savings during configuration process.
de: Verbesserung des SysConfig-Interfaces: Durch interne Umstrukturierungen des SysConfig-Interfaces wurde die Performance stark erhöht. Die Seiten werden nun viel flüssiger aufgebaut wodurch ein viel schnelleres Arbeiten mit dem Tool möglich wird.

source: New features of OTRS 2.1
de: Neue Features von OTRS 2.1

source: Stable Support of Microsoft SQL Server: starting this version OTRS offers an interface to MS SQL Server databases. OTRS supports all popular operating systems like Linux, Windows, UNIX, Mac OS X etc. as well as all major databases like MS SQL, MySQL, PostgreSQL, Oracle and DB2.
de: Stabile Unterstützung von Microsoft SQL Server: von dieser Version an bietet OTRS eine Integration zu MS SQL Server Datenbanken. OTRS unterstützt alle populären Betriebssysteme wie Linux, Windows, Mac OS X wie auch alle wichtigen Datenbanksysteme wie MS SQL, MySQL, PostreSQL, Oracle und DB2.

source: Multi-Calendar Function: This Feature simplifies working in distributed surroundings. National teams are supported by permitting different local working schedules and public holiday regulations. International organizations are additionally supported by a time-zone feature.
de: Multi-Kalender-Funktionalität: Dieses Feature vereinfacht das Arbeiten in verschiedenen Umgebungen mit verschiedenen Zeitzonen. Die relevanten Arbeitsstunden des Systems können abhängig von der Zeitzone festgelegt werden, die Spezifikation von Urlaubs- und Feiertagen ist abhängig von der Region möglich.

source: New Statistics-Framework: Gain access and define your Reports- and Statistics in a more flexible way than ever. A powerful and easy to use Wizard will guide you through the process. Once defined OTRS may deliver periodically needed Reports automatically to a predefined Mailing List. Export- and Import functions allow to transfer Statistics between different OTRS Installations. So you can define and test your Statistics before loading them up to your production System.
de: Statistik-Framework: Integration eines komplett überarbeiteten Statistik-Frameworks der es erlaubt, nahezu jede Art von Report über die Weboberfläche zu erstellen. Die Erstellung und Ansicht von Statistiken kann pro Benutzer, Gruppe und / oder Rolle freigeschaltet werden. Der Ex- und Import von bereits vorhandenen oder neuen Statistiken ist möglich, Statistikmodule aus früheren OTRS-Versionen können weiter verwendet werden.

source: Optimized Synchronization of authorizations from LDAP-Directory Services: That simplifies the connection of all known LDAP-Directory Services like Microsoft Active Directory, OpenLDAP, Novell eDirectory, Oracle Internet Directory, etc. A useful Feature which saves time and effort of maintaining authorizations in the local Database of OTRS.
de: Optimierte Synchronisation von Autorisierungen von LDAP-Diensten. Damit wird die Anbindung aller bekannten LDAP-Verzeichnisdienste wie MS Active Directory, OpenLDAP, Novell eDirectory, Oracle Internet Directory usw. erleichtert. Ein nützliches Feature, welches beim Verwalten der Autorisierungen in der lokalen Datenbank von OTRS Zeit und Mühe spart.

source: PDF-Generator: OTRS now supports the Output of Reports and Statistics as well as the results of a ticket search and ticket zoom in the PDF-Format.
de: PDF-Generator: Die Druck-Ansicht von Tickets, Statistiken und Suchergebnisse können nun als PDF-Datei exportiert werden.

source: New implemented Knowledge Database / FAQ-Module: OTRS makes allowance for the need of an efficient Knowledge Management within daily Service Request handling. Fundamental in this context is a quick access towards existing problem-solving Know-How and standardized answers. Advantages: optimized search-functions, more effective administration of FAQ-Articles, faster Navigation and opportunities to rate an existing FAQ-Article.
de: FAQ-Modul: Das FAQ-Modul von OTRS wurde komplett neu implementiert und aus dem zentralen OTRS-Framework herausgenommen, so dass eine Installation als seperates Modul möglich ist. Das neue FAQ-Modul bietet erweiterte Such- und Navigationsfunktionen, eine verbesserte Administration und eine Möglichkeit zur Bewertung von einzelnen FAQ-Einträgen.

source: Tracking of Sub-orders and Support of hierarchical Team-Structures: New Features like the Ticket Supervisor and the Ticket Watchers support working within hierarchical Teams and enable you to define and depute Work packages temporarily to another Service Agent. While the Ticket Supervisor enables authorized Team members to depute a Ticket to another Service Agent without loosing the right to edit this ticket the Ticket Watcher allows you to track a ticket passive on the basis of an individual watch list.
de: Unterstützung hirarchischer Team-Strukturen: Mit hilfe der neu eingeführten Überwachungs- und Verantwortlichkeitsfunktionen für Tickets, wird die strukturierte Bearbeitung von Tickets in Teams vereinfacht. Das Verantwortlichkeits-Feature ermöglicht es einem Agenten den Ticket-Besitz abzugeben, jedoch trotzdem noch alle Schreibrechte am Ticket zu behalten. Das Überwachungs-Features ermöglicht die Verfolgung der Aktivitäten für ein Ticket, ohne selbst Eigentümer des Tickets zu sein.

source: Optimized Follow-Up-Detection: In addition to the subject heading, OTRS also checks for referable ticket numbers inside the Email-body and further attachments. This new feature aims to automatically assign an incoming Service Request to an existing Incident much faster than before.
de: Optimierte Erkennung von Follow-Ups: Neben der Auswertung der Ticketnummer im Betreff einer Nachricht kann OTRS 2.1 nun auch nach Ticket-Bezeichnern im Body einer Mail und innerhalb von Textanhängen suchen und so ggfs. ein Follow-Up automatisiert zuordnen.

source: Hardware and software requirements
de: Hardware und Software-Anforderungen

source: OTRS can be installed on many operating systems. OTRS runs not only on linux and on other unix derivates (e.g. OpenBSD or FreeBSD) but on all Microsoft Windows platforms too. OTRS has no excessive hardware requirements. We recommend using a machine with at least a 2 GHz Xeon or comparable CPU, 2 GB RAM and a 160 GB hard drive.
de: OTRS kann unter vielen Betriebssystemen installiert werden. Neben Linux und den verschiedenen Unix-Derivaten (z. B. OpenBSD oder FreeBSD), läuft OTRS auch unter allen Windows-Versionen. Bezüglich der Hardware empfiehlt es sich, mindestens einen 2 GHz Pentium Xeon oder vergleichbare CPU, 2 GB RAM und eine 160 GB Festplatte zu verwenden.

source: If you want to use OTRS, you need some other software components. The basic software requirements are: a web and a database servers, as well as a working Perl environment with some additional modules. The web server and <application>Perl</application> have to be installed on the same machine as OTRS. The database back-end can be installed locally or on another host.
de: Für den Betrieb von OTRS werden einige externe Software-Komponenten benötigt. Ein Web- sowie ein Datenbankserver und eine funktionierende Perl-Installation mit einigen Zusatzmodulen sind die Grundvorraussetzungen für ein funktionierendes System. Der Webserver und <application>Perl</application> müssen auf der gleichen Maschine installiert sein, auf der später auch OTRS ausgeführt werden soll. Das Datenbank-Back-End kann auf der lokalen oder auf einer entfernten Maschine installiert werden.

source: For the web server, we recommend using <application>apache 2</application>, because its module mod_perl improves greatly the performance of OTRS. If you can't use apache, OTRS should run on any web server that can execute Perl scripts.
de: Für den Webserver wird empfohlen, auf <application>apache 2</application> zurück zu greifen. Vor allem durch die Erweiterung der apache-Konfiguration um das mod-perl-Modul, kann die Geschwindigkeit von OTRS enorm gesteigert werden. Prinzipiell sollte aber jeder Webserver, der die Ausführung von Perl-Skripten unterstützt, für den Betrieb von OTRS geeignet sein.

source: For database back-ends, you can use <application>MySQL</application>, <application>PostgreSQL</application>, <application>Oracle</application>, <application>MSSQL</application> or <application>DB2</application>. If you use <application>MySQL</application> you have the advantage that the database and some system settings can be configured during the installation, through a web front-end.
de: Als Datenbank-Back-End eignen sich <application>MySQL</application>, <application>PostgreSQL</application>, <application>Oracle</application>, <application>MSSQL</application> oder <application>DB2</application>. Ein Vorteil der Benutzung von <application>MySQL</application> ist, dass OTRS über einen Webinstaller die Datenbank und Tabellen automatisch anlegen kann.

source: For <application>Perl</application>, we recommend using at least version 5.8.8. You need some additional modules which can be installed either with the Perl shell and CPAN or via the package manager of your operating system (<application>rpm</application>, <application>yast</application>, <application>apt-get</application>).
de: Für <application>Perl</application> gilt mindestens die Version 5.8.8 zu verwenden. Es werden einige Zusatzmodule benötigt, die Sie entweder direkt über die Shell von <application>Perl</application> und CPAN oder mit Hilfe des Paketmanagers (<application>yast</application>, <application>apt-get</application>) Ihres Betriebssystems einspielen müssen.

source: Software requirements
de: Software-Anforderungen

source: Perl 5.8.8 or higher
de: Perl 5.8.8 oder höher

source: Apache2 + mod_perl2 or higher (recommended, mod_perl is really fast!)
de: Apache2 und mod_perl2 (mod_perl2 wird wegen der hohen Geschwindigkeit empfohlen)

source: Webserver with CGI support (CGI is not recommended)
de: Webserver mit CGI support (CGI nicht empfohlen)

source: IIS 6 or higher
de: IIS6 oder höher

source: Databases
de: Datenbanken

source: MySQL 4.1 or higher
de: MySQL 4.1 oder höher

source: PostgreSQL 8.0 or higher
de: PostgreSQL 8.0 oder höher

source: Oracle 10g or higher
de: Oracle 10g oder höher

source: DB2 8 or higher
de: DB2 8 oder höher

source: MSSQL 2000 or higher
de: MSSQL 2000 oder höher

source: The section in the manual about <link linkend="installation-of-perl-modules"> installation of Perl modules </link> describes in more detail how you can set up those which are needed for OTRS.
de: Im Abschnitt für die <link linkend="installation-of-perl-modules">Installation</link> der für OTRS benötigten Perl-Module wird beschrieben, wie Sie Perl-Module manuell einspielen können.

source: If you install a binary package of OTRS, which was built for your operating system (rpm, Windows-Installer), either the package contains all Perl modules needed or the package manager of your system should take care of the dependencies of the Perl modules needed.
de: Wenn Sie ein bereits vorgefertigtes OTRS-Paket für Ihr Betriebssystem zur Installation verwenden (rpm, Windows-Installer), sollten die benötigten Perl-Module automatisch installiert werden.

source: OTRS has a large user community. Users and developers discuss about OTRS and interchange information on related issues through the <link linkend="additional-resources-mailinglists"> mailing-lists </link> . There is available help for questions regarding the installation, configuration, usage, localization and development. Software bugs can be reported on the <link linkend="additional-resources-bugtracking"> bug tracking system </link> , so that they reach the responsible developers directly and without getting lost.
de: Um OTRS hat sich in den letzten Jahren eine große Community gebildet. Über <link linkend="additional-resources-mailinglists">Mailinglisten</link> tauschen sich Anwender und Entwickler zu den verschiedensten Themen rund um das Trouble Ticket System aus. Behandelt werden Fragen rund um die Installation, Konfiguration, Benutzung, Lokalisation und Entwicklung. Fehler in der Software können über ein <link linkend="additional-resources-bugtracking">Bug-Tracking-System</link> gemeldet werden und erreichen so die zuständigen Entwickler bzw. gehen nicht verloren, so dass schnell Fixes bereit gestellt werden können.

source: The homepage of the OTRS community is: <ulink url="http://www.otrs.org"> <citetitle>http://www.otrs.org</citetitle> </ulink> (see Figure 2.1 below).
de: Die Homepage der OTRS-Community ist: <ulink url="http://www.otrs.org"> <citetitle>http://www.otrs.org</citetitle> </ulink> (siehe Abb. 2.1 unten).

source: <emphasis>Figure 2.1. OTRS community homepage.</emphasis>
de: <emphasis>Abb. 2.1. Homepage der OTRS-Community.</emphasis>

source: Commercial Support and Services for OTRS
de: Kommerzieller Support und Dienstleistungen für OTRS

source: Commercial support for OTRS is also available. You can find the available options on the website of OTRS Group, the company behind OTRS: <ulink url="http://www.otrs.com/en/solutions/"> <citetitle>http://www.otrs.com/en/solutions/</citetitle> </ulink> .
de: Kommerzieller Support für OTRS ist erhältlich. Die können die aktuellen Angebote auf der Website der OTRS Gruppe finden, der Firma hinter OTRS: <ulink url="http://www.otrs.com/de/solutions"> <citetitle>http://www.otrs.com/de/solutions</citetitle> </ulink>.
