Repository: xhoy/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: de

source: The configuration parameters shown in Script 11.8 can be used to synchronize the user data from your LDAP directory into your local OTRS database. This reduces the number of requests to your LDAP server and speeds up the authentication with OTRS. The data synchronization is done when the agent authenticates the first time. Although the data can be syncronized into the local OTRS database, the LDAP directory is the last instance for the authentication, so an inactive user in the LDAP tree can't authenticate to OTRS, even when the account data is already stored in the OTRS database. The agent data in the LDAP directory can't be edited via the web interface of OTRS, so the data has to be managed directly in the LDAP tree.
de: Mit den folgenden Konfigurationsparametern können die Benutzerdaten der Agenten aus dem LDAP in die lokale OTRS Datenbank synchronisiert werden. Dies reduziert die Zugriffe auf ihr LDAP Verzeichnis, entlastet den Server mit den LDAP Daten und beschleunigt die Anmeldung an OTRS. Die Synchronisierung der Daten findet bei der ersten Anmeldung des Agenten statt, trotz der synchronisierten Daten bleibt ihr LDAP Verzeichnis die letzte Instanz bei der Anmeldung. D.h. wird ein User im LDAP Verzeichnis gelöscht oder deaktiviert, klappt die Anmeldung an OTRS nicht. Ebenfalls müssen die Daten für einen Agenten weiterhin direkt im LDAP Verzeichnis gepflegt werden.

source: <emphasis>Script 11.8. Synchronizing the user data from the LDAP directory into the OTRS database.</emphasis>
de: <emphasis>Skript 11.8. Synchronisation der Benutzerdaten aus dem LDAP-Verzeichnis in die OTRS-Datenbank.</emphasis>

source: HTTPBasicAuth for Agents
de: HTTPBasicAuth für Agenten

source: If you want to implement a "single sign on" solution for all your agents, you can use HTTP basic authentication (for all your systems) and the HTTPBasicAuth module for OTRS (see Example 11-8 below).
de: Falls Sie eine "single sign on"-Lösung für Ihre Agenten implementieren möchten, benutzen Sie http basic authentication (für alle Ihre Systeme) und aktivieren Sie das HTTPBasicAuth Modul.

source: Authenticate Agents using HTTPBasic
de: Agentenauthentifizierung über HTTPBasic

source: The configuration parameters shown in Example 11-9 can be used to authenticate agents against a Radius server.
de: Mit den folgenden Einstellungen kann die Authentifizierung von Agenten gegen einen Radius-Server realisiert werden.

source: Authenticate Agents against a Radius backend
de: Agentenauthentifizierung gegen ein Radius-Backend

source: Authentication backends for Customers
de: Authentifizierungs-Backends für Kunden

source: The default user authentication backend for customers in OTRS is the OTRS database. With this backend, all customer data can be edited via the web interface of OTRS (see Example 11-10 below).
de: Das Backend für die Authentifizierung von Kunden, welches OTRS standardmäßig verwendet, ist die OTRS-Datenbank. Die Kundendaten können über das Interface zur Verwaltung von Kunden angelegt und bearbeitet werden.

source: Customer user authentication against a DB backend
de: Kundenauthentifizierung gegen ein Datenbank-Backend

source: If you have an LDAP directory with all your customer data, you can use the LDAP module to authenticate your customers to OTRS (see Example 11-11 below). Because this module has only read-access to the LDAP backend, it is not possible to edit the customer data via the OTRS web interface.
de: Falls ein LDAP Verzeichnis mit Ihren Kundenbenutzern verfügbar ist, können Sie das LDAP Modul für die Authentifizierung Ihrer Kunden nutzen. Dieses Modul greift nur lesend auf die Daten im LDAP Verzeichnis zu, d.h. die Daten können nicht mit OTRS bearbeitet werden, es können also keine Kunden mit Hilfe der Kundenverwaltung von OTRS angelegt oder bearbeitet werden.

source: Customer user authentication against an LDAP backend
de: Kundenauthentifizierung gegen ein LDAP Backend

source: HTTPBasicAuth for customers
de: HTTPBasicAuth für Kunden

source: If you want to implement a "single sign on" solution for all your customer users, you can use HTTPBasic authentication (for all your systems) and use the HTTPBasicAuth module with OTRS (no login is needed with OTRS any more). See Example 11-12 below.
de: Falls Sie eine "single sign on"-Lösung für Ihre Kunden implementieren möchten, benutzen Sie HTTPBasic Authentication (für alle Ihre Systeme) und aktivieren Sie das HTTPBasicAuth Modul (kein OTRS-Login mehr benötigt).

source: Customer user authentication with HTTPBasic
de: Kundenauthentifizierung über HTTPBasic

source: The settings shown in Example 11-13 can be used to authenticate your customers against a Radius server.
de: Mit den folgenden Einstellungen kann die Authentifizierung von Kunden gegen einen Radius-Server realisiert werden.

source: Customer user authentication against a Radius backend
de: Kundenauthentifizierung gegen ein Radius-Backend

source: Customize the customer self-registration
de: Kunden-Selbstregistrierung anpassen

source: It is possible to customize the self-registration for new customers, accessible via the customer.pl panel. New optional or required fields, like room number, address or state can be added.
de: Es ist möglich, die Kunden-Selbstregistrierung für neue Kunden über "customer.pl" anzupassen. Somit können Sie mehr optionale oder benötigte Felder (z. B. Adresse, Ort, Telefonnummer) hinzufügen.

source: The following example shows how you can specify a required field in the customer database, in this case to store the room number of a customer.
de: In folgenden Beispiel wird ein benötigtes Feld für die Raumnummer hinzugefügt.

source: Customizing the web interface
de: Anpassen der Weboberfläche

source: To display the new field for the room number in the customer.pl web interface, the .dtl file responsible for the layout in this interface has to be modified. Edit the <filename>Kernel/Output/HTML/Standard/CustomerLogin.dtl</filename> file, adding the new field around line 80 (see Script 11.9 below).
de: Damit im Webinterface das zusätzliche Feld für die Raumnummer angezeigt wird, muss die zuständige dtl-Datei angepasst werden. Editieren Sie <filename>Kernel/Output/HTML/Standard/CustomerLogin.dtl</filename> und fügen Sie das gewünschte Feld hinzu.

source: <emphasis>Script 11.9. Displaying a new field in the web interface.</emphasis>
de: <emphasis>Skript 11.9. Anzeigen eines neuen Feldes in der Weboberfläche.</emphasis>

source: Customer mapping
de: Kunden-Mapping

source: In the next step, the customer mapping has to be expanded with the new entry for the room number. To ensure that the changes are not lost after an update, put the "CustomerUser" settings from the <filename>Kernel/Config/Defaults.pm</filename> into the <filename>Kernel/Config.pm</filename>. Now change the MAP array and add the new room number field, as shown in Script 11.10.
de: Zusätzlich muss das Kunden-Mapping um den Eintrag für die Raumnummer erweitert werden. Dazu werden zuerst die Einstellungen für "CustomerUser" aus der Datei <filename>Kernel/Config/Defaults.pm</filename> in die Datei <filename>Kernel/Config.pm</filename> übertragen. Anschließend wird das Kunden-Mapping um das Raumnummer-Feld erweitert.

source: <emphasis>Script 11.10. Changing the map array.</emphasis>
de: <emphasis>Skript 11.10. Anpassung des MAP-Arrays.</emphasis>

source: Customize the customer_user table in the OTRS DB
de: Anpassen der Kunden-Tabelle in der OTRS-Datenbank

source: The last step is to add the new room number column to the customer_user table in the OTRS database (see Script 11.11 below). In this column, the entries for the room numbers will be stored.
de: Abschließend muss eine neue Spalte zur "customer_user" Tabelle in der OTRS Datenbank hinzugefügt werden, in der die Raumnummer gespeichert werden kann.

source: <emphasis>Script 11.11. Adding a new column to the customer_user table.</emphasis>
de: <emphasis>Skript 11.11. Hinzufügen einer neuen Spalte zur Tabelle customer_user.</emphasis>

source: Now the new field for the room should be displayed in the customer.pl panel. New customers should have to insert their room number if they register a new account. If you use apache and use mod_perl for OTRS, you should restart the web server to activate the changes.
de: Alle benötigten Anpassungen sind durchgeführt und das Feld für die Raumnummer sollte nun im Kunden-Interface (customer.pl) angezeigt und verwendet werden können. Neue Kunden müssen nun ihre Raumnummer angeben, wenn sie einen neuen Zugang einrichten wollen. Wird mod_perl eingesetzt, sollte der Webserver neu gestartet werden um die Änderungen zu übernehmen.

source: Predefined states
de: Vordefinierte Ticket-Status

source: OTRS allows you to change predefined ticket states and their types, or even add new ones. Two attributes are important for a state: the state name and the state type.
de: OTRS erlaubt es Ihnen, die Ticket-Status zu verändern oder neue Status hinzuzufügen. Hierbei gibt es zwei wichtige Optionen: den Namen des Status und Typ des Status.

source: The default states of OTRS are: 'closed successful', 'closed unsuccessful', 'merged', 'new', 'open', 'pending auto close+', 'pending auto close-', 'pending reminder' and 'removed'.
de: Die standardmäßig voreingestellten Status lauten: 'neu', 'offen', 'erfolgreich geschlossen', 'erfolglos geschlossen', 'merged', 'entfernt', 'warten auf erfolgreich schließen', 'warten auf erfolglos schließen' und 'warten zur Erinnerung'.

source: New
de: Neu

source: Tickets are usually in this state when created from incoming e-mails.
de: Tickets sind normalerweise nur in diesem Status, wenn sie von eingehenden E-Mails neu erzeugt werden.

source: Open
de: Öffnen

source: This is the default state for tickets assigned to queues and agents.
de: Der Standardstatus für Tickets, die Queues und Agents zugeordnet sind.

source: Pending reminder
de: Warten zur Erinnerung

source: After the pending time has expired, the ticket owner will receive a reminder email concerning the ticket. If the ticket is not locked, the reminder will be sent to all agents in the queue. Reminder tickets will only be sent out during business hours, and are repeatedly sent every 24 hours until the ticket state is changed by the agent. Time spent by the ticket in this status will still add towards the escalation time calculation.
de: Nachdem die Wartezeit abgelaufen ist, erhält der Ticketbesitzer eine E-Mail zu dem Ticket. Wenn es nicht gesperrt ist, wird die Erinnerung an alle Agenten der Queue verschickt. Erinnerungs-Benachrichtigungen werden nur innerhalb der Arbeitszeiten versendet, und werden alle 24 Stunden wiederholt, bis der Status des Tickets vom Agenten verändert wird. Die Zeit, die dieses Ticket in diesem Status verbringt, wird dennoch bei der Berechnung der Eskalationszeiten einbezogen.

source: Pending auto close-
de: Warten auf erfolglos schließen

source: Tickets in this status will be set to "Closed Unsuccessful" if the pending time has expired. Time spent by the ticket in this status will still add towards the escalation time calculation.
de: Wenn die Wartezeit abgelaufen ist, wird das Ticket auf "erfolglos geschlossen" gesetzt. Die Zeit, die dieses Ticket in diesem Status verbringt, wird dennoch bei der Berechnung der Eskalationszeiten einbezogen.

source: Pending auto close+
de: Warten auf erfolgreich schließen

source: Tickets in this status will be set to "Closed Successful" if the pending time has expired. Time spent by the ticket in this status will still add towards the escalation time calculation.
de: Wenn die Wartezeit abgelaufen ist, wird das Ticket auf "erfolgreich geschlossen" gesetzt. Die Zeit, die dieses Ticket in diesem Status verbringt, wird dennoch bei der Berechnung der Eskalationszeiten einbezogen.

source: Merged
de: Zusammengefügt

source: This is the state for tickets that have been merged with other tickets.
de: Status von Tickets, die mit anderen Tickets zusammengefügt wurden.

source: Closed Successful
de: Erfolgreich geschlossen

source: This is the end state for tickets that have been successfully resolved. Depending on your configuration, you may or may not be able to reopen closed tickets.
de: Endstatus für Tickets, die erfolgreich gelöst werden konnten. Je nach Konfiguration kann es unmöglich sein, geschlossene Tickets wieder zu eröffnen.

source: Closed Unsuccessful
de: Erfolglos geschlossen

source: This is the end state for tickets that have NOT been successfully resolved. Depending on your configuration, you may or may not be able to reopen closed tickets.
de: Endstatus für Tickets, die NICHT erfolgreich gelöst werden konnten. Je nach Konfiguration kann es unmöglich sein, geschlossene Tickets wieder zu eröffnen.

source: Customizing states
de: Anpassen von Ticket-Status

source: Every state has a name (state-name) and a type (state-type). Click on the <link linkend="adminarea-status">States</link> link on the Admin page and press the button "Add state" to create a new state. You can freely choose the name of a new state. The state types can not be changed via the web interface. The database has to be directly modified if you want to add new types or change existing names. The default state types should typically not be modified as this can yield unpredictable results. For instance, escalation calculations and the unlock feature are based on specific state types.
de: Jeder Status besteht aus einem Namen ("state-name") und einem Typen ("state-type"). Der Name ist frei wählbar und kann über das Admin-Interface von OTRS angepasst werden, die Statustypen müssen direkt in der Datenbank geändert werden. Letzteres wird jedoch nicht empfohlen und kann zu unerwarteten Ergebnissen führen. Z. B. hängen die Berechnung der Eskalationszeiten und auch die Funktion zum automatischen Entsperren von Tickets von bestimmten Statustypen ab.

source: The name of an already existing state can be changed, or new states added through this screen. If the state "new" has been changed via the web interface, this change also has to be configured via the config file <filename>Kernel/Config.pm</filename> or via the SysConfig interface. The settings specified in Script 12.1 have to be modified to ensure that OTRS works with the changed state for "new".
de: Im Admin-Interface können Sie innerhalb der Einstellungen für "Status" neue Status für die vorhandenen Statustypen hinzufügen oder ändern. Beachten Sie, dass Sie bei Änderungen am Status "neu - new" auch die entsprechenden Änderungen in der Konfigurationsdatei<filename>Kernel/Config.pm</filename> bzw. mit Hilfe des grafischen Konfigurations-Front-End vornehmen müssen. Folgende Änderungen müssen für einen geänderten "neu"-Status vorgenommen werden:

source: <emphasis>Script 12.1. Modifying the Kernel/Config.pm settings.</emphasis>
de: <emphasis>Script 12.1. Anpassung der Einstellungen von Kernel/Config.pm.</emphasis>

source: If a new state type should be added, the ticket_state_type table in the OTRS database needs to be modified with a database client program, as shown in Script 12.2.
de: Möchten Sie einen neuen Statustyp hinzufügen, müssen Sie zuerst die ticket_status-type-Tabelle in der OTRS Datenbank mit Hilfe eines entsprechenden Datenbankclient anpassen.

source: <emphasis>Script 12.2. Modifying the OTRS database.</emphasis>
de: <emphasis>Script 12.2. Anpassung der Statustypen.</emphasis>

source: Now it is possible to use the new state type you just created. After a state has been linked with this new state type, the OTRS configuration also has to be changed to ensure that the new state is usable. Just modify the following options via SysConfig:
de: Nun können Sie den neuen Statustyp verwenden. Nachdem ein Status mit diesem Statustyp verknüpft wurde, muss auch die OTRS-Konfiguration angepasst werden, damit der neue Status korrekt verwendet werden kann. Passen Sie die Folgenden Optionen in der SysConfig an:

source: <link linkend="Ticket:Frontend::Agent::Ticket::ViewPhoneNew:Ticket::Frontend::AgentTicketPhone_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewPhoneNew &gt; AgentTicketPhone###StateDefault </link> - to define the default next state for new phone tickets.
de: <link linkend="Ticket:Frontend::Agent::Ticket::ViewPhoneNew:Ticket::Frontend::AgentTicketPhone_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewPhoneNew &gt; AgentTicketPhone###StateDefault </link> - um den Standardstatus für Telefontickets einzustellen.

source: <link linkend="Ticket:Frontend::Agent::Ticket::ViewPhoneNew:Ticket::Frontend::AgentTicketPhone_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewPhoneNew &gt; AgentTicketPhone###StateType </link> - to define the available next states for new phone tickets.
de: <link linkend="Ticket:Frontend::Agent::Ticket::ViewPhoneNew:Ticket::Frontend::AgentTicketPhone_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewPhoneNew &gt; AgentTicketPhone###StateType </link> - um die verfügbaren Status für Telefontickets einzustellen.

source: <link linkend="Ticket:Frontend::Agent::Ticket::ViewEmailNew:Ticket::Frontend::AgentTicketEmail_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewEmailNew &gt; AgentTicketEmail###StateDefault </link> - to define the default next state for new email tickets.
de: <link linkend="Ticket:Frontend::Agent::Ticket::ViewEmailNew:Ticket::Frontend::AgentTicketEmail_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewEmailNew &gt; AgentTicketEmail###StateDefault </link> - um den Standardstatus für E-Mail-Tickets einzustellen.

source: <link linkend="Ticket:Frontend::Agent::Ticket::ViewEmailNew:Ticket::Frontend::AgentTicketEmail_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewEmailNew &gt; AgentTicketEmail###StateType </link> - to define the available next states for new email tickets.
de: <link linkend="Ticket:Frontend::Agent::Ticket::ViewEmailNew:Ticket::Frontend::AgentTicketEmail_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewEmailNew &gt; AgentTicketEmail###StateType </link> - um die verfügbaren Status für E-Mail-Tickets einzustellen.

source: <link linkend="Ticket:Frontend::Agent::Ticket::ViewPhoneOutbound:Ticket::Frontend::AgentTicketPhoneOutbound_State"> Ticket -&gt; Frontend::Agent::Ticket::ViewPhoneOutbound &gt; AgentTicketPhoneOutbound###State </link> - to define the default next state for new phone articles.
de: <link linkend="Ticket:Frontend::Agent::Ticket::ViewPhoneOutbound:Ticket::Frontend::AgentTicketPhoneOutbound_State"> Ticket -&gt; Frontend::Agent::Ticket::ViewPhoneOutbound &gt; AgentTicketPhoneOutbound###State </link> - um den Standardstatus für neue Telefonartikel einzustellen.

source: <link linkend="Ticket:Frontend::Agent::Ticket::ViewPhoneOutbound:Ticket::Frontend::AgentTicketPhoneOutbound_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewPhoneOutbound &gt; AgentTicketPhoneOutbound###StateType </link> - to define the available next states for new phone articles.
de: <link linkend="Ticket:Frontend::Agent::Ticket::ViewPhoneOutbound:Ticket::Frontend::AgentTicketPhoneOutbound_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewPhoneOutbound &gt; AgentTicketPhoneOutbound###StateType </link> - um die verfügbaren Status für neue Telefonartikel einzustellen

source: <link linkend="Ticket:Frontend::Agent::Ticket::ViewMove:Ticket::DefaultNextMoveStateType"> Ticket:Frontend::Agent::Ticket::ViewMove:Ticket::DefaultNextMoveStateType </link> - to define the default next state after moving a ticket.
de: <link linkend="Ticket:Frontend::Agent::Ticket::ViewMove:Ticket::DefaultNextMoveStateType"> Ticket:Frontend::Agent::Ticket::ViewMove:Ticket::DefaultNextMoveStateType </link> - um den Standardstatus für das Verschieben von Tickets einzustellen.

source: <link linkend="Ticket:Frontend::Agent::Ticket::ViewBounce:Ticket::Frontend::AgentTicketBounce_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewBounce &gt; StateDefault </link> - to define the default next state after bouncing a ticket.
de: <link linkend="Ticket:Frontend::Agent::Ticket::ViewBounce:Ticket::Frontend::AgentTicketBounce_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewBounce &gt; StateDefault </link> - um den Standardstatus für das Bouncen eines Tickets einzustellen

source: <link linkend="Ticket:Frontend::Agent::Ticket::ViewBounce:Ticket::Frontend::AgentTicketBounce_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewBounce &gt; StateType </link> - to define the available next states in the bounce screen.
de: <link linkend="Ticket:Frontend::Agent::Ticket::ViewBounce:Ticket::Frontend::AgentTicketBounce_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewBounce &gt; StateType </link> - um die verfügbaren Status für das Bouncen von Tickets einzustellen.

source: <link linkend="Ticket:Frontend::Agent::Ticket::ViewBulk:Ticket::Frontend::AgentTicketBulk_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewBulk &gt; StateDefault </link> - to define the default next state in a bulk action.
de: <link linkend="Ticket:Frontend::Agent::Ticket::ViewBulk:Ticket::Frontend::AgentTicketBulk_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewBulk &gt; StateDefault </link> - um den Standardstatus in einer Sammelaktion einzustellen.

source: <link linkend="Ticket:Frontend::Agent::Ticket::ViewBulk:Ticket::Frontend::AgentTicketBulk_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewBulk &gt; StateType </link> - to define the available next states in the bulk action screen.
de: <link linkend="Ticket:Frontend::Agent::Ticket::ViewBulk:Ticket::Frontend::AgentTicketBulk_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewBulk &gt; StateType </link> - um die verfügbaren Status in einer Sammelaktion einzustellen.

source: <link linkend="Ticket:Frontend::Agent::Ticket::ViewClose:Ticket::Frontend::AgentTicketClose_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewClose &gt; StateDefault </link> - to define the default next state after closing a ticket.
de: <link linkend="Ticket:Frontend::Agent::Ticket::ViewClose:Ticket::Frontend::AgentTicketClose_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewClose &gt; StateDefault </link> - um den Standardstatus für das Schließen von Tickets einzustellen.

source: <link linkend="Ticket:Frontend::Agent::Ticket::ViewClose:Ticket::Frontend::AgentTicketClose_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewClose &gt; StateType </link> - to define the available next states in the close screen.
de: <link linkend="Ticket:Frontend::Agent::Ticket::ViewClose:Ticket::Frontend::AgentTicketClose_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewClose &gt; StateType </link> - um die verfügbaren Status für das Schließen von Tickets einzustellen.

source: <link linkend="Ticket:Frontend::Agent::Ticket::ViewCompose:Ticket::Frontend::AgentTicketCompose_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewCompose &gt; StateDefault </link> - to define the default next state in the Compose (reply) screen.
de: <link linkend="Ticket:Frontend::Agent::Ticket::ViewCompose:Ticket::Frontend::AgentTicketCompose_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewCompose &gt; StateDefault </link> - um den Standardstatus für Antworten einzustellen.

source: <link linkend="Ticket:Frontend::Agent::Ticket::ViewCompose:Ticket::Frontend::AgentTicketCompose_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewCompose &gt; StateType </link> - to define the available next states in the Compose (reply) screen.
de: <link linkend="Ticket:Frontend::Agent::Ticket::ViewCompose:Ticket::Frontend::AgentTicketCompose_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewCompose &gt; StateType </link> - um die verfügbaren Status für das Antworten einzustellen.
