Repository: xhoy/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: de

source: Removes old and no longer needed session IDs.
de: Über dieses Skript werden alte und nicht mehr gültige Session-IDs entfernt.

source: Unlocks tickets in the system.
de: Mit Hilfe dieses Skripts wird die Freigabe von Tickets innerhalb des Systems ermöglicht.

source: To setup all cron jobs, the script <filename>bin/Cron.sh</filename> located in the home directory of the 'otrs' user can be used. When this script is executed, it needs a parameter to specify whether you want to install, remove or reinstall the cron jobs. The following parameters can be used:
de: Für die Einrichtung aller cron-Jobs kann das Skript <filename>bin/Cron.sh</filename> verwendet werden, das sich im Homeverzeichnis des OTRS-Benutzers befindet. Dem Skript muss beim Aufruf ein Parameter übergeben werden. Dieser Parameter legt fest, ob die cron-Jobs installiert, deinstalliert oder neu gestartet werden. Es sind folgende Parameter zulässig:

source: <command>Cron.sh</command> <arg choice='req'> <replaceable>start</replaceable> </arg> <arg choice='req'> <replaceable>stop</replaceable> </arg> <arg choice='req'> <replaceable>restart</replaceable> </arg> <arg choice='opt'> <replaceable>OTRS user</replaceable> </arg>
de: <command>Cron.sh</command> <arg choice='req'> <replaceable>start</replaceable> </arg> <arg choice='req'> <replaceable>stop</replaceable> </arg> <arg choice='req'> <replaceable>restart</replaceable> </arg> <arg choice='opt'> <replaceable>OTRS-Benutzer</replaceable> </arg>

source: Because the cron jobs need to be installed in the crontab file of the 'otrs' user, you need to be logged in as 'otrs'. If you are logged in as root, you can switch to 'otrs' with the command <command>su otrs</command>. Execute the commands specified in Script 3.18 below to install the cron jobs.
de: Da die cron-Jobs für den Benutzer 'otrs' angelegt werden sollen, muss das Skript von diesem Benutzer ausgeführt werden. Sind Sie z. B. als Benutzer root am System angemeldet, können Sie mit Hilfe des Kommandos <command>su otrs</command> zum OTRS-Benutzer wechseln. Nehmen Sie also die Installation wie folgt vor.

source: Please note that other crontab entries of the 'otrs' user will be overwritten or removed by the <filename>Cron.sh</filename> script. Please change the <filename>Cron.sh</filename> script to retain other crontab entries as needed.
de: Bitte beachten Sie, dass durch die Verwendung von <filename>Cron.sh</filename> evtl. andere Cron-Jobs des OTRS-Benutzers überschrieben bzw. gelöscht werden. Um weitere, nicht von OTRS benötigte Cron-Jobs für den OTRS-Benutzer zu installieren, erweitern Sie bitte <filename>Cron.sh</filename> dementsprechend.

source: <emphasis>Script 3.18. Installing the cron jobs.</emphasis>
de: <emphasis>Skript 3.18. Installation der Cronjobs.</emphasis>

source: The command <command>crontab -l -u otrs</command>, which can be executed as root, shows you the crontab file of the 'otrs' user, and you can check if all entries are placed correctly (see Script 3.19 below).
de: Mit Hilfe des Kommandos <command>crontab -l -u otrs</command>, das Sie als root ausführen können, wird die crontab-Datei des Benutzers 'otrs' angezeigt und Sie können überprüfen, ob alle Einträge vorhanden sind.

source: <emphasis>Script 3.19. Crontab file.</emphasis>
de: <emphasis>Skript 3.19. Crontab-Datei.</emphasis>

source: Upgrading the OTRS Framework
de: Upgrade des OTRS Frameworks

source: These instructions are for people upgrading OTRS from version <emphasis>2.4</emphasis> to <emphasis>3.0</emphasis>, and apply both for RPM and source code (tarball) upgrades.
de: Diese Hinweise sind für Leute gedacht, die von OTRS 2.4 auf 3.0 upgraden, und gilt für RPM-basierte und manuelle Upgrades (tarball).

source: If you are running a lower version of OTRS, you have to follow the upgrade path to 2.4 first (1.1-&gt;1.2-&gt;1.3-&gt;2.0-&gt;2.1-&gt;2.2-&gt;2.3-&gt;2.4-&gt;3.0 ...).
de: Wenn Sie eine ältere Version von OTRS einsetzen, müssen sie zuerst dem Upgrade-Pfad zur 2.4 folgen (1.1-&gt;1.2-&gt;1.3-&gt;2.0-&gt;2.1-&gt;2.2-&gt;2.3-&gt;2.4->&gt;3.0 ...).

source: If you need to do a "patch level upgrade", which is an upgrade for instance from OTRS version 3.0.3 to 3.0.4, you should skip steps 8, 9, 10, and 13 - 16.
de: Wenn Sie ein "Patchlevel-Update" durchführen wollen, z. B. von OTRS 3.0.3 auf 3.0.4, dann sollten Sie die Schritte 8, 9, 10 und 13 - 16 auslassen.

source: Stop all relevant services.
de: Stoppen Sie alle relevanten Dienste.

source: e. g. (depends on used services): <placeholder type="screen" id="0"/>
de: z. B. (hängt von eingesetzten Diensten ab): <placeholder type="screen" id="0"/>

source: Backup everything below $OTRS_HOME (default: OTRS_HOME=/opt/otrs):
de: Sichern Sie folgende Daten in $OTRS_HOME (Standard: OTRS_HOME=/opt/otrs):

source: Backup the database.
de: Sichern Sie die Datenbank.

source: If possible, try this install on a separate machine for testing first.
de: Neues System aufsetzen (optional). Wenn möglich, installieren Sie zunächst auf einer separaten Testmaschine.

source: Install the new release (tar or RPM).
de: Installieren Sie das neue Release (tar oder RPM).

source: With the tarball:
de: Mit dem Tarball:

source: Restore old configuration files.
de: Alte Configdateien wiederherstellen.

source: With the RPM: <placeholder type="screen" id="0"/>
de: Per RPM: <placeholder type="screen" id="0"/>

source: In this case the RPM update automatically restores the old configuration files.
de: In diesem Fall stellt das RPM-Update die alten Konfigurationsdateien automatisch wieder her.

source: Own themes
de: Eigene Themes

source: Note: The OTRS themes between 2.4 and 3.0 are NOT compatible, so don't use your old themes! Themes are located under $OTRS_HOME/Kernel/Output/HTML/*/*.dtl (default: OTRS_HOME=/opt/otrs).
de: Hinweis: Die OTRS-Themes von 2.4 sind nicht zu 3.0 kompatibel, verwenden Sie ihre alten Themes daher nicht weiter! (Themes befinden sich in /opt/otrs/Kernel/Output/HTML/*/*.dtl)

source: Set file permissions.
de: Setzen Sie die Datei-Berechtigungen.

source: If the tarball is used, execute: <placeholder type="screen" id="0"/> with the permissions needed for your system setup.
de: wenn der Tarball benutzt wird, führen Sie <placeholder type="screen" id="0"/> aus, um die Berechtigungen zu setzen, die für Ihr System benötigt werden.

source: Apply the database changes (part 1/2):
de: Wenden Sie die Datenbankänderungen an (Teil 1/2):

source: Run the migration script (as user 'otrs', NOT as root):
de: Führen Sie das Migrationsskript aus (als OTRS-Benutzer, nicht als root!):

source: You must execute the migration script to migrate some data from the old database structure to the new one. Please run: <placeholder type="screen" id="0"/>
de: Sie müssen das Migrationsskript ausführen, um die Daten auf die neue Datenbankstruktur zu übernehmen. Bitte führen Sie <placeholder type="screen" id="0"/> aus.

source: Apply the database changes (part 2/2):
de: Datenbankänderungen anwenden (Teil 2/2):

source: Refresh the configuration and delete caches. Please run:
de: Systemkonfiguration aktualisieren und Caches löschen. Bitte führen Sie aus:

source: Restart your services.
de: Starten Sie Ihre Dienste neu.

source: shell&gt; /etc/init.d/cron start shell&gt; /etc/init.d/postfix start shell&gt; /etc/init.d/apache start
de: shell&gt; /etc/init.d/cron stop shell&gt; /etc/init.d/postfix stop shell&gt; /etc/init.d/apache stop

source: Check for encoding issues:
de: Prüfen Sie auf mögliche Kodierungsprobleme:

source: With OTRS 3.0, the default charset of OTRS was changed from "iso-8859-1" to "utf-8".
de: Mit OTRS 3.0 wurde der Standardzeichensatz von "ISO-8859-1" auf "utf-8" umgestellt.

source: This will only affect you if you did not specify a charset in Kernel/Config.pm (all installations that were made with the web installer have a custom setting there) or if you didn't change the default charset in the AdminSysConfig.
de: Von dieser Änderung sind Sie nur betroffen, wenn sie in Kernel/Config.pm keinen Zeichensatz eingestellt haben (alle Installationen, die unter Verwendung des Web-Installers angelegt wurden, haben dort einen konfigurierten Wert), und sie den vorkonfigurierten Wert nicht in AdminSysconfig geändert haben.

source: If you experience problems with the new charset, add this line to Kernel/Config.pm: <placeholder type="screen" id="0"/>
de: Wenn Sie mit dem neuen Zeichensatz Probleme feststellen sollten, dann fügen Sie diese Zeile zu Kernel/Config.pm hinzu: <placeholder type="screen" id="0"/>

source: In general, using "utf-8" is the recommended mode of running OTRS, and switching from "iso-8859-1" should work well.
de: Generell ist "utf-8" der empfohlene Zeichensatz für den Betrieb von OTRS, und die Umstellung von "iso-8859-1" sollte problemlos verlaufen.

source: Please note: We recommend you change existing non-UTF-8 installations of OTRS to UTF-8 with the upgrade to 3.0. All other encodings are now deprecated.
de: Hinweis: Wir empfehlen, alle existierenden nicht-UTF-8-Installationen bereits jetzt mit dem Update auf 3.0 auf UTF-8 umzustellen. Andere Zeichensätze sind ab sofort im Status "veraltet / nicht empfohlen".

source: OTRS 3.1 will only allow UTF-8 as the internal charset.
de: OTRS 3.1 wird nur noch UTF-8 als internen Zeichensatz unterstützen.

source: Check for Custom Frontend Module Registrations
de: Auf angepasste Frontend-Modulregistrierungen prüfen

source: Starting with OTRS 3.0, application modules may have their own special CSS and/or JavaScript code. This is part of the frontend module registration of the modules in the SysConfig. This may cause problems during the upgrade, because locally modified frontend module configuration settings will not catch the updates of the new default configuration.
de: Seit OTRS 3.0 können Applikationsmodule ihr eigenes spezielles CSS und/oder Javascript haben. Dieses wird als Teil der sog. Frontend-Modulregistrierung der Module in der SysConfig angegeben. Das kann Probleme beim Upgrade verursachen, weil lokal geänderte Frontend-Modulregistrierungen die Updates der neuen Standardkonfiguration nicht erhalten.

source: To check if you are affected, please look at the file <filename>Kernel/Config/Files/ZZZAuto.pm</filename> and look for entries like: <placeholder type="screen" id="0"/>
de: Ob Sie betroffen sind, können sie herausfinden, indem Sie sich <filename>Kernel/Config/Files/ZZZAuto.pm</filename> ansehen und nach Einträgen wie <placeholder type="screen" id="0"/> suchen

source: These settings should be reset to their default value in Admin -> SysConfig (in this case: 'Frontend::Module###AgentStats') with the little "Reset" button next to the "Active" checkbox. Then the settings will be reset with the new module-specific settings and no longer show up in <filename>Kernel/Config/Files/ZZZAuto.pm</filename>. After this procedure, you may customize these settings again, if needed.
de: Diese Einträge sollten auf ihren Standardwert zurückgesetzt werden, in Admin -> SysConfig (in diesem Fall: 'Frontend::Module###AgentStats') mit dem kleinen "Zurücksetzen"-Knopf neben dem Optionsfeld "Aktiv". Dann werden die Einträge zurückgesetzt auf ihren Standardwert und tauchen demzufolge nicht mehr in <filename>Kernel/Config/Files/ZZZAuto.pm</filename> auf. Nach dieser Maßnahme können Sie die Einträge wieder anpassen, falls erforderlich.

source: The same procedure must be executed for the setting "Frontend::ToolBarModule###1-Ticket::TicketSearchFulltext", as this now also uses module specific CSS styles. If this setting is not activated on your system, you can safely omit this step.
de: Dieselbe Prozedur muss für den Eintrag "Frontend::ToolBarModule###1-Ticket::TicketSearchFulltext" durchgeführt werden, weil dieses auch modulspezifisches CSS verwendet. Wenn diese Einstellung auf Ihrem System nicht aktiv ist, können Sie diesen Schritt überspringen.

source: Check for customized PreferencesGroups entries
de: Auf angepasste PreferencesGroups-Einträge prüfen

source: With OTRS 3.0, there were a few corrections in PreferencesGroups configuration entries. Notably, the keys 'Activ' and 'Colum' were changed to 'Active' and 'Column', respectively. You only need to take action if you have customized such settings on your system, otherwise they will be updated automatically.
de: In OTRS 3.0 gab es einige Korrekturen in den PreferencesGroups-Konfigurationseinträgen. Die Schlüssel 'Activ' und 'Colum' wurden in 'Active' und 'Column' geändert. Sie müssen sich darum nur kümmern, wenn Sie solche Einträge in Ihrem System angepasst haben, ansonsten werden sie automatisch aktualisiert.

source: To check if you are affected, please look at the file <filename>Kernel/Config/Files/ZZZAuto.pm</filename> and look for entries like: <placeholder type="screen" id="0"/> This needs to be changed as follows: <placeholder type="screen" id="1"/>
de: Ob Sie betroffen sind, können sie herausfinden, indem Sie sich <filename>Kernel/Config/Files/ZZZAuto.pm</filename> ansehen und nach Einträgen wie <placeholder type="screen" id="0"/> suchen. Diese müssen wie folgt verändert werden: <placeholder type="screen" id="1"/>

source: Customer Database Backend Field Renaming
de: Feld-Umbenennung im Kunden-Datenbankbackend

source: The field 'salutation' in the built-in customer database has been renamed to the more appropriate 'title'. If you are using the built-in database data source for customers, and you have changed the configuration, for instance because you have added fields to the customer table, or because you have enabled Customer Company support, you should change the mapping in your <filename>Kernel/Config.pm</filename>:
de: Das Feld 'salutation' in der eingebauten Kundendatenbank wurde umbenannt in das angemessenere 'title'. Falls Sie die eingebaute Datenbank als Backend für Kundenverwaltung benutzen, und Sie die Konfiguration angepasst haben, z. B. weil Sie Felder zu der Datenbank hinzugefügt haben, oder die Unterstützung für Kunden-Unternehmen aktiviert haben, sollten Sie das Mapping in Ihrer <filename>Kernel/Config.pm</filename> anpassen:

source: Change this line: <placeholder type="screen" id="0"/> to: <placeholder type="screen" id="1"/>
de: Verändern Sie diese Zeile: <placeholder type="screen" id="0"/> folgendermaßen: <placeholder type="screen" id="1"/>

source: Please note that this can also affect any salutations or other templates where you have used the string <literal>&lt;OTRS_*_UserSalutation&gt;</literal>. If you have used this string AND you use the built-in customer table, please replace it with <literal>&lt;OTRS_CURRENT_UserTitle&gt;</literal> instead.
de: Davon können auch Anreden oder andere Templates betroffen sein, in dem Sie die Zeichenkette <literal>&lt;OTRS_*_UserSalutation&gt;</literal> verwendet haben. Wenn Sie diese Zeichenkette verwendet haben UND die interne Kundendatenbank einsetzen, sollten Sie <literal>&lt;OTRS_CURRENT_UserTitle&gt;</literal> stattdessen verwenden.

source: Optional: Mark Tickets as Read
de: Optional: Tickets als gelesen markieren

source: In OTRS 3.0 there is a new feature: New tickets and new articles which an Agent did not read yet are highlighted as 'unread'. For all tickets which were created before the upgrade to OTRS 3.0, the 'read' information is missing, and therefore these tickets will be marked as 'unread'. If this bothers you, you can use a script to set all tickets and articles as read for all agents which have read permissions for these tickets. Note that this script may run for a while! <placeholder type="screen" id="0"/>
de: In OTRS 3.0 gibt es eine neue Funktion: neue Tickets und neue Artikel, die ein Agent noch nicht gelesen hat, werden als 'ungelesen' gekennzeichnet. Für alle Tickets, die vor dem Upgrade auf OTRS 3.0 erstellt wurden, fehlt die 'gelesen'-Information jedoch, daher werden diese Tickets als 'ungelesen' dargestellt. Wenn das Sie stört, können Sie ein Skript verwenden, welches alle Tickets und alle Artikel im System für alle Agenten mit Leserechten auf 'gelesen' setzt. Beachten Sie, dass dieses Skript eine ganze Weile für seine Arbeit benötigen kann! <placeholder type="screen" id="0"/>

source: Well done!
de: Gut gemacht!

source: Upgrading Windows Installer
de: Upgrade mit dem Windows-Installer

source: There is currently no in-place upgrade tool available for OTRS installations that were done with the Windows Installer. The upgrade process basically consists of backing up the database and the filesystem, uninstalling OTRS, installing the new version, restoring the database and running the upgrade procedure if needed.
de: Derzeit gibt es keinen automatischen Upgrademechanismus für OTRS-Installationen, die mit dem Windows-Installer erstellt wurden. Das Upgrade besteht im Wesentlichen aus einem Backup der Datenbank und des Filesystems, dem Deinstallieren von OTRS, der Installation der neuene Version, der Wiederherstellung der Datenbank und dem Ausführen der Upgrade-Prozedur.

source: Upgrading is described in <ulink url="http://faq.otrs.org/otrs/public.pl?Action=PublicFAQ;ItemID=351">FAQ# 4200351</ulink>, and there is also an informative <ulink url="http://www.youtube.com/watch?v=sf0R-reMTWc">YouTube video</ulink> available.
de: Das Upgrade wird beschrieben in <ulink url="http://faq.otrs.org/otrs/public.pl?Action=PublicFAQ;ItemID=351">FAQ# 4200351</ulink>, und es gibt zudem ein informatives <ulink url="http://www.youtube.com/watch?v=sf0R-reMTWc">YouTube-Video</ulink> available.

source: First steps
de: Erste Schritte

source: This chapter's goal is to give a quick overview of OTRS and the structure of its web interface. The terms agents, customers and administrators are introduced. We also login as the OTRS admininstrator and take a closer look at the user preferences available for every account.
de: Dieser Abschnitt soll einen ersten Überblick über die Funktionsweise von OTRS und den Aufbau der Weboberfläche des Systems geben. Es werden die Unterschiede zwischen Mitarbeitern (Agents), Kunden (Customer) und Administratoren erklärt. Anschließend wird die erste Anmeldung als OTRS-Administrator durchgeführt und erläutert, was mit Hilfe der Benutzereinstellungen für jeden Account innerhalb des Systems festgelegt werden kann.

source: Agent web interface
de: Agenten-Weboberfläche

source: The agent web interface allows agents to answer customer requests, create new tickets for customers or other agents, write tickets about telephone calls with customers, write FAQ entries, edit customer data, etc.
de: Die Mitarbeiter bearbeiten über die Weboberfläche des Systems die Anfragen der Kunden, erstellen neue Tickets für andere Mitarbeiter oder Kunden, legen Tickets über Telefongespräche mit Kunden an, schreiben FAQ-Einträge, bearbeiten Kundendaten usw.

source: Supposing your OTRS host is reachable via the URL <ulink url="http://www.example.com/"> <citetitle>http://www.example.com</citetitle> </ulink> , then the OTRS login screen can be reached by using the address <ulink url="http://www.example.com/otrs/index.pl"> <citetitle>http://www.example.com/otrs/index.pl</citetitle> </ulink> in a web browser (see Figure 4.1 below).
de: Angenommen, Ihr Host mit der OTRS-Installation ist über die Domain <ulink url="http://www.example.com/"> <citetitle>http://www.example.com</citetitle> </ulink> erreichbar, so kann der Login-Bildschirm für die Mitarbeiter und somit auch für den OTRS-Administrator über die URL <ulink url="http://www.example.com/otrs/index.pl"> <citetitle>http://www.example.com/otrs/index.pl</citetitle> </ulink> aufgerufen werden.

source: index.pl - Agent login screen
de: index.pl - Login-Bildschirm für Agenten

source: <emphasis>Figure 4.1. Login screen of the agent interface.</emphasis>
de: <emphasis>Abb. 4.1. Login-Bildschirm der Agenten-Weboberfläche.</emphasis>

source: Customer web interface
de: Kunden-Weboberfläche

source: Customers have a separate web interface in OTRS, through which they can create new accounts, change their account settings, create and edit tickets, get an overview on tickets that they created, etc.
de: Kunden können über das speziell für sie vorhandene Webinterface von OTRS einen eigenen Kundenaccount anlegen, die eigenen Tickets einsehen, Tickets erstellen und bearbeiten, die Account-Einstellungen anpassen usw.

source: Continuing with the above example, the customer login screen can be reached by using the URL <ulink url="http://www.example.com/otrs/customer.pl"> <citetitle>http://www.example.com/otrs/customer.pl</citetitle> </ulink> with a web browser (see Figure 4.2 below).
de: Gemäß dem obigen Beispiel kann der Login-Bildschirm für die Kunden über die URL<ulink url="http://www.example.com/otrs/customer.pl"> <citetitle>http://www.example.com/otrs/customer.pl</citetitle> </ulink> geladen werden.

source: customer.pl - Customer login screen
de: customer-pl - Kunden-Weboberfläche

source: <emphasis>Figure 4.2. Login screen of the customer interface.</emphasis>
de: <emphasis>Abb. 4.2. Login-Bildschirm der Kunden-Weboberfläche.</emphasis>

source: Public web interface
de: Öffentliche Weboberfläche

source: In addition to the web interfaces for agents and customers, OTRS also has a public web interface that is available through the FAQ-Module. This module needs to be installed separately. It provides public access to the FAQ system, and lets visitors search through FAQ entries without any special authorization.
de: Neben diesen beiden Bereichen der Weboberfläche verfügt OTRS weiterhin über ein Interface, welches vom FAQ-Modul bereit gestellt wird (muss separat installiert werden). Es ist öffentlich, also ohne Anmeldung, zugänglich und bietet Zugriff auf das FAQ-System.

source: In our example, the public web interface can be reached via either of the URLs below: <ulink url="http://www.example.com/otrs/faq.pl"> <citetitle>http://www.example.com/otrs/faq.pl</citetitle> </ulink> , <ulink url="http://www.example.com/otrs/public.pl"> <citetitle>http://www.example.com/otrs/public.pl</citetitle> </ulink>
de: Das öffentliche Web-Interface ist über die URL <ulink url="http://www.example.com/otrs/faq.pl"> <citetitle>http://www.example.com/otrs/faq.pl</citetitle> </ulink> erreichbar. Ebenfalls ist ein Zugriff auf die FAQ über die URL <ulink url="http://www.example.com/otrs/public.pl"> <citetitle>http://www.example.com/otrs/public.pl</citetitle> </ulink> möglich

source: public.pl - Public web interface
de: public.pl - Öffentliche Weboberfläche

source: <emphasis>Figure 4.3. Public web interface.</emphasis>
de: <emphasis>Abb. 4.3. Öffentliche Weboberfläche.</emphasis>

source: First login
de: Die erste Anmeldung

source: Access the login screen as described in the section <link linkend="agent-interface">Agent web interface </link>. Enter a user name and a password. Since the system has just been freshly installed and no users have yet been created, login as OTRS administrator first, using 'root@localhost' for username and 'root' for password.
de: Der Zugriff auf den Login-Bildschirm wird im Abschnitt <link linkend="agent-interface">Agenten-Weboberfläche </link> beschrieben. Hier haben Sie die Möglichkeit, einen Benutzernamen und ein Kennwort anzugeben. Um sich als OTRS-Administrator anzumelden, verwenden Sie als Benutzername "root@localhost" und als Kennwort "root".

source: This account data is valid on every newly installed OTRS system. You should change the password for the OTRS administrator as soon as possible! This can be done via the <link linkend="user-preferences">preferences</link> screen for the OTRS administrator account.
de: Diese Zugangsdaten werden bei jeder OTRS-Installation standardmäßig vergeben. Da das Kennwort für den OTRS-Administrator somit öffentlich bekannt ist, sollten Sie es schnellstmöglich ändern! Sie können dies nach der Anmeldung als OTRS-Administrator über die <link linkend="user-preferences">Benutzereinstellungen</link> vornehmen.
