Repository: xhoy/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: de

source: The stats are edited with a wizard in four steps:
de: Das Bearbeiten der Statistiken erfolgt in vier Schritten mit Hilfe eines Assistenten bzw. Wizards:

source: General specifications.
de: Allgemeine Angaben zur Statistik.

source: Definition of the element for the X-axis.
de: Festlegen des Elements für die X-Achse.

source: Specification of the value series.
de: Festlegen der Wertereihen.

source: Selecting the restrictions to limit the report.
de: Festlegen der Einschränkungen des Reports.

source: Steps 2 through 4 are only needed for the generation of reports with dynamic stats. For a static stat, only the general information (point 1) is required.
de: Die Punkte 2-4 werden nur für dynamisch zusammengestellte Statistiken benötigt. Benutzt man eine statische Statistik ist man mit dem Einfügen der allgemeinen Angaben in Punkt 1. bereits fertig.

source: Information about how to handle the page is provided on each of these screens, below the Actions panel in a Hints panel.
de: Für alle Eingabeoberflächen des Statistik-Moduls gilt: Im Anschluss an das jeweilige Eingabeformular findet der Benutzer Informationen zur Bedienung der Seite.

source: If incorrect inputs are entered, the previously processed user interface is displayed again and with information about the incorrect input. This information can be found in the OTRS notification section. The next input user interface is only displayed after the current form has been filled out correctly.
de: Sollte es dennoch zu fehlerhaften Eingaben kommen, wird die zuvor bearbeitete Oberfläche wieder geladen. Dabei wird die Seite um Informationen zur fehlerhaften Eingabe ergänzt. Diese Informationen findet man im Notificationbereich von OTRS. Erst nachdem ein Formular korrekt ausgefüllt wurde, gelangt man zur nächsten Eingabeoberfläche.

source: <emphasis>General specifications</emphasis>. It is the first page of the Edit wizard (see Figure 19.5 below).
de: <emphasis>Allgemeine Angaben</emphasis>. Dies ist die erste Seite des Assistenten.

source: General specifications
de: Allgemeine Angaben

source: <emphasis>Figure 19.5. Editing the general specifications of a report.</emphasis>
de: <emphasis>Abb. 19.5. Allgemeine Angaben zur Statistik bearbeiten.</emphasis>

source: In the screen showed in Figure 19.5, there are a great number of common specifications and settings that can be edited:
de: Folgende allgemeine Angaben und Einstellungen der Statistik können geändert werden:

source: <emphasis>Title</emphasis>. Should reflect the stat's purpose in a concise manner.
de: <emphasis>Titel</emphasis>. Er sollte kurz und prägnant die Aufgabe der Statistik wiedergeben.

source: <emphasis>Description</emphasis>. More descriptive information about the report definition, type of configuration parameters, etc.
de: <emphasis>Beschreibung</emphasis>. Hier werden Informationen eingetragen, die einen tieferen Einblick in die Aufgabenstellung, Art der Konfigurationsparameter, usw. erlauben.

source: <emphasis>Dynamic object</emphasis>. If the OTRS installation provides various dynamic objects, one of them can be chosen. The objects meet the requirements of the particular modules.
de: <emphasis>Dynamisches Objekt</emphasis>. Sollte die OTRS-Installation über mehrere dynamische Objekte verfügen, kann hier das gewünschte Objekt ausgewählt werden. Die Objekte sind jeweils auf die Anforderungen des entsprechenden Moduls ausgelegt.

source: <emphasis>Static file</emphasis>. Usually this selection is not shown, as only static files which are not yet assigned to any reports are displayed. If "Static file" is displayed, however, it is important to tick the option field and select a generation mode (dynamic with a dynamic object or static with a file). If a static file is selected, the input user interfaces 2 through 4 are not shown as the static file contains all required configuration settings.
de: <emphasis>Statische Datei</emphasis>. An dieser Stelle kann eine gewünschte statische Datei ausgewählt werden. Diese Auswahl wird für gewöhnlich nicht erscheinen, da nur die statischen Dateien angezeigt werden, die noch keiner Statistik zugeordnet wurden! Wenn der Punkt "Statische Datei" angezeigt wird, ist es wichtig im Formular durch die Auswahl des Optionsfelds die gewünschte Generierungsart auszuwählen (Dynamisch durch ein dynamisches Objekt oder statisch durch eine Datei). Wird eine statische Datei ausgewählt entfallen die Eingabeoberflächen 2-4, da die statische Datei die nötigen Konfigurationen bereits mitbringt.

source: <emphasis>Permission settings</emphasis>. Facilitate a restriction of the groups (and therefore, agents) who can later view and generate the preconfigured reports. Thus the various reports can be allocated to the different departments and work groups who need them. It is possible to allocate one report to various groups.
de: <emphasis>Rechtevergabe</emphasis>. Durch die Rechtevergabe kann man regeln, welche Gruppen (und dadurch welche Agents) die vorkonfigurierten Statistiken später ansehen und generieren können. So können die verschiedenen Statistiken auf die verschiedenen Abteilungen und Arbeitsgruppen aufgeteilt werden, die diese benötigen. Eine Mehrfachauswahl ist dabei möglich.

source: Example 1: The "stats" group was selected. The report is viewable for all users having at least ro rights for the "stats" group. This access is available by default.
de: Beispiel 1: Die Gruppe "stats" wurde ausgewählt. Der Report kann von allen Nutzern verwendet werden, die mindestens "ro"-Rechte für die Gruppe "stats" haben. Diese Berechtigung ist die Voreinstellung.

source: Example 2: A group named "sales" was selected. All users with ro rights for the "sales" group can see the stat in the view mode and generate it. However, the report will not be available for viewing by other users.
de: Beispiel 2: Es wurde eine Gruppe namens "sales" selektiert. Alle Benutzer die ro-Rechte in der Gruppe "sales" haben können nun diese Statistik im Ansichtsmodus sehen und generieren. Anderen Benutzern, die in der Lage sind Statistiken zu generieren wird dann diese Statistik nicht angeboten.

source: <emphasis>Format</emphasis>. Output format of the stat: Depending on the configuration, one or more of the following formats can be chosen:
de: <emphasis>Format</emphasis>. Ausgabeformat der Statistik. Hierbei stehen je nach Konfiguration folgende Ausgabeformate zur Verfügung:

source: graph-lines.
de: Liniendiagramm.

source: graph-bars.
de: Balkendiagramm.

source: graph-hbars.
de: Balkendiagramm (horizontal).

source: graph-points.
de: Punktdiagramm.

source: graph-lines-points.
de: Linienpunktdiagramm.

source: graph-area.
de: Flächendiagramm.

source: graph-pie.
de: Tortendiagramm.

source: <emphasis>Graphsize</emphasis>. Select the chart size in pixels. This selection is only necessary if a graphical output format has been chosen under "Format". All graphic sizes that can generally be used are defined by the OTRS administrator in SysConfig. When configuring the report, the agent can pre-select all relevant formats.
de: <emphasis>Grafikgröße</emphasis>. Hier kann ausgewählt werden, in welchen Größen (Pixel) die Diagramme ausgegeben werden dürfen. Diese Auswahl ist nur sinnvoll, wenn unter dem Punkt "Format" ein grafisches Ausgabeformat ausgewählt wurde. Alle generell verwendbaren Grafikgrößen werden durch den OTRS-Admin in der SysConfig definiert. Bei der Konfiguration der Statistiken kann der Ersteller alle relevanten Formate vorselektieren.

source: <emphasis>Sum rows</emphasis>. Indicates whether the report is amended by a column, whose cells contain the sum of the respective row.
de: <emphasis>Zeilensummierung</emphasis>. Wird im "Ja" ausgewählt, wird die Statistik durch eine Spalte ergänzt, deren Zellen die Summe der jeweiligen Zeile darstellt.

source: <emphasis>Sum columns</emphasis>. Indicates whether the report is amended by a row, whose cells contain the sum of the respective column.
de: <emphasis>Spaltensummierung</emphasis>. Angabe, ob die Statistik durch eine Zeile ergänzt wird, deren Zellen die Summe der jeweiligen Spalte beinhaltet.

source: <emphasis>Cache</emphasis>. Specifies if the generated report should be cached in the filesystem. This saves computing power and time if the report is called up again, but it should only be used if the report's content is no longer changing.
de: <emphasis>Cache</emphasis>. Wird im "Ja" ausgewählt, werden die errechneten Statistiken im Dateisystem gecacht. Dies spart Rechenleistung und Zeit, sollte genau diese Statistik wieder aufgerufen werden. Diese Funktion ist jedoch nur sinnvoll, wenn sichergestellt ist, dass sich der Inhalt der Statistik nicht mehr ändert. Dies ist genau zu prüfen, bevor man die Cachingfunktion nutzt.

source: Caching is automatically prevented if the report contains no time designation values, or if a time designation value points to the future.
de: Caching wird automatisch verhindert, wenn die Statistik keinerlei Zeitangaben enthält (es kommen laufend neue Daten hinzu) oder wenn eine Zeitangabe in der Zukunft liegt.

source: If a cached report is edited, all cached data is deleted.
de: Sollte eine Statistik zwischenzeitlich wieder bearbeitet werden, werden alle gecachten Daten wieder gelöscht.

source: <emphasis>Valid</emphasis>. This can be set to "invalid" if a pre-configured report must not be run temporarily for any reason. The "Start" button in the bottom of the right panel is then no longer displayed. The report can no longer be generated.
de: <emphasis>Gültig</emphasis>. Ist eine vorkonfigurierte Statistik erst im Entstehen oder darf sie aus bestimmten Gründen temporär nicht mehr ausgeführt werden so wird das Element "Gültig" auf "ungültig" gesetzt. Ferner wird dadurch die Schaltfläche "Start" rechts unten am Ende des Block ausgeblendet. Ein Generieren der Statistik ist somit nicht möglich.

source: <emphasis>Definition of the element for the X-axis</emphasis>. It is the configuration of the element used for the depiction of the X-axis or, if tables are used, of the column name applied to the X-axis (see Figure 19.6).
de: <emphasis>Definition des Elements für die X-Achse</emphasis>. Hier wird eingestellt welches Element für die Darstellung der X-Achse verwendet wird, bzw. bei Tabellen, welche Spaltenbezeichnung die Statistik bekommt.

source: <emphasis>Figure 19.6. Definition of the element for the X-axis.</emphasis>
de: <emphasis>Abb. 19.6. Definition des Elements für die X-Achse.</emphasis>

source: First of all, an element is selected using the option field. Then two or more attributes of the element must be selected. If no attributes are selected, all attributes are used including those added after the configuration of the report.
de: Als erstes wählt man ein Element per Optionsfeld aus. Anschließend müssen zwei oder mehr Attribute des Elements selektiert werden. Werden keine Attribute des Elements ausgewählt, werden alle Attribute verwendet, auch solche die nach der Konfiguration der Statistik hinzukommen.

source: If the "Fixed" setting is disabled, the agent generating the report can change the attributes of the respective element in the "View" user interface.
de: Entfernt man den Haken "Fixiert" in der Checkbox, kann der Agent, der die Statistik erstellt, die Attribute des entsprechenden Elements in der "Ansehen"-Oberfläche verändern.

source: Time elements are different as time period and scale have to be stated. Type and number of elements result from the used dynamic object and vary depending on it.
de: Eine Besonderheit stellen Zeitelemente dar, hier ist die Zeitspanne und die Skalierung anzugeben. Die Art und Anzahl der Elemente ergibt sich durch das verwendete dynamische Objekt und ist von Objekt zu Objekt verschieden.

source: If all input is correct, the "Next" button leads to the "Value series" form. It is also possible to go back to editing earlier sections.
de: Wurden alle Eingaben richtig getätigt, gelangt man nach der Auswahl des "Weiter" Schalters zu dem Formular "Wertereihen". Ebenfalls gibt es die Möglichkeit, einen Bearbeitungsschritt zurück zu gehen und nochmals die Oberfläche "Allgemeine Angaben" zu bearbeiten.

source: <emphasis>Specification of the value series</emphasis>.
de: <emphasis>Wertereihen</emphasis>.

source: In the third step of the report configuration, the value series are defined (see Figure 19.7 below). They will later form the individual graphs or the various series within a tabular view.
de: Im dritten Schritt der Vorkonfiguration einer Statistik werden die Wertereihen der Statistik festgelegt. Sie bilden später die einzelnen Grafen des Diagramms (grafische Darstellung) oder die einzelnen Reihen (tabellarische Darstellung).

source: Definition of the value series
de: Festlegen der Wertereihen

source: <emphasis>Figure 19.7. Definition of the value series.</emphasis>
de: <emphasis>Abb. 19.7. Festlegen der Wertereihen.</emphasis>

source: If an element is selected, each chosen attribute will correspond to a value series (see the Example 19-1 below).
de: Wird ein Element selektiert, entspricht jedes ausgewählte Attribut einer Wertereihe.

source: Definition of a value series - one element
de: Festlegen einer Wertereihe bei einem Element

source: Value series 1 = Raw
de: Wertereihe 1 = Raw

source: Value series 2 = Junk
de: Wertereihe 2 = Junk

source: If two elements are selected, each selected attribute of the first element is combined with an attribute of the second element to form a value series (see Example 19-2 below).
de: Werden zwei Elemente selektiert, wird jedes ausgewählte Attribut des ersten Elements kombiniert mit einem Attribut des zweiten Elements zu einer Wertereihe.

source: Definition of a value series - two elements
de: Festlegen einer Wertereihe bei zwei Elementen

source: Value chain 1 = Raw - open
de: Wertereihe 1 = Raw - offen

source: Value series 2 = Raw - successfully closed
de: Wertereihe 2 = Raw - erfolgreich geschlossen

source: Value series 3 = Junk - open
de: Wertereihe 3 = Junk - offen

source: Value series 4 = Junk - successfully closed
de: Wertereihe 4 = Junk - erfolgreich geschlossen

source: Selection of three or more elements is not allowed.
de: Die Auswahl von drei oder mehr Elementen ist nicht sinnvoll und wird deshalb durch eine Fehlermeldung verhindert.

source: Additionally the same conditions apply to the selection of the attributes and the "Fixed" checkbox as to the "X-axis" selection:
de: Ferner gelten noch die gleichen Bedingungen zur Auswahl der Attribute und zur "Fixiert" Checkbox wie bei der "X-Achsen" Auswahl.

source: If no attributes of the element are selected, all attributes are used, including those added after the configuration of the report.
de: Werden keine Attribute des Elements ausgewählt, werden alle Attribute verwendet, auch solche die nach der Konfiguration der Statistik hinzukommen.

source: If the "Fixed" setting is disabled, the agent generating the report can change the attributes of the respective element.
de: Entfernt man den Haken "Fixiert" in der Checkbox, kann der Agent der die Statistik erstellt, die Attribute des entsprechenden Elements verändern.

source: <emphasis>Setting restrictions to the report</emphasis>. This is the fourth and final step of the configuration (see Figure 19.8 below). The restrictions serve to limit the results to the selected criteria. In many cases, no restrictions at all may be set up.
de: <emphasis>Festlegen der Einschränkungen</emphasis>. Vierter und letzter Schritt bei der Vorkonfiguration ist das Festlegen der Einschränkungen. Hier ist es möglich die Ergebnisse einer Statistik durch die Angabe von Bedingungen einzuschränken. Vergleichbar ist dies mit Eingaben in eine Such-Oberfläche.

source: Definition of restrictions
de: Festlegen der Einschränkungen

source: <emphasis>Figure 19.8. Definition of restrictions.</emphasis>
de: <emphasis>Abb. 19.8. Festlegen der Einschränkungen.</emphasis>

source: After all the restrictions are set up, the configuration of the report is completed by pressing the "Finish" button.
de: Nachdem man alle Einschränkungen getätigt hat, drückt man den Button "Abschließen". Dadurch beendet man die Vorkonfiguration der Statistik und gelangt in die "Ansehen" Oberfläche.

source: Import
de: Importieren

source: The Import user interface (see Figure 19.9 below) can be accessed by choosing from the navigation bar, the link "Statistics", then "Import". Alternately, pressing the Import button on the Overview screen achieves the same result. "rw" rights to the report are required.
de: Durch die Auswahl des "Import"-Menüpunkts im Statistikmenü der Navigationsleiste oder durch den "Import"-Knopf in der Übersichtsmaske gelangt man in die Importoberfläche ("rw"-Rechte erforderlich).

source: The Import user interface
de: Die Import-Oberfläche

source: <emphasis>Figure 19.9. The Import user interface.</emphasis>
de: <emphasis>Abb. 19.9. Die Import-Oberfläche.</emphasis>

source: Facilitates the import of reports and is, when combined with the export function of the module, a very handy functionality. Stats can be created and tested conveniently on test systems, then imported into the production system.
de: Durch sie können Statistiken importiert werden. Dies ist im Zusammenhang mit der Exportfunktion des Moduls eine sehr hilfreiche Funktionalität. So können Statistiken bequem auf Testsystemen entworfen und getestet werden, um sie später auf dem Produktivsystem zu importieren.

source: The import is effected by an easy file upload. The "View" user interface of the imported report is opened automatically afterwards.
de: Der Import geschieht dabei ganz einfach durch einen Dateiupload. Anschließend gelangt man automatisch in die Detailansicht der importierten Statistik.

source: Administration of the stats module by the OTRS administrator
de: Verwaltung des Statistik-Moduls durch den OTRS-Administrator

source: This section provides information about the tasks and responsibilities of the OTRS administrator dealing with the statistics module.
de: In diesem Abschnitt werden die Aufgaben und Möglichkeiten des OTRS-Administrators in Bezug auf das Statistikmodul angesprochen.

source: Permission settings, Groups and Queues
de: Rechte, Gruppen und Queues

source: No new queues and/or groups are created when the stats module is installed.
de: Durch die Installation des Statistikmoduls werden keine neuen Queues oder/und Gruppen angelegt.

source: The default configuration of the module registration gives all agents with "stats" group permissions access to the stats module.
de: Durch die Standardkonfiguration der Modulregistrierung haben alle Agenten, die Rechte in der "stats"-Gruppe haben, Zugriff auf das Statistikmodul.

source: Access according to permission settings:
de: Zugangsmöglichkeiten aufgrund der Rechte:

source: <emphasis>rw</emphasis>. Allows configuring statistics and reports.
de: <emphasis>rw</emphasis>. Darf Statistiken konfigurieren.

source: <emphasis>ro</emphasis>. Permits generating pre-configured statistics and reports.
de: <emphasis>ro</emphasis>. Darf vorkonfigurierte Statistiken generieren.

source: The OTRS administrator decides whether agents with the permission to generate pre-configured reports are allocated ro rights in the "stats" group, or if their respective groups are added in the module registration in SysConfig.
de: Ob nun dem jeweiligen Agenten, der später vorkonfigurierte Statistiken generieren darf, ro-Rechte in der "stats" Gruppe zugewiesen werden oder in der Modulregistrierung der SysConfig die dem Agent entsprechenden Gruppen ergänzt werden, bleibt dem OTRS-Administrator und dessen Anforderungen überlassen.

source: The SysConfig groups <link linkend="Framework:Core::Stats">Framework:Core::Stats</link>, <link linkend="Framework:Core::Stats::Graph">Framework:Core::Stats::Graph</link> and <link linkend="Framework:Frontend::Agent::Stats">Framework:Frontend::Agent::Stats</link> contain all configuration parameters for the basic set-up of the statistics module. Moreover, the configuration parameter <link linkend="Framework:Frontend::Agent::ModuleRegistration:Frontend::Module_AgentStats">$Self-&gt;{'Frontend::Module'}-&gt;{'AgentStats'}</link> controls the arrangement and registration of the modules and icons within the statistics module.
de: Die SysConfig-Gruppen <link linkend="Framework:Core::Stats">Framework:Core::Stats</link>, <link linkend="Framework:Core::Stats::Graph">Framework:Core::Stats::Graph</link> und <link linkend="Framework:Frontend::Agent::Stats">Framework:Frontend::Agent::Stats</link> enthalten alle Konfigurationsparameter zur grundlegenden Einstellung des Statistik-Moduls. Weiterhin regelt der Konfigurationsparameter <link linkend="Framework:Frontend::Agent::ModuleRegistration:Frontend::Module_AgentStats">$Self-&gt;{'Frontend::Module'}-&gt;{'AgentStats'}</link>die Anordnung und Registrierung der Module und Icons innerhalb des Statistik-Moduls selbst.

source: Administration of the stats module by the system administrator
de: Verwaltung des Statistik-Moduls durch den System-Administrator

source: Generally, no system administrator is needed for the operation, configuration and maintenance of the statistics module. However, a little background information for the system administrator is given at this point.
de: Grundsätzlich ist bei der Bedienung, Konfiguration und Wartung des Statistikmoduls kein System-Administrator notwendig. An dieser Stelle sollen nur einige Hintergrundinformationen für den System-Administrator gegeben werden.

source: File paths refer to subdirectories of the OTRS home directory (in most cases<filename>/opt/otrs</filename>).
de: Pfadangaben beziehen sich auf Unterverzeichnisse des OTRS-Homeverzeichnisses (meist <filename>/opt/otrs</filename>).

source: Data base table
de: Datenbanktabelle

source: All report configurations are implemented and administrated in XML, and therefore stored in the database table "xml_storage". Other modules whose content is presented in xml format use this table as well.
de: Alle Statistikkonfigurationen werden in XML umgesetzt und verwaltet. Dies bedeutet unter anderem, dass alle Statistikkonfigurationen in der Datenbanktabelle "xml_storage" gespeichert werden. Diese Tabelle wird auch von anderen Modulen benutzt, deren Inhalte im XML-Format dargestellt werden.

source: List of all files
de: Auflistung aller Dateien

source: The following files are necessary for the stats module to work accurately:
de: Folgende Dateien sind für die fehlerfreie Funktion des Statistikmoduls notwendig.

source: Whether the results of a statistic are to be cached or not can be setup in the configuration. Cached report results are stored as files in the <filename>var/tmp</filename>directory of the OTRS installation (in most cases <filename>/opt/otrs/var/tmp</filename>).
de: Bei der Vorkonfiguration von Statistiken kann eingestellt werden, ob die Ergebnisse einer Statistik gecachet werden oder nicht. Statistikergebnisse, die in den Cache geschrieben werden sollen, werden als Datei im Verzeichnis <filename>var/tmp</filename> der OTRS-Installation gespeichert (meist <filename>/opt/otrs/var/tmp</filename>).

source: Cached stats can be recognized by the "Stats" prefix.
de: Alle gecacheten Statistiken sind dabei durch das Präfix "Stats" zu erkennen.

source: If the data is lost, no major damage is caused. The next time the report is called up, the stats module will not find the file any more and so will generate a new report. Of course this will probably take a little longer to run.
de: Sollten diese Dateien verloren gehen, ist dies nicht weiter schlimm. Beim nächsten Aufruf dieser Statistik kann das Statistikmodul diese Datei nicht mehr finden und muss deshalb die Statistik neu errechnen, was etwas Zeit beanspruchen kann.
