Repository: xhoy/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: de

source: With the configuration parameter <link linkend="Ticket:Core::Ticket:Ticket::Responsible">Ticket::Responsible</link>, the ticket responsibility feature can be activated. This will cause 3 new links to appear in the ticket activities menu of a zoomed ticket in the agent interface.
de: Mit dem Konfigurationsparameter <link linkend="Ticket:Core::Ticket:Ticket::Responsible" > Ticket::Responsible </link> kann die Funktion TicketResponsible aktiviert werden. Dadurch werden drei neue Icons in ihrer Toolbar erscheinen.

source: Ticket responsibility can be assigned by calling up the ticket content and clicking on the "Responsible" link in the ticket activities menu of a zoomed ticket in the agent interface (see the Figure 9.1 below).
de: Die Ticketverantwortung kann übergeben werden, indem das Ticket aufgerufen und die Funktion "Verantwortlicher" in der Aktionsleiste genutzt wird.

source: Responsible link on ticket zoom
de: Verantwortlicher-Link in der Ticketansicht

source: <emphasis>Figure 9.1. Changing the Responsibility of a ticket in its zoomed view.</emphasis>
de: <emphasis>Abb. 9.1. Verantwortlichen eines Tickets ändern.</emphasis>

source: After clicking on "Responsible", a pop-up dialog to change the responsibility of that ticket will open (see Figure 9.2 below). This dialog can also be used to send a message to the new responsible agent.
de: Nach dem Klick auf "Verantwortlicher" öffnet sich ein Popup-Fenster, in dem die Änderung durchgeführt werden kann. Damit kann auch dem neuen verantwortlichen Benutzer eine Nachricht geschickt werden.

source: Ticket Responsibility Pop-up Dialog
de: Dialog Ticket-Verantwortlicher

source: <emphasis>Figure 9.2. Pop-up dialog to change a ticket's responsibility.</emphasis>
de: <emphasis>Abb. 9.2. Popup-Dialog zum Ändern des Ticket-Verantwortlichen.</emphasis>

source: The list of all tickets for which an agent is responsible, can be accessed through the Responsible view of the OTRS agent interface, as soon as the ticket responsibility feature gets activated.
de: Die Liste aller Tickets, für die ein Benutzer verantwortlich ist, kann durch die Ansicht "Verantwortliche Tickets" eingesehen werden. Diese kann über 3 Icons in der Toolbar aufgerufen werden, sobald das TicketResponsible-Feature aktiviert wird.

source: Ticket watching
de: Tickets beobachten

source: From OTRS 2.1 on, select agents such as supervisors can watch certain tickets within the system without processing them, by using the TicketWatcher feature.
de: Sollen innerhalb des Ticket-Systems lediglich bestimmte Tickets z. B. von einem Abteilungsleiter beobachtet und nicht selbst bearbeitet werden, so kann dies seit OTRS 2.1 mit Hilfe des TicketWatcher-Features realisiert werden.

source: The TicketWatcher feature can be activated with the configuration parameter <link linkend="Ticket:Core::TicketWatcher:Ticket::Watcher">Ticket::Watcher</link> which adds new links to your actions toolbar. Using <link linkend="Ticket:Core::TicketWatcher:Ticket::WatcherGroup">Ticket::WatcherGroup</link>, one or more user groups with permission to watch tickets can also be defined.
de: Das TicketWatcher-Feature kann mit Hilfe des Konfigurations-Parameters <link linkend="Ticket:Core::TicketWatcher:Ticket::Watcher">Ticket::Watcher</link> aktiviert werden. Weiterhin können über <link linkend="Ticket:Core::TicketWatcher:Ticket::WatcherGroup">Ticket::WatcherGroup</link> eine oder mehrere Benutzergruppen festgelegt werden, die die Erlaubnis haben sollen Tickets zu beobachten.

source: In order to watch a ticket, go to its zoomed view and click on the "Subscribe" link in the ticket activities menu (see Figure 9.3 below).
de: Um ein Ticket zu beobachten, muss der Inhalt des Tickets aufgerufen und im Menü für die verschiedenen Aktionen für das Ticket der "Beobachten"-Schalter betätigt werden.

source: Subscribe link on ticket zoom
de: Abonnieren-Link in der Ticketansicht

source: <emphasis>Figure 9.3. Subscribing to watching a ticket in its zoomed view.</emphasis>
de: <emphasis>Abb. 9.3. Ticket beobachten.</emphasis>

source: If you no longer want to watch a specific ticket, go to its zoomed view and click on the "Unsubscribe" link in the ticket activities menu (see Figure 9.4 below).
de: Die Beobachtung eines Tickets wird aufgehoben, indem in der Inhaltsanzeige eines Tickets im Menü für die möglichen Aktionen der "Nicht beobachten"-Schalter gedrückt wird.

source: Unsubscribe link on ticket zoom
de: Link "Abonnement kündigen" in der Ticketansicht

source: <emphasis>Figure 9.4. Unsubscribing from watching a ticket in its zoomed view.</emphasis>
de: <emphasis>Abb. 9.4. Ticket nicht mehr beobachten.</emphasis>

source: The list of all watched tickets can be accessed through the Watched view of the OTRS agent interface (see Figure 9.5 below), as soon as the ticket watcher feature gets activated.
de: Die Liste aller zur Beobachtung ausgewählten Tickets wird über die Ansicht "Beobachtete Tickets" erreicht. Diese kann über 3 Icons in der Toolbar aufgerufen werden, sobald das TicketWatcher-Feature aktiviert wird.

source: Mailbox: Watched tickets
de: Mailbox: Beobachtete Tickets

source: <emphasis>Figure 9.5. Watched tickets view.</emphasis>
de: <emphasis>Abb. 9.5. Ansicht "Beobachtete Tickets".</emphasis>

source: Customize the PDF output
de: Einrichtung der PDF-Ausgabe

source: This section handles the configurable options for PDF output in OTRS.
de: Dieser Abschnitt behandelt die Einstellungen für die PDF-Druckausgabe von OTRS.

source: If you use the Print action from anywhere within the OTRS interface, this generates a formatted PDF file. You can deactivate this by modifying the configuration parameter <link linkend="Framework:Core::PDF:PDF">PDF</link> to create HTML output instead.
de: Wenn sie die Aktion "Drucken" in OTRS verwenden, wird eine formatierte PDF-Datei erzeugt. Sie können dies mit dem Konfigurationsparameter <link linkend="Framework:Core::PDF:PDF"> PDF </link> deaktivieren. In diesem Fall wird stattdessen eine HTML-Ausgabe erzeugt.

source: You can adjust the look of the files generated by OTRS by creating your own logo and adding it to <link linkend="Framework:Core::PDF:PDF::LogoFile">PDF::LogoFile</link>. You can use <link linkend="Framework:Core::PDF:PDF::PageSize">PDF::PageSize</link> to define the standard page size of the generated pdf file (DIN-A4 or Letter), and also <link linkend="Framework:Core::PDF:PDF::MaxPages">PDF::MaxPage</link> to specify the maximum number of pages for a pdf file, which is useful if a user generates a huge output file by mistake.
de: Sie können das Erscheinungsbild der generierten Dateien anpassen, indem Sie ihr eigenes Logo in <link linkend="Framework:Core::PDF:PDF::LogoFile">PDF::LogoFile</link> hinterlegen. Mit <link linkend="Framework:Core::PDF:PDF::PageSize">PDF::PageSize</link> lässt sich die Standard-Seitengröße der PDF-Datei einstellen. Schließlich kann mit <link linkend="Framework:Core::PDF:PDF::MaxPages">PDF::MaxPages</link> die maximale Anzahl an Seiten festgelegt werden, die eine PDF-Datei höchstens beinhalten soll. Das ist nützlich, um versehentliches Drucken überlanger Dokumente zu verhindern.

source: The Perl CPAN modules PDF::API2 and Compress::Zlib must be installed for the generation of pdf files. In many distributions they are available as packages and can be easily installed, using the respective package manager. In case this is not possible, they have to be installed with CPAN. For further information about installing Perl modules, please refer to the <link linkend="installation-of-perl-modules">"Installation of Perl modules"</link> section.
de: Für die Generierung von PDF-Dateien müssen die CPAN-Module PDF::API2 und Compress::Zlib installiert werden. Bei vielen Distributionen sind diese als Paket verfügbar und können bequem über den jeweiligen Paketmanager installiert werden, falls dies jedoch nicht möglich ist muss der direkte Weg über CPAN gewählt werden. Das Kapitel <link linkend="installation-of-perl-modules">Installation der für OTRS benötigten Perl-Module</link> beschreibt, wie die Installation der Perl-Module durchzuführen ist.

source: Using external backends
de: Einbinden externer Backends

source: Customer data
de: Kundenbenutzerdaten

source: OTRS works with many customer data attributes such as username, email address, phone number, etc. These attributes are displayed in both the Agent and the Customer frontends, and also used for the authentication of customers.
de: OTRS ist in der Lage, mit verschiedenen Kundendaten (insbesondere Login, E-Mail, Telefon) umzugehen. Diese Informationen können im Agenten-Interface angezeigt und für das Kunden-Interface verwendet werden. Weiterhin werden die Daten für die Authentifizierung der Kunden am System benötigt.

source: Customer data used or displayed within OTRS is highly customizable. The following information is however always needed for customer authentication:
de: Die benutzten/angezeigten Kundendaten sind frei konfigurierbar, es gibt jedoch folgende benötigte Optionen die unbedingt vorhanden sein müssen, damit OTRS ordnungsgemäß funktioniert:

source: User login
de: Benutzer-Login

source: Email address
de: E-Mail-Adresse

source: Customer ID
de: Benutzer-Kunden-ID

source: Use configuration parameters of Script 11.1 in your <filename>Kernel/Config.pm</filename> file, if you want to display customer information in your agent interface.
de: Verwenden Sie die Konfigurationsparameter aus Skript 11.1 in Ihrer Datei <filename>Kernel/Config.pm</filename>, wenn Sie Kundeninformationen anzeigen möchten.

source: <emphasis>Script 11.1. Kernel/Config.pm configuration parameters.</emphasis>
de: <emphasis>Skript 11.1. Konfigurationsparameter in Kernel/Config.pm.</emphasis>

source: Customer user backend
de: Kundenbenutzer Backend

source: You can use two types of customer backends, DB and LDAP. If you already have another customer backend (e.g. SAP), it is of course possible to write a module that uses it.
de: Es existieren zwei Kundenbenutzer Back-ends, DB und LDAP. Falls Sie bereits ein Kundenverzeichnis (z. B. SAP, ...) haben, ist es natürlich möglich, dafür ein eigenes Back-end zu schreiben.

source: Database (Default)
de: Datenbank (Standard)

source: Example 11-1 shows the configuration of a DB customer backend, which uses customer data stored in the OTRS database.
de: Beispiel 11-1 zeigt die Konfiguration eines Kundenbenutzer-Backends, welches die Kundendaten in der OTRS-Datenbank speichert.

source: Configuring a DB customer backend
de: Konfiguration eines Datenbank-Kunden-Backends

source: If you want to customize the customer data, change the column's headers or add new ones to the customer_user table in the OTRS database. As an example, Script 11.2 shows how to add a new field for room number.
de: Falls Sie die Kundendaten anpassen möchten, ändern Sie in der Datenbank die Tabellenspalten oder fügen Sie weitere hinzu (im folgenden Beispiel wird ein Feld für die Raumnummer hinzugefügt).

source: <emphasis>Script 11.2. Adding a room field to the customer_user table.</emphasis>
de: <emphasis>Skript 11.1. Ein Feld zur Tabelle customer_user hinzufügen.</emphasis>

source: Now add the new column to the MAP array in <filename>Kernel/Config.pm</filename>, as shown in Script 11.3.
de: Danach fügen Sie Ihre eigenen Spalten dem MAP Array in der Datei <filename>Kernel/Config.pm</filename> hinzu:

source: <emphasis>Script 11.3. Adding a room field to the Kernel/Config.pm file.</emphasis>
de: <emphasis>Skript 11.3. Hinzufügen eines Feldes in Kernel/Config.pm file.</emphasis>

source: It is also possible to edit all this customer information via the Customers link in the Agent interface.
de: Natürlich können Sie all diese Kundeninformationen dann auch über das Admin-Interface bzw. die Kundenverwaltung pflegen.

source: Customer with multiple IDs (Company tickets)
de: Kunden mit multiplen IDs (Firmen-Tickets)

source: It is possible to assign more than one customer ID to a customer. This can be useful if a customer must access tickets of other customers, e.g. a supervisor wants to watch the tickets of his assistants. If a customer can access the tickets of another customer, the company ticket feature of OTRS is used. Company tickets can be accessed via the "Company Tickets" link in the customer panel.
de: Es ist möglich, einem Kunden mehr als nur eine Kundennummer zuzuweisen. Dies kann z. B. dann sinnvoll sein, wenn ein Kunde auf Tickets anderer Kunden zugreifen muss, z. B. der Abteilungsleiter auf die Tickets der Mitarbeiter seiner Abteilung. Hat ein Kunde Zugriff auf Tickets anderer Kunden, verwendet man in OTRS das sog. Firmen Ticket Feature. Im Kunden-Interface können diese Tickets über den "Firmen-Ticket" Link eingesehen werden.

source: To use company tickets, a new column with the IDs that should be accessible for a customer, has to be added to the customer_user table in the OTRS database (see Script 11.4 below).
de: Um Firmen-Tickets zu verwenden, muss die customer_user Tabelle in der OTRS Datenbank um eine Spalte erweitert werden, in die später die Kundennummern eingetragen werden, auf die ein Kunde zusätzlich zu den eigenen Tickets Zugriff haben soll.

source: <emphasis>Script 11.4. Adding a customer_ids field to the customer_user table.</emphasis>
de: <emphasis>Skript 11.4. Hinzufügen eines Feldes customer_ids zur Tabelle customer_user.</emphasis>

source: Now the new column has to be added to the MAP array in <filename>Kernel/Config.pm</filename>, as shown in Script 11.5.
de: Danach fügen Sie die neue Spalte dem MAP Array in der Datei <filename>Kernel/Config.pm</filename> hinzu.

source: <emphasis>Script 11.5. Adding a UserCustomerIDs field to the Kernel/Config.pm file.</emphasis>
de: <emphasis>Skript 11.5. Hinzufügen des Feldes UserCustomerIDs zu Kernel/Config.pm.</emphasis>

source: Now, the new column for the multiple customer IDs can be edited via the Agent interface, in the section for the customer management.
de: Die Spalte für die Multi-Kundennummern kann ab nun über das Admin-Interface bzw. über die Kundenverwaltung gepflegt werden.

source: To ensure that one customer can access the tickets of other customers, add the IDs of these other users into the new field for the multiple customer IDs. Each ID has to be separated by a semicolon (see Example 11-2 below).
de: Um nun den Zugriff für einen Kunden auf die Tickets anderer Kunden zu ermöglichen, tragen Sie in die neue Spalte die IDs der Kunden ein, auf deren Tickets der Zugriff ermöglicht werden soll. Die einzelnen IDs trennen Sie durch ein Semikolon.

source: Using company tickets with a DB backend
de: Firmen-Tickets mit einem Datenbank-Backend

source: The customers A, B and C exist in your system, and A wants to have access to the tickets of B and C via the customer panel. B and C should have no access to the tickets of other users.
de: Angenommen es sind die Kunden A, B und C im System angelegt. A soll mit Hilfe von Firmen Tickets über das Kunden-Interface Zugriff auf die Tickets von B und C haben, B und C sollen jedoch jeweils nur ihre eigenen Tickets einsehen und bearbeiten können.

source: To realize this setup, change the customer_user table and the mapping in <filename>Kernel/Config.pm</filename> as described above. Then load the settings for customer A via the Customers link in the Agent interface or via the Admin page. If the settings are displayed, add into the field for CustomerIDs the values "B;C;".
de: Um dieses Setup zu realisieren, ändern Sie wie oben beschrieben die customer_user Tabelle in der OTRS Datenbank und das Mapping in<filename>Kernel/Config.pm</filename>. Anschließend laden Sie über die Kundenverwaltung die Einstellungen des Kunden A und tragen bei "Kundennummern" die Werte "B;C;" ein.

source: If you have a LDAP directory with your customer data, you can use it as the customer backend with OTRS, as shown in Example 11-3.
de: Falls Sie ein existierendes LDAP Verzeichnis mit Ihren Kundenbenutzern haben, können Sie dieses auch mit OTRS nutzen.

source: Configuring an LDAP customer backend
de: Konfiguration eines LDAP Kunden-Backends

source: If additional customer attributes are stored in your LDAP directory, such as a manager's name, a mobile phone number, or a department, and if you want to display this information in OTRS, just expand the MAP array in <filename>Kernel/Config.pm</filename> with the entries for these attributes, as shown in Script 11.6.
de: Falls Sie in Ihrem LDAP Verzeichnis weitere Informationen zu Ihren Kunden gespeichert haben und mit OTRS darauf zugreifen möchten, erweitern Sie das MAP Array in <filename>Kernel/Config.pm</filename> bzw. entfernen nicht gewünschte Einträge.

source: <emphasis>Script 11.6. Adding new fields to the Kernel/Config.pm file.</emphasis>
de: <emphasis>Skript 11.6. Hinzufügen neuer Felder zu Kernel/Config.pm.</emphasis>

source: It is possible to assign more than one Customer ID to a customer, when using an LDAP backend. To use company tickets, a new field has to be added to the LDAP directory that contains the IDs accessible by the customer.
de: Um Firmentickets mit einem LDAP zu nutzen, muss ein Feld zum LDAP-Verzeichnis hinzugefügt werden, welches die IDs enthält, die für einen Kunden zugänglich sein sollen.

source: If the new field in the LDAP directory has been created, the new entry has to be added to the MAP array in <filename>Kernel/Config.pm</filename>, as shown in Script 11.7.
de: Wenn das neue Feld erstellt wurde, muss es zum MAP Array in <filename>Kernel/Config.pm</filename> hinzugefügt werden.

source: <emphasis>Script 11.7. Maping new fields to the Kernel/Config.pm file.</emphasis>
de: <emphasis>Skript 11.7. Hinzufügen eines neuen Feldes in Kernel/Config.pm.</emphasis>

source: The field for the multiple customer IDs has to be edited directly in the LDAP directory. OTRS can only read from LDAP, not write to it.
de: Das Feld muss direkt im LDAP-Verzeichnis bearbeitet werden, weil OTRS von LDAP nur lesen kann, nicht jedoch darauf schreiben.

source: To ensure access by a customer to the tickets of other customers, add the customer IDs of the customers whose tickets should be accessed to the new field in your LDAP directory. Each ID has to be separated by a semicolon (see Example 11-4 below).
de: Um nun den Zugriff für einen Kunden auf die Tickets anderer Kunden zu ermöglichen, tragen Sie in das neue LDAP-Feld die IDs der Kunden ein, auf deren Tickets der Zugriff ermöglicht werden soll. Die einzelnen IDs trennen Sie durch ein Semikolon.

source: Using Company tickets with an LDAP backend
de: Verwendung von Firmentickets mit einem LDAP-Backend

source: The customers A, B and C exist in your system and A wants to have access to the tickets of B and C via the customer panel. B and C should have no access to tickets of other users.
de: Angenommen es sind die Kunden A, B und C im System angelegt. A soll mit Hilfe von Firmen Tickets über das Kunden-Interface Zugriff auf die Tickets von B und C haben, B und C sollen jedoch jeweils nur ihre eigenen Tickets einsehen und bearbeiten können.

source: To realize this setup, change the LDAP directory and the mapping in <filename>Kernel/Config.pm</filename> as described above. Then add into the field for CustomerIDs the values "B;C;" for customer A in your LDAP directory.
de: Um dieses Setup zu realisieren, ändern Sie wie oben beschrieben das LDAP Verzeichnis und das Mapping in <filename>Kernel/Config.pm</filename>. Anschließend tragen Sie im LDAP Verzeichnis innerhalb der Einstellungen für den Kunden A für CustomerIDs die Werte "B;C;" ein.

source: Use more than one customer backend with OTRS
de: Verwenden mehrerer Kunden Backends

source: If you want to utilize more than one customer data source used with OTRS (e.g. an LDAP and a database backend), the CustomerUser config parameter should be expanded with a number, e.g. "CustomerUser1", "CustomerUser2" (see Example 11-5 below).
de: Soll mehr als nur ein Back-end mit verschiedenen Kundendaten verwendet werden (z. B. gleichzeitig DB und LDAP), so ist dies ebenfalls mit OTRS möglich. In einem solchen Fall muss der CustomerUser Parameter für jedes Back-end um eine Nummer erweitert werden, z. B. "CustomerUser1", "CustomerUser2", usw.

source: Using more than one customer backend with OTRS
de: Gleichzeitige Einbindung mehrerer verschiedener Kunden Backends

source: The following configuration example shows usage of both an LDAP and a database customer backend with OTRS.
de: In der folgenden KOnfiguration verwendet OTRS gleichzeitig ein Datenbank- und ein LDAP-Kunden-Backend.

source: It is possible to integrate up to 10 different customer backends. Use the customer management interface in OTRS to view or edit (assuming write access is enabled) all customer data.
de: Es können bis zu 10 Kunden Back-ends gleichzeitig eingebunden werden. Über die Kundenverwaltung in OTRS ist der Zugriff auf die verschiedenen Back-ends möglich.

source: Backends to authenticate Agents and Customers
de: Backends für die Authentifizierung von Agenten und Kunden

source: OTRS offers the option to authenticate agents and customers against different backends.
de: OTRS bietet die Möglichkeit Agenten und Kunden über verschiedene Back-ends zu authentifizieren.

source: Authentication backends for Agents
de: Authentifizierungs-Backends für Agenten

source: DB (Default)
de: Datenbank (Standard)

source: The backend to authenticate agents which is used by default is the OTRS database. Agents can be added and edited via the <link linkend="adminarea-agents">agent management interface</link> in the <link linkend="adminarea">Admin page</link> (see Example 11-6 below).
de: Das Backend für die Authentifizierung von Agenten, welches OTRS standardmäßig verwendet, ist die OTRS-Datenbank. Die Agenten können innerhalb des <link linkend="adminarea">Admin-Bereiches</link> in der <link linkend="adminarea-agents">Benutzerverwaltung</link> angelegt und bearbeitet werden.

source: Authenticate agents against a DB backend
de: Agentenauthentifizierung gegen ein Datenbank-Backend

source: If an LDAP directory has all your agent data stored, you can use the LDAP module to authenticate your users in OTRS (see Example 11-7 below). This module has only read access to the LDAP tree, which means that you cannot edit your user data via the <link linkend='adminarea-agents'>agent management interface</link>.
de: Falls ein LDAP Verzeichnis mit Ihren Agenten-Benutzerdaten verfügbar ist, können Sie das LDAP Modul für die Authentifizierung Ihrer Agenten nutzen. Dieses Modul greift nur lesend auf die Daten im LDAP Verzeichnis zu, d.h. die Daten können nicht mit OTRS bearbeitet werden, es können also keine Agenten mit Hilfe der <link linkend='adminarea-agents'>Benutzerverwaltung</link> von OTRS angelegt oder bearbeitet werden.

source: Authenticate agents against an LDAP backend
de: Agentenauthentifizierung gegen ein LDAP Backend
