Repository: xhoy/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: de

source: <link linkend="Ticket:Frontend::Agent::Ticket::ViewForward:Ticket::Frontend::AgentTicketForward_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewForward &gt; StateDefault </link> - to define the default next state after forwarding a ticket.
de: <link linkend="Ticket:Frontend::Agent::Ticket::ViewForward:Ticket::Frontend::AgentTicketForward_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewForward &gt; StateDefault </link> - um den Standardstatus für das Weiterleiten von Tickets einzustellen.

source: <link linkend="Ticket:Frontend::Agent::Ticket::ViewForward:Ticket::Frontend::AgentTicketForward_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewForward &gt; StateType </link> - to define the available next states in the Forward screen.
de: <link linkend="Ticket:Frontend::Agent::Ticket::ViewForward:Ticket::Frontend::AgentTicketForward_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewForward &gt; StateType </link> - um die verfügbaren Status für das Weiterleiten von Tickets einzustellen.

source: <link linkend="Ticket:Frontend::Agent::Ticket::ViewFreeText:Ticket::Frontend::AgentTicketFreeText_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewForward &gt; StateDefault </link> - to define the default next state of a ticket in the free text screen.
de: <link linkend="Ticket:Frontend::Agent::Ticket::ViewFreeText:Ticket::Frontend::AgentTicketFreeText_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewForward &gt; StateDefault </link> - um den Standardstatus für das Bearbeiten der Freitextfelder festzulegen.

source: <link linkend="Ticket:Frontend::Agent::Ticket::ViewFreeText:Ticket::Frontend::AgentTicketFreeText_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewForward &gt; StateType </link> - to define the available next states in the free text screen.
de: <link linkend="Ticket:Frontend::Agent::Ticket::ViewFreeText:Ticket::Frontend::AgentTicketFreeText_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewForward &gt; StateType </link> - um die verfügbaren Status für das Bearbeiten der Freitextfelder festzulegen.

source: <link linkend="Ticket:Core::PostMaster:PostmasterDefaultState"> Ticket -&gt; Core::PostMaster &gt; PostmasterDefaultState </link> - to define the state of tickets created from emails.
de: <link linkend="Ticket:Core::PostMaster:PostmasterDefaultState"> Ticket -&gt; Core::PostMaster &gt; PostmasterDefaultState </link> - um den Status von Tickets festzulegen, die aus E-Mails neu erzeugt werden.

source: <link linkend="Ticket:Core::PostMaster:PostmasterFollowUpState"> Ticket -&gt; Core::PostMaster &gt; PostmasterFollowUpState </link> - to define the state of tickets after a follow-up has been received.
de: <link linkend="Ticket:Core::PostMaster:PostmasterFollowUpState"> Ticket -&gt; Core::PostMaster &gt; PostmasterFollowUpState </link> - um den Status von Tickets festzulegen, nachdem ein Followup eingegangen ist.

source: <link linkend="Ticket:Core::PostMaster:PostmasterFollowUpStateClosed"> Ticket -&gt; Core::PostMaster &gt; PostmasterFollowUpStateClosed </link> - to define the state of tickets after a follow-up has been received on an already closed ticket.
de: <link linkend="Ticket:Core::PostMaster:PostmasterFollowUpStateClosed"> Ticket -&gt; Core::PostMaster &gt; PostmasterFollowUpStateClosed </link> - um den Status von bereits geschlossenen Tickets festzulegen, nachdem ein Followup eingegangen ist.

source: <link linkend="Ticket:Core::Ticket:Ticket::ViewableStateType"> Ticket -&gt; Core::Ticket &gt; ViewableStateType </link> - to define the state types that are displayed at various places in the system, for example in the Queueview.
de: <link linkend="Ticket:Core::Ticket:Ticket::ViewableStateType"> Ticket -&gt; Core::Ticket &gt; ViewableStateType </link> - um die Ticketstatus festzulegen, die in verschiedenen Bereichen des Systems zur Anzeige kommen, z. B. in der Queue-Ansicht.

source: <link linkend="Ticket:Core::Ticket:Ticket::UnlockStateType"> Ticket -&gt; Core::Ticket &gt; UnlockStateType </link> - to define the state types for unlocked tickets.
de: <link linkend="Ticket:Core::Ticket:Ticket::UnlockStateType"> Ticket -&gt; Core::Ticket &gt; UnlockStateType </link> - um die verfügbaren Status für das Entsperren von Tickets einzustellen.

source: <link linkend="Ticket:Core::Ticket:Ticket::PendingReminderStateType"> Ticket -&gt; Core::Ticket &gt; PendingReminderStateType </link> - to define the state type for reminder tickets.
de: <link linkend="Ticket:Core::Ticket:Ticket::PendingReminderStateType"> Ticket -&gt; Core::Ticket &gt; PendingReminderStateType </link> - um die Status für Erinnerungstickets festzulegen.

source: <link linkend="Ticket:Core::Ticket:Ticket::PendingAutoStateType"> Ticket -&gt; Core::Ticket &gt; PendingAutoStateType </link> - to define the state type for Pending Auto tickets.
de: <link linkend="Ticket:Core::Ticket:Ticket::PendingAutoStateType"> Ticket -&gt; Core::Ticket &gt; PendingAutoStateType </link> - um die Status für Tickets mit "Warten auto" festzulegen.

source: <link linkend="Ticket:Core::Ticket:Ticket::StateAfterPending"> Ticket -> Core::Ticket > StateAfterPending </link> - to define the state a ticket is set to after the Pending Auto timer of the configured state has expired.
de: <link linkend="Ticket:Core::Ticket:Ticket::StateAfterPending"> Ticket -> Core::Ticket > StateAfterPending </link> - um den Status von Tickets mit "Warten auto" einzustellen, deren Wartezeit abgelaufen ist.

source: Modifying ticket priorities
de: Anpassen der Ticket-Prioritäten

source: OTRS comes with five default priority levels that can be modified via the "Priorities" link on the Admin page. When creating a customized list of priorities, please keep in mind that they are sorted alphabetically in the priority selection box in the user interface. Also, OTRS orders tickets by internal database IDs in the QueueView.
de: OTRS enthält 5 vordefinierte Ticketprioritäten, die mit dem "Prioritäten"-Modul im Administrationsbereich verwaltet werden können. Wenn Sie eine angepasste Prioritätenliste erstellen, bedenken Sie bitte, dass diese in der Prioritätsauswahl-Liste alphabetisch sortiert dargestellt werden. In der Queue-Ansicht ordnet OTRS die Prioritäten nach internen Datenbank-IDs.

source: As with other OTRS entities, priorities may not be deleted, only deactivated by setting the Valid option to <emphasis>invalid</emphasis> or <emphasis>invalid-temporarily</emphasis>.
de: In OTRS können Prioritäten deaktiviert, aber nicht gelöscht werden. Wenn Sie eine Priorität deaktivieren wollen, setzen Sie den Wert für "Gültig" auf "ungültig" oder "ungültig-temporär".

source: If a new priority was added or if an existing one was changed, you might also want to modify some values in SysConfig:
de: Wenn eine Priorität hinzugefügt oder geändert wurde, müssen Sie ggf. einige Werte in der SysConfig anpassen:

source: <link linkend="Ticket:Core::PostMaster:PostmasterDefaultPriority"> Ticket:Core::Postmaster::PostmasterDefaultPriority</link> - defines the default priority for all incoming emails.
de: <link linkend="Ticket:Core::PostMaster:PostmasterDefaultPriority"> Ticket:Core::Postmaster::PostmasterDefaultPriority</link> - definiert die Standardpriorität für einkommende E-Mails.

source: <link linkend="Ticket:Frontend::Agent::Ticket::ViewPhoneNew:Ticket::Frontend::AgentTicketPhone_Priority"> Ticket:Frontend::Agent:Ticket::ViewPhoneNew:Priority</link> - defines the default priority in the New Phone Ticket screen for agents.
de: <link linkend="Ticket:Frontend::Agent::Ticket::ViewPhoneNew:Ticket::Frontend::AgentTicketPhone_Priority"> Ticket:Frontend::Agent:Ticket::ViewPhoneNew:Priority</link> - definiert die Standardpriorität für neue Telefontickets im Agentenbereich.

source: <link linkend="Ticket:Frontend::Agent::Ticket::ViewEmailNew:Ticket::Frontend::AgentTicketEmail_Priority"> Ticket:Frontend::Agent:Ticket::ViewEmailNew:Priority</link> - defines the default priority in the New Email Ticket screen for agents.
de: <link linkend="Ticket:Frontend::Agent::Ticket::ViewEmailNew:Ticket::Frontend::AgentTicketEmail_Priority"> Ticket:Frontend::Agent:Ticket::ViewEmailNew:Priority</link> - definiert die Standardpriorität für neue E-Mail-Tickets im Agentenbereich.

source: <link linkend="Ticket:Frontend::Customer::Ticket::ViewNew:Ticket::Frontend::CustomerTicketMessage_PriorityDefault"> Ticket:Frontend::Customer:Ticket::ViewNew:PriorityDefault</link> - defines the default priority in the New Ticket screen in the Customer frontend.
de: <link linkend="Ticket:Frontend::Customer::Ticket::ViewNew:Ticket::Frontend::CustomerTicketMessage_PriorityDefault"> Ticket:Frontend::Customer:Ticket::ViewNew:PriorityDefault</link> - definiert die Standardpriorität für neue Tickets im Kundenbereich.

source: Creating your own themes
de: Erstellung eigener Themes

source: You can create your own themes so as to use the layout you like in the OTRS web frontend. To create own themes, you should customize the output templates to your needs.
de: Für OTRS können verschiedene Themes angelegt werden, also verschiedene Layouts zur Gestaltung der Web-Oberfläche. Dazu müssen Sie die vorhandenen Templates ändern und Ihren Wünschen entsprechend anpassen.

source: More information on the syntax and structure of output templates can be found in the Developer Manual at <ulink url="http://doc.otrs.org"><citetitle>http://doc.otrs.org</citetitle></ulink>, especialy in the chapter on <ulink url="http://doc.otrs.org/developer/3.0/en/html/hacking.html#TemplatingMechanism"><citetitle>templates</citetitle></ulink>.
de: Mehr Informationen über die Syntax und den Aufbau von Templates finden Sie im Entwickler-Handbuch auf <ulink url="http://doc.otrs.org"><citetitle>http://doc.otrs.org</citetitle></ulink> innerhalb des Kapitels zu den <ulink url="http://doc.otrs.org/developer/3.0/en/html/hacking.html#TemplatingMechanism"><citetitle>Templates</citetitle></ulink>.

source: As an example, perform the following steps to create a new theme called "Company":
de: Führen Sie beispielsweise folgende Schritte durch um ein neues Theme namens "Company" zu erstellen:

source: Create a directory called <filename>Kernel/Output/HTML/Company</filename> and copy all files that you like to change, from <filename>Kernel/Output/HTML/Standard</filename> into the new folder.
de: Erstellen Sie das Verzeichnis <filename>Kernel/Output/HTML/Company</filename> und kopieren Sie die Dateien, die Sie für das Company-Theme anpassen möchten, aus <filename>Kernel/Output/HTML/Standard</filename> in das neu erstellte Verzeichnis.

source: Only copy over the files you actually change. OTRS will automatically get the missing files from the Standard theme. This will make upgrading at a later stage much easier.
de: Kopieren Sie nur diejenigen Dateien, die Sie verändern möchten. Fehlende Dateien wird OTRS automatisch vom Standard-Theme laden. Dadurch werden Systemaktualisierungen vereinfacht.

source: Customize the files in the directory <filename>Kernel/Output/HTML/Company</filename>, and change the layout to your needs.
de: Passen Sie die Dateien im Verzeichnis <filename>Kernel/Output/HTML/Company</filename> Ihren Wünschen entsprechend an.

source: To activate the new theme, add them in SysConfig under <link linkend="Framework:Core::Web:Frontend::Themes">Frontend::Themes</link>.
de: Um das neue Theme OTRS bekannt zu machen, fügen Sie es unter <link linkend="Framework:Core::Web:Frontend::Themes"> Frontend::Themes </link> zur SysConfig hinzu.

source: Now the new theme should be useable. You can select it via your <link linkend="user-preferences">personal preferences</link> page.
de: Ab nun sollten sie das neue Theme nutzen und über Ihre <link linkend="user-preferences">persönlichen Einstellungen</link> aktivieren können.

source: Do not change the theme files shipped with OTRS, since these changes will be lost after an update. Create your own themes only by performing the steps described above.
de: Nehmen Sie keine Änderungen an den Theme-Dateien vor, die mit OTRS installiert wurden, da diese bei einem Update verloren gehen können. Erstellen Sie eigene Themes ausschließlich nach dem oben beschriebenen Verfahren.

source: Localization of the OTRS frontend
de: Übersetzung des OTRS-Frontends

source: OTRS offers multi-language support for its web interface.
de: OTRS bietet Mehrsprachigkeit in der Weboberfläche an.

source: Procedures for localization for the OTRS framework, steps to be followed to create a new language translation, as well as procedures for translation customizations, can be found in the <ulink url="http://doc.otrs.org/developer/3.0/en/html/contributing.html#translate">"Language Translations"</ulink> chapter from the developer manual on <ulink url="http://doc.otrs.org">http://doc.otrs.org</ulink>.
de: Wie der Lokalisationsmechanismus des OTRS Frameworks arbeitet und welche Möglichkeiten er bietet, entnehmen Siie bitte dem Kapitel <ulink url="http://doc.otrs.org/developer/3.0/en/html/contributing.html#translate">Language Translations</ulink> aus dem Developer Handbuch auf <ulink url="http://doc.otrs.org">http://doc.otrs.org</ulink>. Dieses Kapitel beschreibt, wie eigene Übersetzungen eingepflegt und komplett neue Sprachen hinzugefügt werden können.

source: OTRS has the capability to sign or encrypt outgoing messages with PGP. Further, encrypted incoming messages can be decrypted. Encryption and decryption are done with the GPL tool GnuPG. To setup GnuPG for OTRS, the following steps have to be performed:
de: In OTRS können ausgehende E-Mails mit Hilfe von PGP signiert oder verschlüsselt werden. Ebenfalls ist es möglich verschlüsselte Nachrichten zu entschlüsseln. Die Ver- und Entschlüsselung mit PGP wird mit Hilfe des GPL-Werkzeugs <application>GnuPG</application> vorgenommen. Zur Einrichtung sind die folgenden Schritte notwendig:

source: Install GnuPG, via the package manager of your operating system.
de: Erste Aufgabe ist es, das entsprechende GnuPG-Software-Paket zu installieren, welches bei den meisten Linux-Distributionen mitgeliefert wird. Dies sollte mit Hilfe des jeweiligen Paketmanagers leicht durchgeführt werden können.

source: Configure GnuPG for use with OTRS. The necessary directories for GnuPG and a private key have to be created. The command shown in Script 16.1 has to be executed as user 'otrs' from a shell.
de: Im zweiten Schritt muss das soeben installierte GnuPG zur Benutzung für OTRS konfiguriert werden. Dies geschieht auf der Kommandozeilenebene durch einen Aufruf von GnuPG, der die notwendigen Verzeichnisse anlegt und den privaten Schlüssel erzeugt. Der Aufruf muss als Benutzer 'otrs' durchgeführt werden.

source: <emphasis>Script 16.1. Configuring GnuPG.</emphasis>
de: <emphasis>Skript 16.1. Konfiguration von GnuPG.</emphasis>

source: As shown in Script 16.1, the default settings can be applied for most of the required parameters. Only the values for the key owner have to be entered correctly, with a proper password specified for the key.
de: Wie man sehen kann, genügt es bei den meisten Fragen die Vorgabe mit &lt;EINGABE&gt; zu bestätigen. Lediglich die Angabe zur Person des Schlüsselbesitzers ist zu vervollständigen bzw. zum Ende hin ist an der mit (passphrase) gekennzeichneten Stelle die Passphrase für den zu generierenden Schlüssel einzugeben.

source: Now OTRS has to be made ready to use PGP. From the Admin console, open the SysConfig interface and search for "PGP". Select the sub group Crypt::PGP from the search results.
de: Im nächsten Schritt muss OTRS auf die Verwendung von PGP vorbereitet werden. Suchen Sie in SysConfig nach "PGP" und wähen Sie danach dan die Untergruppe Crypt::PGP aus.

source: In the screen for the PGP settings, PGP should be activated for OTRS (first option). Also, the path to the gpg program should be set and checked.
de: In der nun angezeigten Maske sollte zum einen <link linkend="Framework:Crypt::PGP:PGP">" PGP aktiviert </link> werden (die erste Option). Danach sollte überprüft werden, ob der voreingestellte <link linkend="Framework:Crypt::PGP:PGP::Bin"> Pfad zum Programm gpg </link> der tatsächlichen Installation entspricht.

source: The next config setting (PGP::Options) may also require changing. Via this config setting, the parameters that are used for every execution of gpg by the 'otrs' user can be specified. In particular, the directory of the config files for GnuPG of the 'otrs' user is important. In the example <filename>/opt/otrs/.gnupg</filename> is used. This directory was created earlier during the PGP configuration.
de: Die nächste Einstellung (<link linkend="Framework:Crypt::PGP:PGP::Options">PGP::Options</link>) muss ggf. modifiziert werden. Es handelt sich um die Parameter, mit denen OTRS das Programm gpg aufruft. Hier ist insbesondere die Option für die Lage des GnuPG-Konfigurationsverzeichnisses des OTRS-Benutzers otrs wichtig. Im Beispiel ist dies: /opt/otrs/.gnupg). Dieses Verzeichnis wurde im Schritt 1 automatisch von GnuPG angelegt.

source: Via the next config option (PGP::Key::Password) it is possible to specify the pairs of key IDs and their passwords for own private keys. Because communication partners from outside write to the ticket system with their messages encrypted with your public key, OTRS can decrypt these messages with the ID/passwords specified here.
de: Über die letzte Option können die <link linkend="Framework:Crypt::PGP:PGP::Key::Password">Schlüssel-Werte-Paare für die ID(s) und Passphrase(n)</link> der eigenen PGP-Schlüssel dem Ticket System bekannt gemacht werden. Noch einmal genauer: da andere Kommunikationspartner an das Ticket-System (oder besser: an den Mail-Eingang des Systems) E-Mails mit dessen öffentlichen Schlüssel verschlüsselt schicken, kann OTRSmit dem/n in dieser Option angegebenen privaten Schlüssel(n) solchermaßen verschlüsselte Mails entschlüsseln.

source: How to get the id of your own private key? The ID of your own private key is already shown during the key generation (see step 1 from above). It is also possible to get the ID if the command specified in Script 16.2 is executed as user 'otrs':
de: Woher bekommt man die ID des eigenen Schlüssels? Die ID steckt schon in der Ausgabe der Schlüsselgenerierung (siehe Schritt 1). Man kann die ID aber auch als Benutzer 'otrs' jederzeit über die Kommandozeile ermitteln:

source: <emphasis>Script 16.2. Getting the ID of your own private key.</emphasis>
de: <emphasis>Skript 16.2. Die ID des eigenen privaten Schlüssels ermitteln.</emphasis>

source: The ID of the private key can be found in the line that starts with "sub". It is a hexadecimal string that is eight characters long, in the example above it is "52B97069". The password you have to specify for this key in the ticket system is the same that was given during key generation.
de: Die ID des Schlüssels befindet sich in der Zeile, die mit sub beginnt und ist eine 8-stellige hexadezimale Kennung (im Beispiel lautet sie "52B97069". Die für die Option geforderte Passphrase ist dieselbe, die beim Schlüsselgenerieren in Schritt 1 verwendet wurde.

source: After this data is inserted, the "Update" button can be used to save the settings. OTRS is ready to receive and decrypt encoded messages now.
de: Nach Eingabe all dieser Angaben können sie mit dem Aktualisieren-Button gespeichert werden. OTRS ist jetzt für das Empfangen mit PGP verschlüsselter E-Mails konfiguriert.

source: Finally, import a customer's public key. This ensures that encrypted messages can be sent out to this customer. There are two ways to import a public key of a customer.
de: Der letzte Schritt ist der Import des öffentlichen PGP-Schlüssels eines Kunden. Dadurch wird sicher gestellt, dass aus OTRS heraus verschlüsselte Mails an den jeweiligen Kunden gesendet werden können. Es bestehen zwei Möglichkeiten für den Import.

source: The first way is to specify the public key of a customer in the customer management interface.
de: Zum einem können über das Modul zur Verwaltung der Kunden die öffentlichen PGP-Schlüssel beim Anlegen/Bearbeiten des jeweiligen Kunden im System hinterlegt werden.

source: The second way is to specify the key via the PGP settings, reachable from the Admin page. On the right section of this screen, all already imported public keys of customers are displayed. After PGP has been activated and configured for OTRS, your own public key should also be listed there. In the left area of the PGP setting screen it is possible to search for keys. Also, a new public key can be uploaded into the system from a file.
de: Die zweite Möglichkeit bietet das System in den <link linkend="adminarea-pgp">PGP-Einstellungen</link> innerhalb des Admin-Bereiches. In dieser Konfigurationsmaske ist im rechten Teil eine Liste der bereits dem System zur Verfügung stehenden öffentlichen Schlüssel zu sehen. Im Regelfall sollte nach der obigen Einrichtung hier schon der öffentliche Schlüssel des Ticket-Systems selbst zu sehen sein. Im linken Teil besteht neben der Suche die Möglichkeit, neue Schlüssel als Schlüsseldatei ins System zu laden.

source: The files with the public key that need to be imported into OTRS have to be GnuPGP compatible key files. In most cases, the key stored in a file is an "ASCII armored key". OTRS can deal with this format.
de: Sowohl für das Hinzufügen eines Schlüssels über die Kunden- als auch über die PGP-Verwaltung gilt, dass die Dateien mit den Schlüsseln PGP/GnuPG-konforme Schlüssel sein müssen. Normalerweise wird der Schlüssel als "ASCII armored key"-Datei vorliegen, welches problemlos von OTRS verarbeitet werden kann.

source: At first glance, encryption with S/MIME seems a little more complicated than with PGP. First, you have to establish a Certification Authority (CA) for the OTRS system, following which the procedures are very much like those needed with PGP: configure OTRS, install your own certificate, import other public certificates as needed, etc.
de: Die Einrichtung der Verschlüsselung mit S/MIME scheint auf den ersten Blick ein bisschen komplizierter als die PGP-Einrichtung zu sein, da für das OTRS-System erst einmal eine Certification Authority (CA) eingerichtet werden muss. Ansonsten ist das Vorgehen ähnlich wie bei PGP, OTRS konfigurieren, eigenes Zertifikat einrichten, ggf. fremde Public-Zertifikate importieren, usw.

source: The S/MIME configuration is conducted outside the OTRS web interface for the most part, and should be carried out in a shell by the 'otrs' user. The MIME configuration under Linux is based on SSL (OpenSSL). Therefore, check first of all whether the OpenSSL package is installed on your system. The OpenSSL package includes a script called CA.pl, with which the most important steps of certificate creation can be performed. To simplify the procedure, find out where in the filesystem the CA.pl script is stored and enter the location temporarily into the PATH variable of the shell (see Script 17.1 below).
de: Die S/MIME-Konfiguration geschieht zu einem großen Teil außerhalb der OTRS-Web-Oberfläche und sollte als otrs-Benutzer (bzw. als der Benutzer mit dessen Rechten OTRS läuft) in einer Shell durchgeführt werden. Da die MIME-Konfiguration unter Linux im wesentlichen auf SSL (<application>openssl</application> basiert, sollte zuerst sichergestellt werden, dass das <application>openssl</application>-Paket installiert ist. Mit dem <application>openssl</application>-Paket kommt ein Skript, <filename>CA.pl</filename>, mit welchem die wichtigsten Schritte zur Zertifikatserstellung bewältigt werden können. Damit dieser Vorgang einfacher wird, sollte zuerst herausgefunden werden, wo sich das Skript <filename>CA.pl</filename> im Dateisystem befindet. Danach sollte diese Stelle der Einfachheit halber temporär in den Suchpfad der Shell übernommen werden.

source: <emphasis>Script 17.1. Configuring S/MIME.</emphasis>
de: <emphasis>Skript 17.1. Konfiguration von S/MIME.</emphasis>
