Repository: xhoy/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: de

source: You can customize the subject and the text of the notifications. Click on the notification you want to change from the list, and its content will get loaded for editing (see Figure 5.41). Please note that there is a notification with the same name for each of the available languages.
de: Den Betreff und Text der Benachrichtigungen können Sie anpassen. Wählen Sie die gewünschte Benachrichtigung aus der Liste durch Klick aus. Beachten Sie: in jeder Sprache gibt es eine Benachrichtigung mit demselben Namen.

source: <emphasis>Figure 5.41. Customizing a Notification.</emphasis>
de: <emphasis>Abb. 5.41. Berarbeiten einer Benachrichtigung.</emphasis>

source: Just as with signatures and salutations, it is possible to dynamically create the content of a notification, by using special variables. You can find a list of variables at the bottom of the screen shown in the Figure 5.41.
de: Auch innerhalb der Benachrichtigungen können die Textinhalte mit Hilfe der OTRS-Variablen dynamisch aufbereitet werden. Innerhalb der Anmerkungen im unteren Bereich der Bildschirmmaske zur Benachrichtigungen-Verwaltung werden die verschiedenen zur Verfügung stehenden Variablen und deren Verwendung aufgelistet und näher erklärt.

source: It is also possible to create notifications based on events. You can specify in detail when and to whom you want such a notification to be sent. You can choose from a wide variety of parameters, such as: recipient group(s), agent(s), role(s), email address(es), type of event triggering the notification, ticket-type, state, priority, queue, lock, service, SLA, etc.
de: Ebenso ist es möglich, Benachrichtigungen zu erstellen, die auf Ereignissen basieren. Hier können Sie detailliert einstellen, wann diese Benachrichtigung geschickt werden soll. Zudem kann ein weites Spektrum von Parametern konfiguriert werden, wie: Empfängergruppen(n), Benutzer, Rollen, E-Mail-Adressen; Ereignistyp, der die Benachrichtigung auslöst, Ticket-Typ, Status, Priorität, Sperre, Service, SLA, usw.

source: In order to see a list of all event based notifications, click on the link "Notifications (Event)" on the Admin page (see Figure 5.42).
de: Um eine Übersicht aller ereignisbasierten Benachrichtigungen zu erhalten, klicken Sie auf "Benachrichtigungen (Ereignis)" im Administrationsbereich.

source: Managing Event-based Notifications
de: Ereignisbasierte Benachrichtigungen verwalten

source: <emphasis>Figure 5.42. Event based Notification management.</emphasis>
de: <emphasis>Abb. 5.42. Ereignisbasierte Benachrichtigungen verwalten.</emphasis>

source: As shown in Figure 5.42, you can create a new notification by clicking on the Add button (see Figure 5.43).
de: Erstellen Sie eine neue Benachrichtigung durch Klick auf den "Hinzufügen"-Knopf.

source: Managing Event based Notifications
de: Ereignisbasierte Benachrichtigungen verwalten

source: <emphasis>Figure 5.43. Registering an Event based Notification management.</emphasis>
de: <emphasis>Abb. 5.43. Ereignisbasierte Benachrichtigung einrichten.</emphasis>

source: Please note that the content of the event based notifications can also be dynamically created by using the special variables listed at the bottom of the screen shown in the Figure 5.43.
de: Auch in den ereignisbasierten Benachrichtigungen können Sie mit den speziellen Variablen dynamische Texte erzeugen. Die Referenz der Variablen sehen Sie im unteren Bildschirmbereich.

source: OTRS can process incoming S/MIME encoded messages and sign outgoing mails. Before this feature can be used, you need to activate it and change some <link linkend="Framework:Crypt::SMIME">config parameters</link> in the SysConfig.
de: Mit OTRS ist es möglich, Tickets mit Hilfe von SMIME zu ent- und verschlüsseln bzw. Tickets zu signieren. Bevor SMIME allerdings systemweit genutzt werden kann, muss das Feature mit Hilfe einiger <link linkend="Framework:Crypt::SMIME">Konfigurationsparameter</link> aktiviert und konfiguriert werden.

source: The "S/MIME Certificates" link on the Admin page allows you to manage your S/MIME certificates (see Figure 5.44 below). You can add or remove certificates, and also search through the SMIME data.
de: Über den "SMIME"-Link im Admin-Bereich von OTRS erreichen Sie die Verwaltung der SMIME-Zertifikate. Es können Zertifikate und private Fingerprints hinzugefügt und entfernt werden und eine Suche in den Zertifikaten ist möglich.

source: <emphasis>Figure 5.44. S/MIME management.</emphasis>
de: <emphasis>Abb. 5.44. S/MIME-Verwaltung.</emphasis>

source: OTRS handles PGP keys, which allows you to encrypt/decrypt messages and to sign outgoing messages. Before this feature can be used, you need to activate it and change some <link linkend="Framework:Crypt::PGP"> config parameters </link> in the SysConfig.
de: Mit OTRS ist es möglich, Tickets mit Hilfe von PGP zu ent- und verschlüsseln bzw. zu signieren. Bevor PGP allerdings systemweit genutzt werden kann, muss das Feature mit Hilfe einiger <link linkend="Framework:Crypt::PGP">Konfigurationsparameter</link> aktiviert und konfiguriert werden.

source: Through the "PGP Keys" link on the Admin page, it is possible to manage the key ring of the user who shall be used for PGP with OTRS (see Figure 5.45 below), e.g. the local OTRS user or the web server user. It is possible to add and remove keys and signatures, and you can search through all data in your key ring.
de: Über den "PGP"-Link im Admin-Bereich von OTRS erreichen Sie die Verwaltung des Schlüsselrings Ihres Systems. Es können Schlüssel und Signaturen hinzugefügt und entfernt werden und eine Suche innerhalb des Schlüsselrings ist möglich.

source: <emphasis>Figure 5.45. PGP management.</emphasis>
de: <emphasis>Abb. 5.45. PGP-Verwaltung.</emphasis>

source: States
de: Status

source: Through the "States" link on the Admin page, you can manage the different ticket states you want to use in the system (see Figure 5.46 below).
de: Über den Link "Status" können Sie die verschiedenen Ticket-Status bearbeiten, die Sie in OTRS verwenden möchten.

source: Managing ticket states
de: Verwaltung von Ticket-Status

source: <emphasis>Figure 5.46. State management.</emphasis>
de: <emphasis>Abb. 5.46. Status-Verwaltung.</emphasis>

source: After a default setup, there are some states defined:
de: In einer Standardinstallation sind folgende Status definiert:

source: closed successful
de: erfolgreich geschlossen

source: closed unsuccessful
de: erfolglos geschlossen

source: merged
de: zusammengefasst

source: new
de: neu

source: open
de: öffnen

source: pending auto close+
de: warten auf erfolgreich schließen

source: pending auto close-
de: warten auf erfolglos schließen

source: pending reminder
de: warten zur Erinnerung

source: removed
de: entfernt

source: Every state is linked to a type, which needs to be specified if a new state is created. By default the state types are:
de: Jeder Status ist mit einem Typ verküpft. Auch bei dem Neuanlegen eines Status muss ein Typ angegeben werden. Die standardmäßig verfügbaren Status-Typen sind:

source: closed
de: geschlossen

source: pending auto
de: warten auto

source: SysConfig
de: Die SysConfig (Verwaltung der Systemkonfiguration)

source: The SysConfig link leads to the section where many OTRS configuration options are maintained.
de: In der SysConfig werden die meisten Konfigurationseinstellungen von OTRS vorgenommen.

source: The SysConfig link on the Admin page loads the graphical interface for system configuration (see Figure 5.47 below). You can upload your own configuration files for the system, as well as backup all your current settings into a file. Almost all configuration parameters of the OTRS framework and installed applications can be viewed and changed through this interface. Since all configuration parameters are sorted into groups and sub groups, it is possible to navigate quickly through the multitude of the parameters. It is also possible to perform a full-text search through all the configuration parameters.
de: Über den "SysConfig"-Link im Admin-Bereich von OTRS erreichen sie die grafische Administrationsoberfläche. Über diese können Sie eigene Konfigurationsdateien in das System integrieren bzw. Ihre persönlichen Änderungen an der Standardkonfiguration in eine Datei sichern. Nahezu alle Konfigurationsparameter des OTRS Frameworks und der zusätzlich installierten Module können eingesehen und geändert werden, die Navigation durch die Vielzahl der Konfigurationsparameter wurde durch die Einteilung in Module und Gruppen übersichtlich aufgeteilt. Weiterhin ist es möglich, eine Suche über alle Konfigurationsparameter hinweg durchzuführen, so dass einzelne Parameter schnell aufgefunden und bearbeitet werden können.

source: The graphical interface for system configuration (SysConfig)
de: Das grafische Konfigurationsfrontend von OTRS (SysConfig)

source: <emphasis>Figure 5.47. The graphical interface for system configuration (SysConfig).</emphasis>
de: <emphasis>Abb. 5.47. Das grafische Konfigurationsfrontend von OTRS (SysConfig).</emphasis>

source: The graphical interface for system configuration is described in more detail in the chapter <link linkend="sysconfig"> "Configuring the system through the web interface"</link>.
de: Das Kapitel <link linkend="sysconfig">Nähere Beschreibung der grafischen Administrationsoberfläche</link> geht ausführlicher auf das grafische Konfigurations-Frontend ein.

source: Using mail accounts
de: Einrichten von Mail-Konten

source: There are several possibilities to transport new emails into the ticket system. One of them is the <link linkend="email-receiving-cmd">otrs.PostMaster.pl module</link> that pipes the mails directly into the system. Another possibility is the use of mail accounts which can be administrated through the web interface. The "PostMaster Mail Accounts" link on the Admin page loads the management console for the mail accounts (see Figure 5.48 below). OTRS supports the mail protocols: POP3, POP3S, IMAP and IMAPS.
de: Es gibt mehrere Möglichkeiten, Mails in OTRS einzuspeisen. Neben der Nutzung des <link linkend="email-receiving-cmd">PostMaster.pl-Skripts</link>, welches die Mails direkt in das System piped, können auch Mail-Konten abgefragt werden, an die Mails für Ihr Ticket-System gehen. Über den Link "PostMaster Mail Account" innerhalb des Admin-Bereiches erreichen Sie die Verwaltung der Mail-Konten, die OTRS automatisch auf neue Nachrichten überprüfen soll. OTRS ünterstützt dabei die Mail-Protokolle POP3, POP3S, IMAP und IMAPS.

source: Mail account management
de: Verwaltung von Mail-Konten

source: <emphasis>Figure 5.48. Mail account management.</emphasis>
de: <emphasis>Abb. 5.48. Verwaltung von Mail-Konten.</emphasis>

source: See the section about the <link linkend="email-receiving-pop3">PostMaster mail accounts</link> for more details.
de: Im Kapitel über die <link linkend="email-receiving-pop3">Mailkonfiguration</link> für OTRS wird die Einrichtung der Mail-Konten näher erläutert.

source: Filtering incoming messages
de: Einkommende Nachrichten filtern

source: OTRS has the capability to filter incoming messages, as reflected by incoming messages being sorted automatically into queues, or spam mails being moved into a specific queue. It is irrelevant whether <filename>PostMaster.pl</filename> or mail accounts are used to get messages into the ticket system. Filter rules can be created through the link "PostMaster Filter" on the Admin page (see Figure 5.49 below).
de: Damit Sie automatisch Mails vorsortieren können bzw. ungewünschte Mails gar nicht in die Queues des Ticket-Systems gelangen, können Filterregeln für eingehende Nachrichten festgelegt werden. Dabei spielt es keine Rolle, ob die Mails über Mail-Konten oder mit Hilfe des<filename>PostMaster.pl</filename> Skriptes ins System gelangen. Der Link "PostMaster Filter" innerhalb des Admin-Bereiches von OTRS ruft die Verwaltung für die Filterregeln auf.

source: Managing filter rules for incoming messages
de: Verwaltung von Filterregeln für eingehende E-Mails

source: <emphasis>Figure 5.49. PostMaster filter management.</emphasis>
de: <emphasis>Abb 5.49. Verwaltung von Filterregeln für eingehende E-Mails.</emphasis>

source: A filter consists of one or more criteria that must match for the defined actions to be executed on the email. Filter criteria may be defined for the headers or the body of an email, e.g. search for specific header entries or strings in the body, even regular expressions are allowed. All actions for a filter rule are triggered by X-OTRS headers, which are inserted if the filter criteria match. The ticket system evaluates the inserted X-OTRS headers and executes the specific actions. X-OTRS headers can be used to sort an incoming message into a specific queue, change the priority of the message or ignore the message and not deliver it to the system. The Table 5-4 lists the different X-OTRS headers and their meaning.
de: Eine Filterregel besteht aus einem oder mehreren Kriterien die erfüllt werden müssen, damit die Filterregel greift, und aus einer oder mehreren Aktionen die ausgeführt werden, nachdem die Filterkriterien erfüllt wurden. Sie können für die Kopfzeilen und den Body einer Nachricht Filterregeln festlegen, also z. B. nach bestimmten Headern suchen oder nach Zeichenketten bzw. regulären Ausdrücken innerhalb der Mail. Alle Aktionen für eine Filterregel werden über sog. X-OTRS-Header gesteuert, die in die Mail eingefügt werden. Das Ticket-System wertet die X-OTRS-Header aus und nimmt die entsprechenden Aktionen vor. Mit den X-OTRS-Headern kann z. B. die Priorität einer Nachricht geändert werden, die Mail in eine bestimmte Queue einsortiert oder die Mail komplett verworfen werden, usw. Die folgende Tabelle listet die verschiedenen X-OTRS-Header, deren zulässige Werte und die Bedeutung der einzelnen Header auf.

source: Note: You also can use X-OTRS-FollowUp-* headers for follow up emails.
de: Hinweis: Sie können auch X-OTRS-FollowUp-* header für Follow-Up-E-Mails verwenden.

source: Function of the different X-OTRS-headers
de: Funktion der verschiedenen X-OTRS-Header

source: Possible values
de: Mögliche Werte

source: Sets the priority of a ticket.
de: Legt die Priorität eines Tickets fest.

source: Name of a queue in the system.
de: Name einer Queue des Systems.

source: Sets the queue where the ticket shall be sorted. If set in X-OTRS header, all other filter rules that try to sort a ticket into a specific queue are ignored.
de: Legt die Queue fest, in die das Ticket einsortiert werden soll. Wird mit dem X-OTRS-Queue-Header eine Queue voreingestellt, so hat diese Einstellung Vorrang vor allen anderen Filterregeln, die sich auf Queues beziehen.

source: Sets the lock state of a ticket.
de: Setzt den "gesperrt"-Status eines Tickets.

source: Yes or True
de: Yes oder True

source: If this X-OTRS header is set to "Yes", the incoming message will completely be ignored and never delivered to the system.
de: Wird dieser Header gesetzt, wird die Mail komplett ignoriert und gelangt somit nie als Ticket in das System.

source: Sets the next state of the ticket.
de: Setzt den nächsten Status eines Tickets.

source: e. g. 2010-11-20 00:00:00
de: Z. B. 2010-11-20 00:00:00

source: Sets the pending time of a ticket (you also should sent a pending state via X-OTRS-State).
de: Setzt die Wartezeit eines Tickets (Sie sollten dann ebenfalls einen "Warten"-Status per X-OTRS-State setzen).

source: default (depends on your setup)
de: default (systemabhängig)

source: Sets the type of a ticket (if Ticket::Type support is active).
de: Setzt den Typ eines Tickets (wenn Ticket::Type aktiviert ist).

source: (depends on your setup)
de: (systemabhängig)

source: Sets the service of a ticket (if Ticket::Service support is active).
de: Setzt den Service eines Tickets (wenn Ticket::Service aktiv ist).

source: Sets the SLA of a ticket (if Ticket::Service support is active).
de: Setzt das Service-Level-Abkommen eines Tickets (wenn Ticket::Service aktiv ist).

source: Sets the customer user for the ticket.
de: Legt den Kunden-Benutzer fest, dem das Ticket zugeordnet werden soll.

source: Sets the customer ID for this ticket.
de: Legt die Kunden-ID fest, die dem Ticket zugeordnet werden soll.

source: Additional info key for the article.
de: Zusätzlicher Info-Key für den Artikel.

source: Saves an additional info key for this article.
de: Speichert einen zusätzlichen Info-Key für den Artikel.

source: Additional info value for the article.
de: Zusätzlicher Info-Value.

source: Saves an additional info value for the article.
de: Speichert einen zusätzlichen Info-Value für den Artikel.

source: Sets the type of the ticket sender.
de: Legt die Art des Ticket-Absenders fest.

source: Sets the article type for the incoming ticket.
de: Legt den Typ des Artikles für das eingehende Ticket fest.

source: Additional info key for the ticket.
de: Zusätzlicher Info-Key

source: Saves an additional info key for the ticket.
de: Speichert einen zusätzlichen Info-Key für das Ticket.

source: Additional info value for the ticket.
de: Zusätzlicher Info-Value

source: Saves an additional info value for the ticket.
de: Speichert einen zusätzlichen Info-Value für das Ticket.

source: If this X-OTRS header is set, no auto answer is delivered to the sender of the message (mail loop protection).
de: Ist dieser X-OTRS-Header gesetzt, wird keine automatische Antwort an den Absender des neuen Tickets geschickt, z. B. um Mailschleifen zu vermeiden.

source: A name must be specified for every filter rule. Filter criteria can be specified in the section "Filter Condition". Choose via the listboxes for "Header 1", "Header 2" and so on for the parts of the messages where you would like to search, and specify on the right side the values you wish to filter on. In the section "Set Email Headers", you can choose the actions that are triggered if the filter rules match. You can select for "Header 1", "Header 2" and so on to select the X-OTRS-Header and set the associated values (see Figure 5.50 below).
de: Sie müssen für jede Regel einen Namen vergeben. Darunter legen Sie in der Sektion für "Treffer" die verschiedenen Kriterien fest, nach denen gefiltert werden soll. Wählen Sie aus den Listboxen für "Header 1", "Header 2" usw. aus, an welcher Stelle in der eingehenden Nachricht Sie suchen möchten und tragen Sie rechts neben dem entsprechenden Header den Wert ein, nach dem gesucht werden soll. In der Sektion "Setzen" legen Sie die Aktionen fest, die ausgeführt werden sollen, wenn die Filterkriterien zutreffen. Hier können Sie für "Header1", "Header 2" usw. den entsprechenden X-OTRS-Header auswählen und rechts daneben den entsprechenden Wert eintragen.

source: Addin filter rules for incoming messages
de: Filter-Regeln für eingehende Nachrichten anlegen

source: <emphasis>Figure 5.50. Add a PostMaster filter.</emphasis>
de: <emphasis>Abb. 5.50. Filter-Regeln für eingehende Nachrichten anlegen.</emphasis>

source: Sort spam mails into a specific queue
de: Aussortierung von Spammails in eine bestimmte Queue

source: A useful filter rule could be to let OTRS automatically move mails marked for spam with a spam detection tool such as SpamAssassin, into the "Junk" queue. SpamAssassin adds the "X-Spam-Flag" header to every checked mail. When the mail is marked as spam, the Header is set to "Yes". So the filter criteria would be "X-Spam-Flag: Yes". To create a filter rule with this criteria you can insert the name as, for example, "spam-mails". In the section for "Filter Condition", choose "X-Spam-Flag:" for "Header 1" from the listbox. Insert "Yes" as value for this header. Now the filter criteria is specified. To make sure that all spam mails get directed into the "Junk" queue, choose in the section for "Set Email Headers", the "X-OTRS-Queue:" entry for "Header 1". Specify "Junk" as value for this header. Finally add the new filter rule to activate it for new messages into the system.
de: Eine nützliche Filterregel könnte sein, alle Mails, die von SpamAssassin als Spam markiert wurden, automatisch in die Queue "Junk" einsortieren zu lassen. Spamassassin fügt bei allen überprüften Mails die Kopfzeile "X-Spam-Flag" hinzu. Wird die Mail als Spam markiert, wird dieser Header auf "Yes" gesetzt. Das Filterkriterium lautet also "X-Spam-Flag: Yes". Um nun eine Filterregel mit diesem Kriterium zu erzeugen, tragen Sie hierzu als Name für die Filterregel z. B. "spam-mails" ein und wählen in der Sektion "Treffer" für "Header 1" den Header "X-Spam-Flag:" aus der Listbox aus. Rechts daneben fügen Sie als Wert "Yes" hinzu. Das Filterkriterium wurde somit festgelegt. Um nun die Einsortierung der von spamassassin als Spam klassifizierten Mails in die Queue "Junk" zu erzwingen, wählen Sie in der Sektion "Setzen" für "Header 1" den Eintrag "X-OTRS-Queue:" aus und tragen als Wert rechts daneben "Junk" ein. Abschließend wird mit Hilfe des "Hinzufügen"-Buttons die neue Regel gespeichert und aktiviert, beim nächsten Abruf der POP3-Konten bzw. für die nächste an das System gesendete Nachricht wird die Filterregel abgearbeitet.

source: There are additional modules, that can be used to <link linkend="email-receiving-filter">filter incoming messages</link> more specifically. These modules might be useful on larger, more complex systems.
de: Es gibt weitere Module, die zum <link linkend="email-receiving-filter">Filtern eingehender E-Mails</link>genutzt werden und bei komplexeren Installationen nützlich sein können.

source: Executing automated jobs with the GenericAgent
de: Ausführen von automatisierten Jobs mit Hilfe des GenericAgents

source: The GenericAgent is a tool to execute tasks automatically. In its absence such tasks would need to be done by a human person, a real agent. The GenericAgent, for example, can close or move tickets, send notifications on escalated tickets, etc.
de: Der GenericAgent ist ein Tool zum automatischen Ausführen von Aufgaben, die normalerweise ein richtiger Agent manuell durchführen müsste. Er kann z. B. bestimmte Tickets in einer Queue schließen oder Benachrichtigungen für eskalierte Tickets versenden.

source: Click the link "GenericAgent" on the Admin page (see Figure 5.51 below). A table with currently automated jobs is displayed which can be edited to switch to executing jobs manually, or removing them.
de: Um zum GenericAgent zu gelangen, verwenden Sie die Verknüpfung "GenericAgent" in der Administrationsoberfläche von OTRS. Eine Liste verfügbarer Jobs wird angezeigt, welche bearbeitet, ausgeführt oder gelöscht werden können.

source: Job list for the GenericAgent
de: Jobliste des GenericAgent

source: <emphasis>Figure 5.51. Job list for the GenericAgent.</emphasis>
de: <emphasis>Abb. 5.51. Jobliste des GenericAgent.</emphasis>

source: Click the "Add job" button to create a new job. You first need to supply a name for the job, as also the times when the job should be executed. Different criteria to select the tickets to work on and the new properties of those tickets can also be set (see Figure 5.52 below).
de: Über die Bildschirmmaske zum Erstellen eines neuen Jobs kann der Zeitplan für die Ausführung des Jobs eingestellt werden. Desweiteren kann über verschiedene Kriterien festgelegt werden, welche Tickets vom Job erfasst werden sollen. Schließlich ist es möglich, die neuen Eigenschaften der vom Job betroffenen Tickets einzustellen.

source: Creating a job for the GenericAgent
de: Anlegen eines GenericAgent-Jobs

source: <emphasis>Figure 5.52. Creating a job for the GenericAgent.</emphasis>
de: <emphasis>Abb. 5.52. Anlegen eines GenericAgent-Jobs.</emphasis>
