Repository: xhoy/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: de

source: Script 17.1 shows that a new temporary directory ~/tmp has been created, in which the certificate is to be generated.
de: Im Beispiel sieht man auch, dass ein temporäres Verzeichnis <filename>~/tmp</filename> angelegt wurde, in welchem die Zertifikatsgenerierung durchgeführt wird.

source: To create a certificate, perform the following operations in the command line (we assume that the OTRS administrator has to create a SSL certificate for test and learning purposes. In case you already have a certified SSL certificate for the encryption, use it and skip these steps):
de: Im einzelnen sind zur Zertifikatserzeugung folgende Schritte durchzuführen, die einzelnen Schritte sind in der Kommandozeile auszuführen. Sollte ein beglaubigtes SSL-Zertifikat für die Verschlüsselung bereits vorhanden sein, so sollte natürlich dieses verwendet werden. Dann können die nun folgenden Schritte übersprungen werden. Der beschriebene Ablauf geht davon aus, dass der OTRS-Administrator sich das SSL-Zertifikat zu Test- und Lernzwecken selbst anlegen muss.

source: Establish your own Certification Authority for SSL. You need it to certify the request for your own SSL certificate (see Script 17.2 below).
de: Anlegen einer eigenen Certification Authority für SSL. Diese wird benötigt, um die Anfrage für ein eigenes SSL-Zertifikat zu beglaubigen.

source: <emphasis>Script 17.2. Establishing a Certification Authority for SSL.</emphasis>
de: <emphasis>Skript 17.2. Anlegen einer Certification Authority für SSL.</emphasis>

source: Generate a certificate request (see Script 17.3 below).
de: Erzeugen der Zertifikatsanfrage.

source: <emphasis>Script 17.3. Creating a certificate request.</emphasis>
de: <emphasis>Skript 17.3. Erstellen einer Zertifikatsanfrage.</emphasis>

source: Signing of the certificate request. The certificate request can either be signed and thereby certified by your own CA, or made more credible by being signed by another external certified CA (see Script 17.4 below).
de: Die Zertifikatsanfrage durch die CA signieren lassen. Die Zertifikatsanfrage kann entweder durch die selbst angelegte CA signiert (= beglaubigt) werden. Allerdings ist es natürlich seriöser, wenn das eigene SSL-Zertifikat von einer fremden, externen und ihrerseits beglaubigten CA beglaubigt wird.

source: <emphasis>Script 17.4. Signing of the certificate request.</emphasis>
de: <emphasis>Skript 17.4. Signieren der Zertifikatsanfrage.</emphasis>

source: Generate your own certificate, and all data going with it, using the signed certificate request (see Script 17.5 below).
de: Mit der signierten Zertifikatsanfrage das eigene Zertifikat und alle dazugehörigen Dateien erzeugen.

source: <emphasis>Script 17.5. Generating a new certificate.</emphasis>
de: <emphasis>Skript 17.5. Neues Zertifikat erstellen.</emphasis>

source: Now that these operations have been performed, the S/MIME setup must be completed in OTRS.
de: Nach der Durchführung dieser Schritte ist es notwendig die Einrichtung von S/MIME in OTRS abzuschließen.

source: This part of the setup is carried out in the Admin page, choosing the link <link linkend="adminarea-smime">"SMIME"</link>. In case the general S/MIME support in OTRS has not yet been enabled, the mask points this out to the administrator and provides an appropriate link for enabling it.
de: Die OTRS-seitige Einrichtung erfolgt aus dem Admin-Bereich, Block System über den Punkt <link linkend="adminarea-smime">SMIME</link>. Falls die generelle S/MIME-Unterstützung in OTRS noch nicht aktiviert wurde, weist die Maske den OTRS-Administrator beim Aufruf darauf hin und bietet einen bequemen Link zur Einrichtung.

source: With the SysConfig group <link linkend="Framework:Crypt::SMIME">"Crypt::SMIME"</link>, you can also enable and configure the general S/MIME support.
de: Über die SysConfig kann die generelle S/MIME-Unterstützung eingeschaltet und konfiguriert werden. Diese Einrichtung findet man unter der SysConfig-Gruppe <link linkend="Framework:Crypt::SMIME">Crypt::SMIME</link>.

source: Here you can activate S/MIME support, and define the paths for the OpenSSL command and the directory for the certificates. The key file created above must be stored in the directory indicated here. Otherwise OpenSSL cannot use it.
de: Hier können sie S/MIME-Unterstützung aktivieren, und die Pfade zum OpenSSL-Kommando und zu den Zertifikaten angeben. Die vorhin erzeugte Schlüsseldatei muss in diesem Verzeichnis gespeichert werden, sonst kann OpenSSL sie nicht verwenden.

source: The next step is performed in the <link linkend="adminarea-smime">S/MIME configuration on the OTRS Admin page</link>. Here, you can import the private key(s) of the OTRS system and the public keys of other communication partners. Enter the public key that has been created in the beginning of this section and added to OTRS.
de: Im nächsten Schritt geht es (zurück) zur <link linkend="adminarea-smime">S/MIME-Konfiguration</link> im Administrationsbereich. Dort können nun sowohl der private Schlüssel(Key) bzw. die privaten Schlüssel des OTRS-Systems, als auch die öffentlichen Schlüssel anderer Kommunikationspartner ins System importiert werden. Tragen Sie hier den öffentlichen Schlüssel ein, der zu Beginn dieses Abschnitts erzeugt und dann in OTRS hinzugefügt wurde.

source: Obviously, all public S/MIME keys of communication partners can be imported using the <link linkend="adminarea-customers">customer administration tool</link> as well.
de: Selbstverständlich können aber auch alle öffentlichen S/MIME-Schlüssel der Kommunikationspartner über das <link linkend="adminarea-customers">Modul zur Kundenverwaltung</link> beim Anlegen/Bearbeiten des jeweiligen Kunden in das System importiert werden.

source: From OTRS 2.0 on, Access Control Lists (ACLs) can be used to control access to tickets, modules, queues, etc., or to influence actions on tickets (closing, moving, etc.) in certain situations. ACLs can be used to supplement the existing permission system of <link linkend="adminarea-roles">roles</link> and <link linkend="adminarea-groups">groups </link>. Using ACLs, rudimental workflows within the system can be mapped, based on ticket attributes.
de: Seit OTRS 2.0 können Access Control Lists (ACLs) verwendet werden, um den Zugriff auf Tickets, Module, Queues, usw. zu steuern bzw. um in bestimmten Situationen Aktionen auf Tickets (schließen, verschieben, usw.) zu beeinflussen. ACLs können als Ergänzung zum bestehenden Berechtigungssystem der <link linkend="adminarea-roles">Rollen</link> und <link linkend="adminarea-groups">Gruppen</link> verwendet werden. Mit ACLs lassen sich, basierend auf Ticket-Attributen, rudimentäre Workflows innerhalb des Systems abbilden.

source: As yet, ACLs cannot be created using the <link linkend="adminarea-sysconfig">SysConfig interface</link>. They must be directly entered into the <filename>Kernel/Config.pm</filename> file. Some ACL examples are listed below (Example 18-1, 18-2 and 18-3):
de: ACLs können noch nicht über das <link linkend="adminarea-sysconfig">SysConfig-Interface</link> erstellt werden, sie müssen direkt in die Datei <filename>Kernel/Config.pm</filename> eingetragen werden. Im Folgenden einige Beispiele:

source: ACL allowing movement into a queue of only those tickets with ticket priority 5.
de: ACL, die das Verschieben von Tickets in eine Queue nur bei einer Ticket-Priorität von 5 erlaubt.

source: ACL disabling the closing of tickets in the raw queue, and hiding the close button.
de: ACL, die das Schließen von Tickets in der raw-Queue verbietet und den Schließen-Schalter ausblendet.

source: ACL removing the status for all agents, only providing it for a group.
de: ACL, die den Status für alle Agenten entfernt und Ihn nur noch für eine Gruppe zur Verfügung stellt.

source: In Script 18.1 there is a list of all parameters which can be used for ACLs.
de: In Skritp 18.1 finden Sie eine Liste aller Parameter, die für ACLs verwendet werden können.

source: <emphasis>Script 18.1. Valid parameters for ACLs.</emphasis>
de: <emphasis>Skript 18.1. Verwendbare Parameter für ACLs.</emphasis>

source: Stats module
de: Statistikmodul

source: The OTRS stats module holds features to track operational statistics and generate custom reports associated with OTRS usage. The OTRS system uses the term "stat" generically to refer to a report presenting various indicators.
de: Das OTRS-Statistikmodul enthält Funktionen, um betriebliche Kennziffern zu überwachen und angepasste Reports der Verwendung von OTRS zu erstellen. In OTRS wird der Begriff "Stat/Statistik" für einen Report benutzt, der verschiedene Indikatoren abbildet.

source: Proper configuration of the OTRS stats module is associated with a multitude of requirements and considerations. These include the various OTRS modules to be evaluated, user permission settings, indicators to be calculated and their complexity levels, ease of configuration of the stats module, speed and efficiency of calculations, and support of a rich set of output variants.
de: Eine sinnvolle Konfiguration des OTRS-Statistikmoduls ist verbunden mit einer Vielzahl von Anforderungen und Überlegungen. Darin eingeschlossen sind die auszuwertenden Module von OTRS, Benutzerrechte, zu berechnende Indikatoren und ihre Komplexitätsgrade, eine einfache Konfiguration des Statistikmoduls, Geschwindigkeit und Effizienz der Berechnungen, und die Unterstützung verschiedener Ausgabevarianten.

source: Statistical elements, i.e. files which supplement the functionality of the stats module for specific requirements, can be integrated for calculating complex statistics.
de: Um komplexe Statistiken abzubilden, besteht ferner die Möglichkeit statische Elemente zu integrieren (Dateien, die die Funktionalität des Statistik-Moduls um ganz spezifische Anforderungen ergänzen).

source: Handling of the module by the agent
de: Bedienung des Moduls durch den Agent

source: When signed on as an agent, the navigation bar displays the link "Statistics". This has various submenu options, as shown in Figure 19.1.
de: Wenn man als Agent angemeldet ist, erscheint der Menüpunkt "Statistik" mit verschiedenen Unterpunkten, siehe Abb. 19.1.

source: The stats module
de: Das Statistikmodul

source: <emphasis>Figure 19.1. Statistics menu options.</emphasis>
de: <emphasis>Abb. 3.7. Statistikmenü.</emphasis>

source: The different options provided in the statistics menu are:
de: Folgende Optionen sind im Statistikmenü verfügbar:

source: <emphasis>Overview</emphasis>. Presents a list of different pre-configured reports.
de: <emphasis>Übersicht</emphasis>. Zeigt eine Liste vorkonfigurierter Reports an.

source: <emphasis>New</emphasis>. Requires rw rights.
de: <emphasis>Neu</emphasis>. Benötigt "rw"-Rechte.

source: <emphasis>Import</emphasis>. Requires rw rights.
de: <emphasis>Importieren</emphasis>. Benötigt "rw"-Rechte.

source: Overview
de: Übersicht

source: Selecting the "Statistics" link in the navigation bar, and then the submenu link "Overview", calls up the Overview screen. The Overview screen presents a list of all pre-configured reports the agent can use (see Figure 19.2 below).
de: Die Auswahl von "Statistik" und des Unterpunktes "Übersicht" ruft den Übersichtsbildschirm auf. Hier wird dem Agenten eine Liste von vorkonfigurierten Reports präsentiert, die er verwenden kann.

source: Overview of the standard reports
de: Übersicht der Standardstatistiken

source: <emphasis>Figure 19.2. Overview of the standard reports.</emphasis>
de: <emphasis>Abb. 19.2. Übersicht der Standardstatistiken.</emphasis>

source: The following information is provided for each of the standard reports listed in the Overview:
de: Folgende Informationen sind den in der Übersicht aufgelisteten Statistiken zu entnehmen:

source: <emphasis>Stat#</emphasis>. Unique report number.
de: <emphasis>Stat#</emphasis>. Eindeutige Statistiknummer.

source: <emphasis>Title</emphasis>. Title of the report.
de: <emphasis>Titel</emphasis>. Titel der Statistik.

source: <emphasis>Object</emphasis>. Object used for generating the statistic. In the case of a static statistic, no object is displayed as no dynamic object is used for its generation.
de: <emphasis>Objekt</emphasis>. Objekt, das für die Generierung der Statistik verwendet wird. Wenn es sich um eine statische Statistik handelt, wird kein Objekt angezeigt, da kein dynamisches Objekt zur Generierung verwendet wird.

source: <emphasis>Description</emphasis>. A brief description of the report.
de: <emphasis>Beschreibung</emphasis>. Ein Auszug aus der Beschreibung der Statistik.

source: When the stats module is installed, it comes preloaded with a few sample reports imported into the system. These are shown as a list on the Overview page. If the Overview list extends to more than a single page, the agent can browse through the different pages. The list of reports can be sorted as desired, by clicking the desired column header in the list. To generate a particular report, click on the stat number associated with the report in the Overiew list. This brings up the "View" interface for the report.
de: Wenn das Statistikmodul installiert ist, enthält es einige vorkonfigurierte Reports. Diese können in der Übersicht aufgerufen werden. Wenn die Liste zu lang für eine Seite wird, kann der Agent durch die verschiedenen Seiten blättern. Die Liste kann durch klick auf den Spaltenkopf wie gewünscht geordnet werden. Um einen bestimmten Report zu erzeugen, klicken Sie auf die Statistiknummer des Reports in der Übersicht. Dadurch gelangen Sie in die Ansichtsseite des Reports.

source: Generate and view reports
de: Ansehen und Generieren von Statistiken

source: The view user interface provides the stat's configuration settings (see Figure 19.3 below).
de: Aufgabe der "Ansehen"-Oberfläche ist es, dem Agent einen Überblick über die Vorkonfiguration der Statistik zu ermöglichen.

source: Stat view
de: Ansicht einer Statistik

source: <emphasis>Figure 19.3. Viewing a specific report.</emphasis>
de: <emphasis>Abb. 19.3. Ansicht einer Statistik.</emphasis>

source: Configuration settings for a particular report can be set within the range of options in the View screen. Either the report creator or any others with the appropriate permissions can make the settings.
de: Konfigurationseinstellungen für einen Report können in den Optionen der Ansichtsseite eingestellt werden. Der Ersteller des Reports und jeder Agent mit den benötigten Rechten kann diese Einstellungen vornehmen.

source: The page shows the following:
de: Konkret wird auf dieser Seite folgendes angezeigt:

source: Possible actions:
de: Verfügbare Aktionen:

source: <emphasis>Go to overview</emphasis>. Link back to the Overview list of reports.
de: <emphasis>Zurück zur Übersicht</emphasis>. Zurück zur Übersichtsliste der Reports.

source: <emphasis>Edit</emphasis>. Edit the current report structure (rw rights required).
de: <emphasis>Bearbeiten</emphasis>. Die aktuelle Statistik bearbeiten (benötigt "rw"-Rechte).

source: <emphasis>Delete</emphasis>. Delete the current report (rw rights required).
de: <emphasis>Löschen</emphasis>. Die aktuelle Statistik löschen (benötigt "rw"-Rechte).

source: <emphasis>Export config</emphasis>. Export a report configuration, via file download (rw rights required).
de: <emphasis>Konfiguration exportieren</emphasis>. Exportieren einer Statistikkonfiguration mittels Dateidownload ("rw"-Rechte erforderlich).

source: Usage: Export and Import functions allow for the convenient creation and testing of reports on test systems and subsequent easy integration into the production system.
de: Verwendung: Mittels der Export- und Importfunktionen können Statistiken bequem auf Testsystemen entworfen und getestet werden, um dann anschließend einfach in das Produktivsystem integriert zu werden.

source: <emphasis>Stat#</emphasis>. Number of the report.
de: <emphasis>Statistik-Nr.</emphasis>. Die Nummer der Statistik.

source: <emphasis>Object</emphasis>. Object used for generating the report.
de: <emphasis>Objekt</emphasis>. Objekt, das für die Generierung der Statistik verwendet wird.

source: <emphasis>Description</emphasis>. Description on the report's purpose.
de: <emphasis>Beschreibung</emphasis>. Ein Auszug aus der Beschreibung der Statistik.

source: <emphasis>Format</emphasis>. Report output format which, depending on the configuration, can be any of the following output formats:
de: <emphasis>Format</emphasis>. Ausgabeformat der Statistik. Hierbei stehen je nach Konfiguration folgende Ausgabeformate zur Verfügung:

source: Print.
de: Drucken.

source: Graph-lines.
de: Liniendiagramm.

source: Graph-bars.
de: Balkendiagramm.

source: Graph-hbars.
de: Balkendiagramm (horizontal).

source: Graph-points.
de: Punktdiagramm

source: Graph-lines-points.
de: Linienpunktdiagramm.

source: Graph-area.
de: Flächendiagramm.

source: Graph-pie.
de: Tortendiagramm.

source: <emphasis>Graphsize</emphasis>. Size in pixels for the graphic / chart. This option is only given when the report configuration allows a chart. All generally usable graphic sizes are configured by the OTRS administrator in SysConfig. The agent can then pre-select all relevant formats, while configuring the report.
de: <emphasis>Grafikgröße</emphasis>. Mögliche Größe der Grafik bzw. des Diagramms. Diese Auswahl bzw. Anzeige erscheint nur, wenn die Statistikvorkonfiguration ein Diagramm vorsieht bzw. ermöglicht. Alle generell verwendbaren Grafikgrößen werden durch den otrs-Admin in der SysConfig definiert. Beim Konfigurieren der Statistiken kann dann der Ersteller alle relevanten Formate vorselektieren.

source: <emphasis>Sum rows</emphasis>. Indicates whether the report is amended by a column, whose cells state the sums of the respective rows.
de: <emphasis>Zeilensummierung</emphasis>. Gibt an, ob die Statistik durch eine Spalte ergänzt wird, deren Zellen die Summe der jeweiligen Zeile darstellt.

source: <emphasis>Sum columns</emphasis>. Indicates whether the report is amended by a row, whose cells state the sum of the respective columns.
de: <emphasis>Spaltensummierung</emphasis>. Angabe, ob die Statistik durch eine Zeile ergänzt wird, deren Zellen die Summe der jeweiligen Spalte beinhaltet.

source: <emphasis>Cache</emphasis>. Indicates whether the generated report is cached in the filesystem.
de: <emphasis>Cache</emphasis>. Gibt an, ob die errechneten Statistiken im Dateisystem gecacht werden.

source: <emphasis>Valid</emphasis>. This can be set to "invalid" if a report must not be run temporarily for any reason. The "Start" button in the bottom of the right panel is then no longer displayed. The report can no longer be generated.
de: <emphasis>Gültig</emphasis>. Ist eine vorkonfigurierte Statistik erst im Entstehen oder darf sie aus bestimmten Gründen temporär nicht mehr ausgeführt werden so wird das Element "Gültig" auf "ungültig" gesetzt. Ferner wird dadurch die Schaltfläche "Start" rechts unten am Ende des Block ausgeblendet. Ein Generieren der Statistik ist somit nicht möglich.

source: <emphasis>Created</emphasis>. Creation time of the report.
de: <emphasis>Erstellt</emphasis>. Erstellungszeit der Statistik.

source: <emphasis>Created by</emphasis>. Name of the agent who created the report.
de: <emphasis>Erstellt von</emphasis>. Agent, der die Statistik erstellt hat.

source: <emphasis>Changed</emphasis>. Time when the report was last modified.
de: <emphasis>Geändert</emphasis>. Letzte Änderungszeit der Statistik.

source: <emphasis>Changed by</emphasis>. Name of the agent who altered the report last.
de: <emphasis>Geändert von</emphasis>. Agent, der die Statistik zuletzt geändert hat.

source: <emphasis>X-axis</emphasis>. Using this function, the agent can switch the x and y axes (only when activated by the OTRS administrator).
de: <emphasis>X-Achse</emphasis>. Diese Option erlaubt es dem Agenten, die X- und Y-Achsen zu vertauschen (Diese Funktion muss vom OTRS-Administrator freigeschaltet werden).

source: The general information is followed by information about the report itself. There are two different report (or stat) views:
de: Nach den allgemeinen Angaben sieht der Agent die Angaben zur eigentlichen Statistik. Hierbei kommen grundsätzlich zwei verschiedene Anzeigen zum Einsatz:

source: <emphasis>Static stat view</emphasis>. Static report generators can be integrated into the stats module (see Figure 19.4 below).
de: <emphasis>Anzeige statischer Statistiken</emphasis>. Statische Report-Generatoren können in die Statistik integriert werden (siehe unten).

source: Static stat view
de: Ansicht der statischen Statistik

source: <emphasis>Figure 19.4. Viewing a static report.</emphasis>
de: <emphasis>Abb. 19.4. Ansicht der statischen Statistik.</emphasis>

source: <emphasis>Dynamic stat view</emphasis> (see Figure 19.3 above). They can be displayed in two different ways:
de: <emphasis>Anzeige dynamischer Statistiken</emphasis> Dynamische Statistiken können auf zweierlei Weise angezeigt werden:

source: <emphasis>Unchangeable settings</emphasis>. The originator of the report has no permission for modifying this fields.
de: <emphasis>Unveränderbare Einstellungen</emphasis>. In diesem Fall hat der Ersteller der Statistik dem Agent, der eine Statistik generieren will, keinen Freiraum für Veränderungen gelassen.

source: <emphasis>Changeable settings</emphasis>. The configuration settings of such reports can be changed by the agent.
de: <emphasis>Veränderbare Einstellungen</emphasis>. Bei derartigen Statistiken ist es dem Agent noch erlaubt die vorkonfigurierte Statistik zu verändern.

source: Pressing the "Start" button (at the bottom of the screen) is the last step to generate the report. There are two possible reasons for this button to not be displayed:
de: Um eine Statistik zu generieren, muss abschließend lediglich der "Start"-Button am rechten unteren Ende des Blocks gedrückt werden. Sollte einmal der "Start"-Button nicht sichtbar sein, kann dies zwei Ursachen haben:

source: The report was set to invalid and thus, deactivated.
de: die Statistik wurde auf ungültig gesetzt und damit deaktiviert.

source: The report was not configured cleanly and is, therefore, not yet executable. In this case, the necessary information can be found in the OTRS notification section (below the navigation bar).
de: die Statistik wurde nicht sauber konfiguriert und ist noch nicht lauffähig. Ist dies der Fall, findet man die nötigen Informationen im Notification-Bereich von OTRS (unterhalb der Navigationsleiste).

source: If the settings on the View page are incorrect, this page is shown again after the "Start" button was pushed, and information about which input was incorrect is provided in the notification section.
de: Bei falschen Einstellungen auf der Ansichtsseite wird nach Drücken des "Start"-Button wieder die Ansichtseite gezeigt und im Notificationbereich darauf hingewiesen, welche Eingaben falsch waren.

source: Edit / New
de: Bearbeiten / Neu

source: Agents with write rights can edit an existing report configuration by calling up the edit user interface of the stats module. Alternately, they may create a new report. The associated screens can be reached in the following manner:
de: Agenten mit Schreibrechten können existierende Report-Konfigurationen bearbeiten, indem sie die Bearbeitungsmaske des Statistikmoduls aufrufen. Altertativ können sie einen neuen Report erstellen. Die zugehörigen Masken können folgendermaßen aufgerufen werden:

source: Edit: Via the "Edit" button in the stat view.
de: Durch den Knopf "Bearbeiten" in der Statistikansicht.

source: New: Via the "New" link in the Statistics menu from the navigation bar, or the "Add" button from the Overview page.
de: Durch den "Neu"-Link im Statistikmenü der Navigationsleiste, oder durch den Knopf "Hinzufügen" in der Übersichtsseite.
