Repository: xhoy/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: de

source: en
de: de

source: OTRS 3.0 - Admin Manual
de: OTRS 3.0 - Administrator-Handbuch

source: This work is copyrighted by OTRS AG.
de: Dieses Werk ist geistiges Eigentum der OTRS AG.

source: You may copy it in whole or in part as long as the copies retain this copyright statement.
de: Es darf als Ganzes oder in Auszügen kopiert werden, vorausgesetzt, dieser Copyright-Vermerk befindet sich auf jeder Kopie.

source: UNIX is a registered trademark of X/Open Company Limited. Linux is a registered trademark of Linus Torvalds.
de: UNIX ist ein eingetragenes Warenzeichen von X/Open Company Limited. Linux ist ein eingetragenes Warenzeichen von Linus Torvalds.

source: MS-DOS, Windows, Windows 95, Windows 98, Windows NT, Windows 2000, Windows XP, Windows 2003, Windows Vista and Windows 7 are registered trademarks of Microsoft Corporation. Other trademarks and registered trademarks are: SUSE and YaST of SUSE Linux GmbH, Red Hat and Fedora are registered trademarks of Red Hat, Inc. Mandrake is a registered trademark of MandrakeSoft, SA. Debian is a registered trademark of Software in the Public Interest, Inc. MySQL and the MySQL Logo are registered trademarks of Oracle Corporation and/or its affiliates.
de: MS-DOS, Windows, Windows 95, Windows 98, Windows NT, Windows 2000, Windows XP, Windows 2003 und Windows Vista sind eingetragene Warenzeichen der Microsoft Corporation. Andere Warenzeichen oder registrierte Warenzeichen: SUSE und YaST von SUSE Linux GmbH, Red Hat und Fedora von Red Hat Inc., Debian von Software in the Public Interest, Inc., Mandrake von MandrakeSoft, SA. MySQL und das MySQL Logo sind eingetragene Warenzeichen Oracle Corporation und/oder verbundener Unternehmen.

source: All trade names are used without the guarantee for their free use and are possibly registered trade marks.
de: Alle Warennamen werden ohne Gewährleistung der freien Verwendbarkeit benutzt und sind möglicherweise eingetragene Warenzeichen.

source: OTRS AG essentially follows the notations of the manufacturers. Other products mentioned in this manual may be trademarks of the respective manufacturer.
de: Die Firma OTRS AG richtet sich im Wesentlichen nach den Schreibweisen der Hersteller. Andere hier genannte Produkte können Warenzeichen des jeweiligen Herstellers sein.

source: Preface
de: Vorwort

source: This book is intended for use by OTRS administrators. It also serves as a good reference for OTRS newbies.
de: Dieses Buch soll das Leben von OTRS-Administratoren und -Neulingen erleichtern.

source: The following chapters describe the installation, configuration and administration of the OTRS software. The first third of the text describes key functionality of the software, while the remainder serves as a reference to the full set of configurable parameters.
de: Dieses Kapitel beschreibt die Installation, Konfiguration und Administration von OTRS. Das erste Drittel des Textes beschreibt die Hauptfunktionalität der Software, während der Rest als Referenz aller vorhandenen Konfigurationseinstellungen dient.

source: This book continues to be a work in progress, given a moving target on new releases. We need your feedback in order to make this a high quality reference document, one that is usable, accurate and complete. Please write to us if you find content missing in this book, if things are not explained well enough or even if you see spelling mistakes, grammatical errors or typos. Any kind of feedback is highly appreciated and should be made via our bug tracking system on <ulink url="http://bugs.otrs.org"> <citetitle>http://bugs.otrs.org</citetitle> </ulink>. Thanks in advance for your contributions!
de: Da das Buch versucht, sich an den Bedürfnissen von OTRS Administratoren und OTRS Neulingen zu orientieren und da die Qualität der folgenden Kapitel so hoch wie möglich sein soll, sind wir auf Ihr Feedback angewiesen. Bitteteilen Sie uns mit, wenn Sie Abschnitte in diesem Buch vermissen, wenn Dinge für Sie unverständlich erklärt sind oder auch wenn Sie Rechtschreib-, Tipp- oder Grammatikfehler in diesem Buch entdecken. Jede Art von Rückmeldung ist ausdrücklich erwünscht und sollte durch einen Eintrag auf <ulink url="http://bugs.otrs.org"><citetitle>http://bugs.otrs.org</citetitle></ulink> an uns gerichtet werden, da sie so nicht verloren geht und direkt beim zuständigen Ansprechpartner landet. Wir bedanken uns schon jetzt für jede Art von Mithilfe!

source: Trouble Ticket Systems - The Basics
de: Trouble-Ticket-Systeme - die Grundlagen

source: This chapter offers a brief introduction to trouble ticket systems, along with explaining the core concept of a trouble ticket. A quick example demonstrates the advantages of using such a system.
de: In diesem Abschnitt soll kurz die grundlegende Idee, die hinter Trouble-Tickets im Allgemeinen und Trouble-Ticket-Systemen im Speziellen steht, erläutert werden. An einem kleinen Beispiel wird gezeigt, wo die Vorteile dieser Systeme liegen.

source: What is a trouble ticket system, and why do you need one?
de: Was ist ein Trouble-Ticket-System, und warum benötigen Sie eins?

source: The following example describes what a trouble ticket system is, and how you might benefit from using such a system at your company.
de: Das folgende Beispiel soll verdeutlichen, was ein Trouble Ticket System ist und wie Sie damit in Ihrem Unternehmen Zeit und Geld eingesparen können.

source: Let's imagine that Max is a manufacturer of video recorders. Max receives many mails from customers needing help with the devices. Some days, he is unable to respond promptly or even acknowledge the mails. Some customers get impatient and write a second mail with the same question. All mails containing support requests are stored in a single inbox file. The requests are not sorted, and Max answers the mails using a regular email program.
de: Nehmen wir an, dass Max Mustermann Fabrikant ist und Videorekorder produziert. Da die Programmierung der Videorekorder sehr unübersichtlich und kompliziert ist, wenden sich die Kunden von Herrn Mustermann gerne und häufig mit Supportanfragen per Mail an ihn. An manchen Tagen kann Herr Mustermann der Mailflut kaum Herr werden und so kommt es, dass seine Kunden sich einige Zeit gedulden müssen, bis die Antwort mit der rettenden Lösung bei ihnen eintrifft. Manchen Kunden dauert dies jedoch zu lange, eine weitere E-Mail mit dem gleichen Inhalt wird an Herrn Mustermann geschickt. Die E-Mails mit den Supportanfragen werden alle in eine INBOX weitergeleitet, wie sie von fast allen E-Mailprogrammen verwendet wird.

source: Since Max cannot reply fast enough to all the messages, he is assisted by the developers Joe and John in this. Joe and John use the same mail system, accessing the same inbox file. They don't know that Max often gets two identical requests from a desperate customer. Sometimes they both end up responding separately to the same request, with the customer receiving two different answers. Further, Max is unaware of the details of their responses. He is also unaware of the details of customer problems and their resolution, such as which problems occur with high frequency, or how much time and money he has to spend on customer support.
de: An manchen Tagen ist die Anfragewelle besonders groß und Herr Mustermann sieht sich außerstande, alle Mails noch in einem vertretbaren Zeitrahmen zu beantworten. Aus diesem Grund kommandiert er seine Entwickler Meier und Schulze zur Bearbeitung der Supportanfragen ab. Da von allen das gleiche System benutzt wird, greifen alle auf die gleiche INBOX und daher auch auf die gleichen Mails zu. Meier und Schulze haben jedoch keine Ahnung, dass manch ein Kunde in seiner Not gleich zwei E-Mails verfasst und an Herrn Mustermann geschickt hat. So kommt es vor, dass Meier die erste Mail mit einem anderen Ratschlag beantwortet als Schulze der sich im selben Moment der zweiten Nachricht des gleichen Kunden annimmt. Das Ergebnis ist, dass der Kunde unterschiedliche Antworten bekommt. Darüber hinaus hat Herr Mustermann keinen Einblick darüber, welcher Mitarbeiter wann was welchem Kunden gesagt hat, welche Probleme besonders häufig auftreten und wie groß sein gesamter Aufwand für den Kundensupport ist.

source: At a meeting, a colleague tells Max about trouble ticket systems and how they can solve Max's problems with customer support. After looking for information on the Internet, Max decides to install the Open Ticket Request System (OTRS) on a computer that is accessible from the web by both his customers and his employees. Now, the customer requests are no longer sent to Max's private inbox but to the mail account that is used for OTRS. The ticket system is connected to this mailbox and saves all requests in its database. For every new request, the system generates an auto-answer and sends it to the customer so that the customer knows that his request has arrived and will be answered soon. OTRS generates an explicit reference, the ticket number, for every single request. Customers are now happy because they receive an acknowledgement to their requests and it is not necessary to send a second message with the same question. Max, John and Joe can now login into OTRS with a simple web browser and answer the requests. Since the system locks a ticket that is answered, no message is edited twice.
de: Von einem Kollegen erfährt Herr Mustermann schließlich, dass es Trouble-Ticket-Systeme gibt, die genau die Probleme lösen, die Herr Mustermann mit dem Support für seine Kunden hat. Herr Mustermann entscheidet sich für das offene Trouble-Ticket-Request System OTRS und installiert dieses System auf einem Rechner, der über einen Webserver sowohl für seine Mitarbeiter als auch über das Internet erreichbar ist. Von nun an werden die Hilferufe der Kunden nicht mehr länger an seine private INBOX, sondern direkt an den Mail-Account für OTRS weitergeleitet. OTRS hat eine Schnittstelle zur INBOX für die Supportanfragen, so dass alle ankommenden E-Mails automatisch ins Trouble Ticket System eingespeist werden. Unabhängig ob Herr Mustermann nun gerade anwesend ist oder nicht, generiert OTRS eine automatische Antwort und teilt dem Kunden mit, dass seine E-Mail angekommen ist und so schnell wie möglich bearbeitet wird. Dabei wird eine eindeutige Trouble Ticket Nummer vergeben. Der Kunde ist glücklich, dass sein Flehen schnell erhört wurde und wartet gespannt auf eine Antwort. Sowohl Herr Mustermann als auch die Entwickler Meier und Schulze können nun über einen beliebigen Internetbrowser und die Weboberfläche von OTRS auf die Supportanfragen zugreifen und diese einzeln beantworten. Da die Tickets bei Beantwortung gesperrt werden, wird keine Nachricht versehentlich zweimal erstellt.

source: Let's imagine that Mr. Smith makes a request to Max's company, and his message is processed by OTRS. John gives a brief reply to his question. But Mr. Smith has a follow-up question, which he posts via a reply to John's mail. Since John is busy, Max now answers Mr. Smith's message. The history function of OTRS allows Max to see the full sequence of communications on this request, and he responds with a more detailed reply. Mr. Smith does not know that multiple service representatives were involved in resolving his request, and he is happy with the details that arrived in Max's last reply.
de: Stellen wir uns vor, dass Herr Schmidt eine Anfrage ans System gestellt hat und Herr Meier diese kurz und knapp beantwortet. Herrn Schmidt reicht diese Antwort jedoch nicht aus und so antwortet er auf die Lösungsmail am folgenden Tag. Herr Meier ist jedoch gerade mit anderen Dingen beschäftigt, so dass sich Herr Mustermann der Sache annimmt. Über die History-Funktion von OTRS kann er jetzt auf alle vergangenen E-Mails von Herrn Schmidt und Herrn Meier zugreifen, deren Inhalt abfragen und eine ausführlichere Antwort versenden. Herr Schmidt erhält nun die Lösung für sein Problem, weiß aber nicht, dass diese von unterschiedlichen Personen stammt.

source: Of course, this is only a short preview of the possibilities and features of trouble ticket systems. But if your company has to attend to a high volume of customer requests through mails and phone calls, and if different service representatives need to respond at different times, a ticket system can be of great help. It can help streamline work flow processes, add efficiencies and improve your overall productivity. A ticket system helps you to flexibly structure your Support or Help Desk environment. Communications between customers and service staff become more transparent. The net result is an increase in service effectiveness. And no doubt, satisifed customers will translate into better financial results for your company.
de: Natürlich ist dies nur ein sehr kleiner Einblick in die Funktionalitäten von Trouble Ticket Systemen. Da Herr Mustermann eine kleine Firma führt, erhält er vielleicht nur wenige E-Mails mit Supportanfragen pro Tag, die er vielleicht noch ganz überschaulich mit seiner normalen Mailsoftware handhaben kann und somit kein Trouble Ticket System braucht. Wenn aber der neue DVD-Rekorder in die Regale kommt, werden es vielleicht schon 500 oder in ein paar Jahren schon 10.000 Nachrichten pro Tag sein. Spätestens dann rechnet sich der Einsatz von Trouble-Ticket-Systemen wie OTRS.

source: What is a trouble ticket?
de: Was ist ein Trouble-Ticket?

source: A trouble ticket is similar to a medical report created for a hospital patient. When a patient first visits the hospital, a medical report is created to hold all necessary personal and medical information on him. Over multiple visits, as he is attended to by the same or additional doctors, the attending doctor updates the report by adding new information on the patient's health and the ongoing treatment. This allows any other doctors or the nursing staff to get a complete picture on the case at hand. When the patient recovers and leaves the hospital, all information from the medical report is archived and the report is closed.
de: Ein Trouble-Ticket lässt sich im Wesentlichen mit einem Krankenblatt eines Krankenhauspatienten vergleichen. Bei der erstmaligen Einlieferung in das Krankenhaus wird das Krankenblatt im Zuge der Anamnese neu angelegt. Jeder Arzt trägt nun seine Diagnose sowie die verordnete Therapie und Medikation ein und dokumentiert deren Erfolg. Das Krankenblatt gibt nun einen schnellen Überblick, gewährleistet eine schnelle Einarbeitung und verhindert eineMehrfachdosierung von Medikamenten. Ist die Krankheit besiegt und der Patient entlassen, wird das Krankenblatt archiviert.

source: Trouble ticket systems such as OTRS handle trouble tickets like normal email. The messages are saved in the system. When a customer sends a request, a new ticket is generated by the system which is comparable to a new medical report being created. The response to this new ticket is comparable to a doctor's entry in the medical report. A ticket is closed if an answer is sent back to the customer, or if the ticket is separately closed by the system. If a customer responds again on an already closed ticket, the ticket is reopened with the new information added. Every ticket is stored and archived with complete information. Since tickets are handled like normal emails, attachments and contextual annotations will be stored too with every email. Also, information on relevant dates, employees involved, working time needed for ticket resolution etc. are also saved. At any later stage, tickets can be sorted, and it is possible to search through and analyze all information using different filtering mechanisms.
de: Im OTRS werden Trouble Tickets, also die Krankenblätter aus dem obigen Beispiel, als normale E-Mails behandelt und gespeichert. Schicktz. B. ein Kunde eine Anfrage an das Trouble Ticket System, wird das Krankenblatt eingerichtet, ein neues Ticket wird geöffnet. Die Antwort eines Mitarbeiters auf die Anfrage kann als Eintrag eines Arztes gesehen werden, eine erneute Antwort bzw. Anfrage des Kundens auf das selbe Ticket als Veränderung oder Erweiterung des Krankheitsbildes. Ein Ticket gilt als erledigt bzw. geschlossen, wenn eine Antwort auf die Anfrage an den Kunden zurückgesendet wurde oder das Ticket über das System alsgeschlossen markiert wird. Antwortet ein Kunde auf ein bereits geschlossenes Ticket, so wird es erneut geöffnet und die neuen Informationen ergänzt. Um die Konsistenz der Daten sicherzustellen, werden alle Tickets mit all ihren spezifischen Informationen archiviert und verbleiben im System. Durch die Speicherung der Tickets als ganznormale E-Mails ist es möglich, dass diese auch E-Mail-Anhänge enthalten können. Zusätzlich zu den normalen Informationen einer E-Mail lassen sich beliebige Notizen zu jedem Ticket hinzufügen. Die Tickets selbst werden auf der Festplatte bzw. in einer Datenbank archiviert, ebenso zusätzliche Meta-Informationen des Tickets wie Notizen, an der Beantwortung des Tickets beteiligte Mitarbeiter, Zeit und Datum der Bearbeitung, Bearbeitungsdauer usw. Eine Sortierung oder eine Suche über den Datenbestand wird mit Hilfe aller vorhandenen Informationen zu den Tickets realisiert.

source: This chapter describes the features of the Open Ticket Request System (OTRS). You will find information about the hardware and software requirements for OTRS. Additionally, this chapter tells you how to get commercial support for OTRS, should you require it, and how to contact the community.
de: In diesem Abschnitt werden die Features des Open Ticket Request Systems (OTRS) vorgestellt. Des Weiteren wird näher auf die Systemanforderungen von OTRS eingegangen und erläutert, wie Kontakt zur OTRS-Community aufgenommen werden kann bzw. wie kommerzieller Support erhältlich ist.

source: Basics
de: Grundlagen

source: The Open Ticket Request System (OTRS) is a web application which can be used with every HTML-compatible web browser. The web interface of OTRS does not use active web content like Flash or Java applets to ensure that the system is usable with mobile phones or other mobile computers. To use OTRS, no special client operating system is necessary; only an HTML browser is needed.
de: Das Open Ticket Request System (OTRS) ist eine Webapplikation, die mit jedem HTML kompatiblen Browser benutzt werden kann. OTRS verzichtet bewusst auf aktive Webkomponenten wie z. B. Javaskript, JavaApplets und Flash. Dadurch wird es möglich, das System nicht nur über einen PC, sondern auch von Mobiltelefonen und anderen Handcomputern, welche HTML unterstützen, zu benutzen. Als Client kann jedes Betriebssystem eingesetzt werden.

source: OTRS is separated into several components. The basic component is the OTRS framework that contains all central functions for the application and the ticket system. Via the web interface of the central OTRS framework, it is possible to install additional applications like a web mailer, a content manager, a file manager, a web calendar and a tool to monitor system status information.
de: OTRS ist in mehrere Komponenten aufgeteilt. Als Basis wird ein Framework benötigt, der alle grundlegenden Funktionen des Systems und das Trouble Ticket System enthält. An zusätzlichen Komponenten können ein Webmailer, ein Dateimanager, ein Contentmanager, ein Kalender und ein Modul zur Ausgabe verschiedener Systemstatus bequem über die Weboberfläche nachinstalliert werden.

source: OTRS has many features. The following list gives an overview of the features included in the central framework.
de: OTRS bietet viele verschiedene Features. Die folgende Aufzählung gibt einen Überblick über die wichtigsten Eigenschaften und Fähigkeiten des zentralen OTRS-Frameworks.

source: The features of OTRS
de: Die Features von OTRS

source: Easy and initial handling with a web browser.
de: Einfache und intuitive Bedienung mit einem Web-Browser.

source: Because no active web contents like Flash or Java applets are used, the web interface is usable with most web browsers, even with mobile phones or other mobile computers.
de: Auf aktive Inhalte wie Flash oder Java-Applets wird in der Weboberfläche bewusst verzichtet. Das System kann somit mit nahezu allen Browsern benutzt werden, auch von Mobiltelefonen oder Handcomputern aus.

source: A web interface to administer the system via the web is available.
de: Eine Web-Oberfläche zur Administration des Systems ist vorhanden.

source: A web interface to handle customer requests by employees/agents via the web is integrated.
de: Ein Webinterface für die Mitarbeiter (Agenten) zur Bearbeitung von Kundenanfragen ist verfügbar.

source: A web interface for customers is available to write new tickets, check the state and answer old tickets and search through their own tickets.
de: Eine Weboberfläche für Kunden, über die Nachrichten an zuständige Agenten geschickt werden können und der Status eigener Tickets abgerufen werden kann, ist vorhanden.

source: The web interface can be customized with different themes; own themes can be integrated.
de: Unterstützung für verschiedene Oberflächen-Layouts (Themes).

source: Support for many languages.
de: Unterstützung vieler Sprachen.

source: The appearance of output templates can be customized (dtl).
de: Eigene Anpassungen der Ausgabe-Vorlagen sind möglich (DTL).

source: Mails from and into the system can contain multiple attachments.
de: Mehrfach-Anhänge von Emails sind über die Weboberfläche möglich.

source: Mail interface:
de: E-Mail-Schnittstelle:

source: Support for mail attachments (MIME support).
de: Unterstützung für E-Mail-Anhänge (MIME)

source: Automatic conversion of HTML into plain text messages (more security for dangerous content and enables faster searching).
de: Automatische Umwandlung von HTML- in reine Text-Nachrichten (höhere Sicherheit vor schädlichen Inhalten und schneller durchsuchbar).

source: Mail can be filtered with the X-OTRS headers of the system or via mail addresses, e.g. for spam messages.
de: Filterung von E-Mails über eigene X-Header-Einträge oder Mailadressen, z. B. für die Aussortierung von Spam.

source: PGP support, creation and import of own keys, signing and encrypting outgoing mail, signed and encrypted messages can be displayed.
de: PGP-Support, Erstellung und Import eigener Zertifikate, verschlüsselter und signierter Mails, Anzeige von verschlüsselten und signierten Nachrichten.

source: Support for viewing and encrypting S/MIME messages, handling of S/MIME certificates.
de: Unterstützung für die Verschlüsselung und Anzeige von SMIME-Nachrichten.

source: Auto answers for customers, configurable for every queue.
de: Automatisierte Antworten (auto responder) für die Benachrichtigung von Kunden, abhängig von der Queue konfigurierbar.

source: Email notifications for agents about new tickets, follow-ups or unlocked tickets.
de: E-Mail-Benachrichtigungen für Agenten über neue Tickets, Follow-ups oder freigegebene Tickets.

source: Follow-ups by references or In-Reply-To header entries.
de: Follow-Ups anhand von Reference- oder In-Reply-To-Headern, automatisierte Zuordnung von Follow-Ups über den Ticket-Bezeichner im Betreff, Mailbody oder in Text-Anhängen.

source: Expanded queue view, fast overview of new requests in a queue.
de: Erweiterte Queue-Ansicht, Übersicht über alle Anfragen innerhalb einer Queue.

source: Tickets can be locked.
de: Sperren von Tickets.

source: Creation of own auto answer templates.
de: Erstellung eigener Antwortvorlagen.

source: Creation of own auto responders, configurable for every queue.
de: Erstellung eigener auto responder, abhängig von der Queue.

source: Ticket history, overview of all events for a ticket (changes of ticket states, replies, notes, etc.).
de: Ticket-History, Übersicht über die komplette Entwicklung eines Tickets, Änderungen der Ticketstatus, Übersicht über die verschidenen Aktionen für ein Ticket usw.

source: Print view for tickets.
de: Druckansicht für Tickets, Export als PDF möglich.
