Repository: xhoy/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: de

source: OTRS Group provides subscription support services, customization, consulting and training for <ulink url="http://www.otrs.com/en/products/help-desk/"> <citetitle>OTRS Help Desk</citetitle></ulink> and <ulink url="http://www.otrs.com/en/products/itsm/"> <citetitle>OTRS ITSM</citetitle></ulink>. It also provides <ulink url="http://www.otrs.com/solutions/"><citetitle>Best Practice Product Editions</citetitle></ulink>. With these Editions, OTRS Group helps organizations to design, deploy and optimize OTRS for each unique environment. Additionally, OTRS Group provides hosted versions including <ulink url="http://www.otrs.com/en/solutions/ondemand/"><citetitle>OTRS OnDemand </citetitle></ulink> and <ulink url="http://www.otrs.com/en/solutions/managed-otrs/"><citetitle>Managed OTRS</citetitle></ulink>.
de: Die OTRS Gruppe bietet Support, Anpassungen, Beratung und Schulungen für <ulink url="http://www.otrs.com/de/products/help-desk/"> <citetitle>den OTRS Help Desk</citetitle></ulink> und <ulink url="http://www.otrs.com/de/products/itsm/"> <citetitle>OTRS ITSM</citetitle></ulink> an. Zusätzlich sind <ulink url="http://www.otrs.com/solutions/"><citetitle>Best Practice Product Editions</citetitle></ulink> erhältlich. Mit letzteren unterstützt die OTRS Gruppe Organisationen dabei, OTRS für ihre jeweilige Umgebung anzupassen, zum Einsatz zu bringen und zu optimieren.Weiterhin bietet die OTRS Gruppe gehostete Versionen an, inklusive <ulink url="http://www.otrs.com/de/solutions/ondemand/"><citetitle>OTRS OnDemand </citetitle></ulink> und <ulink url="http://www.otrs.com/de/solutions/managed-otrs/"><citetitle>Managed OTRS</citetitle></ulink>.

source: You can find more detailed information about OTRS Group on <ulink url="http://www.otrs.com"> <citetitle>http://www.otrs.com</citetitle> </ulink> and you can contact us via email on <ulink url="mailto:sales@otrs.com"> <citetitle>sales at otrs.com</citetitle> </ulink> .
de: Detailliertere Informationen über die OTRS Gruppe können Sie unter <ulink url="http://www.otrs.com"> <citetitle>http://www.otrs.com</citetitle> </ulink> finden oder über die Kontaktadresse <ulink url="mailto:sales at otrs.com"> <citetitle>sales at otrs.com</citetitle> </ulink> erfragen.

source: This chapter describes the installation and basic configuration of the central OTRS framework. It covers information on installing OTRS from source, or with a binary package such as an RPM or a Windows exectuable.
de: Dieser Abschnitt beschreibt die Installation und die grundlegende Einrichtung des zentralen OTRS Frameworks. Dabei wird die Installation von OTRS aus dem Quellcode erläutert, wie auch über Binärpakete wie RPM oder ausführbare Dateien für Windows.

source: Topics covered here include configuration of the web and database servers, the interface between OTRS and the database, the installation of additional Perl modules, setting proper access rights for OTRS, setting up the cron jobs for OTRS, and some basic settings in the OTRS configuration files.
de: Dieses Kapitel beschreibt die Einrichtung des Web- und Datenbankservers, die Schnittstelle zwischen OTRS und der Datenbank, das Einspielen einzelner Perl-Module, das Setzen der richtigen Berechtigungen, die Einrichtung der OTRS-eigenen cron-Jobs sowie grundlegende Einstellungen in den OTRS-Konfigurationsdateien.

source: Follow the detailed steps in this chapter to install OTRS on your server. You can then use its web interface to login and administer the system.
de: Folgen Sie den Schritten in diesem Kapitel, um OTRS auf Ihrem Server zu installieren. Dann können Sie sich über die Weboberfläche anmelden und das System administrieren.

source: The simple way - Installation of pre-built packages
de: Der einfache Weg - Installation fertiger Pakete

source: You should use pre-built packages to install OTRS, since it is the simplest and most convenient method. You can find them in the download area at <ulink url="http://www.otrs.org"> <citetitle>http://www.otrs.org</citetitle> </ulink> . The following sections describe the installation of OTRS with a pre-built or binary package on SUSE, Debian and Microsoft Windows systems. Only if you are unable to use the pre-built packages for some reason should you follow the manual process.
de: Der einfachste und komfortableste Weg ein lauffähiges OTRS zu installieren ist sicherlich, auf bereits vorgefertigte Pakete zurück zu greifen. Viele bereits vorgefertigte Installations-Pakete sind im Download-Bereich unter <ulink url="http://www.otrs.org"><citetitle>http://www.otrs.org</citetitle></ulink> zu finden. Da der Aufwand viel zu groß wäre, die Installation aller dort aufgeführten Pakete in dieser Dokumentation anzuführen, soll im Folgenden nur näher auf die Installation von OTRS unter SUSE Linux, Debian und Microsoft Windows eingegangen werden. Sehen Sie unter der o.g. URL nach, ob auch für Ihr Betriebssystem ein fertiges Installations-Paket vorhanden ist und greifen Sie nur auf die manuelle Installation zurück, wenn Sie keine andere Möglichkeit haben.

source: Installing the RPM on a SUSE Linux server
de: Installation des RPM auf einem SuSE-Linux-Server

source: This section demonstrates the installation of a pre-built RPM package on a SUSE Linux distro. We have tested against all recent SLES and OpenSUSE versions. Before you start the installation, please have a look at <ulink url="http://www.otrs.org/downloads"> <citetitle>http://www.otrs.org/downloads</citetitle> </ulink> and check if a newer OTRS RPM package is available. Always use the latest RPM package.
de: Dieser Abschnitt beinhaltet die Anleitung für die Installation von OTRS unter SUSE Linux. Getestet wurden die Versionen auf allen aktuellen Versionen von SLES und OpenSUSE. Bevor Sie mit der Installation beginnen, sehen Sie bitte unter <ulink url="http://www.otrs.org/downloads"><citetitle>http://www.otrs.org/downloads</citetitle></ulink> nach, ob eine aktuellere Version von OTRS als .rpm-Datei vorliegt. Sollte dies der Fall sein, verwenden Sie bitte diese neuere Version.

source: Install OTRS with <application>yast</application> (yast2) or via the command line and <command>rpm</command>. OTRS needs some Perl modules which are not installed on a SUSE system by default, and so we recommend using <application>yast</application>, since it addresses the package dependencies automatically.
de: Installieren Sie OTRS mittels <application>yast</application> (yast2) oder der Kommandozeile und <command>rpm</command>, je nach Vorliebe. Beachten Sie jedoch, dass OTRS einige Perl-Module benötigt, die nicht standardmäßig in einer typischen SUSE-Installation enthalten sind. <application>yast</application> sollte die bessere Wahl sein, da es alle Abhängikeiten automatisch beachtet und auflösen kann.

source: If you decide to install OTRS via the command line and <command>rpm</command>, first you have to manually install the needed Perl modules. Assuming you saved the file <filename>otrs.rpm</filename> in the directory <filename>/tmp</filename>, you can execute the command specified in Script 3.1 to install OTRS.
de: Sollten Sie den Weg über die Kommandozeile mit <command>rpm</command> bevorzugen, so müssen Sie die Perl-Module manuell vor Beginn der Installation von OTRS installieren. Angenommen Sie haben die Datei <filename>otrs.rpm</filename> im Verzeichnis <filename>/tmp</filename> gespeichert, dann geben Sie zur Installation von OTRS folgenden Befehl ein.

source: Note: If you install it on SLES9 or OES, follow this description to install the missing perl-GD packages. http://faq.otrs.org/otrs/public.pl?FAQID=49
de: Hinweis: Wenn Sie es auf SLES9 oder OES installieren, dann folgen Sie bitte dieser Anleitung, um die fehlenden perl-GD Pakete zu installieren: http://faq.otrs.org/otrs/public.pl?FAQID=49.

source: <emphasis>Script 3.1. Command to install OTRS.</emphasis>
de: <emphasis>Skript 3.1. Kommando für die Installation von OTRS.</emphasis>

source: After the installation of the OTRS RPM package, you have to run <application>SuSEconfig</application>, as shown in Script 3.2.
de: Nach der Installation des rpm's ist es notwendig, <application>SuSEconfig</application> zu starten. Geben Sie hierzu Folgendes ein.

source: <emphasis>Script 3.2. Running the SuSEconfig command.</emphasis>
de: <emphasis>Skript 3.2. Ausführung des Kommandos SuSEconfig.</emphasis>

source: The OTRS installation is done. Restart your web server to load the OTRS specific changes in its configuration, as shown in Script 3.3.
de: Die Installation des OTRS-rpm ist abgeschlossen. Starten Sie nun Ihren Webserver neu, um die Änderungen in der Konfiguration zu übernehmen.

source: <emphasis>Script 3.3. Restarting the web server.</emphasis>
de: <emphasis>Skript 3.3. Neustart des Webservers.</emphasis>

source: The next step is to setup the OTRS database, as described at <link linkend="database-configuration">section 3.2.4.</link>
de: Der nächste Schritt ist das Aufsetzen der Datenbank wie in <link linkend="database-configuration"> dem Abschnitt über die Datenbankkonfiguration </link> beschrieben.

source: Installing OTRS on a CentOS system
de: Installation von OTRS auf einem CentOS-System

source: On the OTRS Wiki you can find detailed instructions for setting up OTRS on a CentOS system. Please note that these instructions will also apply to RedHat systems since they use the same source: <ulink url="http://wiki.otrs.org/index.php?title=Installation_of_OTRS_3.0b1_on_CentOS_5.5"> http://wiki.otrs.org/index.php?title=Installation_of_OTRS_3.0b1_on_CentOS_5.5 </ulink> .
de: Im OTRS-Wiki finden Sie detaillierte Anweisungen für das Aufsetzen unter CentOS, die auch für die Installation unter RedHat gelten, weil beide Systeme auf derselben Basis aufsetzen: <ulink url="http://wiki.otrs.org/index.php?title=Installation_of_OTRS_3.0b1_on_CentOS_5.5"> http://wiki.otrs.org/index.php?title=Installation_of_OTRS_3.0b1_on_CentOS_5.5 </ulink> .

source: Installing OTRS on a Debian system
de: Installation von OTRS auf einem Debian-System

source: On the OTRS Wiki you can find detailed instructions for setting up OTRS on a Debian system: <ulink url="http://wiki.otrs.org/index.php?title=Installation_on_Debian_5.04_lenny"> http://wiki.otrs.org/index.php?title=Installation_on_Debian_5.04_lenny </ulink> .
de: Im OTRS-Wiki finden Sie detaillierte Anweisungen für die Installation unter Debian: <ulink url="http://wiki.otrs.org/index.php?title=Installation_on_Debian_5.04_lenny"> http://wiki.otrs.org/index.php?title=Installation_on_Debian_5.04_lenny </ulink>.

source: Installing OTRS on a Ubuntu system
de: Installation von OTRS auf einem Ubuntu-System

source: On the OTRS Wiki you can find detailed instructions for setting up OTRS on an Ubuntu system: <ulink url="http://wiki.otrs.org/index.php?title=Installation_on_Ubuntu_Lucid_Lynx_(10.4)"> http://wiki.otrs.org/index.php?title=Installation_on_Ubuntu_Lucid_Lynx_(10.4) </ulink> .
de: Im OTRS-Wiki finden Sie detaillierte Anweisungen für die Installation unter Ubuntu: <ulink url="http://wiki.otrs.org/index.php?title=Installation_on_Ubuntu_Lucid_Lynx_(10.4)"> http://wiki.otrs.org/index.php?title=Installation_on_Ubuntu_Lucid_Lynx_(10.4) </ulink>.

source: Installing OTRS on Microsoft Windows systems
de: Installation von OTRS auf Microsoft Windows-Systemen

source: Installing OTRS on a Microsoft Windows system is very easy. Download the latest installer for Win32 from <ulink url="http://www.otrs.org/downloads/"> <citetitle>http://www.otrs.org/downloads/</citetitle> </ulink> and save the file to your local file system. Then simply double-click on the file to execute the installer, and follow the few installation steps to setup the system. After that you will be able to login as OTRS administrator and configure the system according to your needs. To log in as OTRS administrator use the username 'root@localhost' and the default password 'root'.
de: Die Installation von OTRS unter Microsoft Windows ist denkbar einfach. Laden Sie den auf <ulink url="http://www.otrs.org/downloads/"><citetitle>http://www.otrs.org/downloads/</citetitle></ulink> bereit gestellten Installer herunter und speichern Sie die Datei. Anschließend führen Sie den Installer einfach aus und folgen den einzelnen Installationsschritten. Danach können Sie sich als OTRS-Administrator am System anmelden und dieses weiter konfigurieren. Um sich als Administrator anzumelden, verwenden Sie den Benutzernamen 'root@localhost' und das voreingestellte Passwort 'root'.

source: Please change the password for the 'root@localhost' account as soon as possible.
de: Bitte ändern Sie das Passwort für den Benutzer 'root@localhost' umgehend.

source: The Win32 installer for OTRS contains all needed components for OTRS, i.e. the <application>Apache</application> web server, the <application>MySQL</application> database server, <application>Perl</application> (with all needed modules) and <application>Cron</application> for Windows. For that reason you should only install OTRS on Windows systems that don't already have an installation of <application>Apache</application> or another web server, or <application>MySQL</application>.
de: Der Windows-Installer für OTRS beinhaltet bereits alle Komponenten, die für den Betrieb von OTRS benötigt werden. D.h., es wird zusätzlich zum eigentlichen OTRS der <application>apache2</application> Webserver, <application>MySQL</application>, <application>Perl</application> mit den für OTRS benötigten Modulen und<application>cron</application> für Windows installiert. Aus diesem Grund ist es empfehlenswert OTRS über den Installer nur auf solchen Windowssystemen zu installieren, auf denen noch kein <application>apache2</application> bzw. ein anderer Webserver und kein <application>MySQL</application> läuft.

source: Installation from source (Linux, Unix)
de: Manuelle Installation (Linux, Unix)

source: Preparing the installation from source
de: Vorbereiten der manuellen Installation

source: If you want to install OTRS from source, first download the source archive as .tar.gz, .tar.bz2, or .zip file from <ulink url="http://www.otrs.org/downloads/"> <citetitle>http://www.otrs.org/downloads/</citetitle> </ulink>
de: Wenn Sie OTRS manuell über die Quellen installieren möchten oder müssen, laden Sie sich zuerst das aktuelle Archiv herunter. Sie finden die entsprechenden .tar.gz- oder .tar.bz2-Dateien im Downloadbereich auf <ulink url="http://www.otrs.org/downloads/"><citetitle>http://www.otrs.org/downloads</citetitle></ulink>.

source: Unpack the archive (for example, using <command>tar</command>) into the directory <filename>/opt</filename>, and rename the directory from otrs-3.0 to otrs (see Script 3.4 below).
de: Entpacken Sie das Archiv mit Hilfe von <command>tar</command> z. B. in das Verzeichnis <filename>/opt</filename> und benennen Sie das entpackte Verzeichnis von 'otrs-3.0.x' in 'otrs' um:

source: <emphasis>Script 3.4. First steps to install OTRS.</emphasis>
de: <emphasis>Skript 3.4. Erste Schritte bei der Installation von OTRS.</emphasis>

source: OTRS should NOT be run with root rights. You should add a new user for OTRS as the next step. The home directory of this new user should be <filename>/opt/otrs</filename>. If your web server is not running with the same user rights as the new 'otrs' user, which is the case on most systems, you have to add the new 'otrs' user to the group of the web server user (see Script 3.5 below).
de: Da die Skripte von OTRS später nicht mit root-Rechten laufen sollen, muss im nächsten Schritt ein Benutzer für OTRS im System angelegt werden. Dieser Benutzer sollte als Homeverzeichnis das Verzeichnis erhalten, in das gerade die Quellen von OTRS entpackt wurden, also<filename>/opt/otrs</filename>. Wird der Webserver unter einem anderen Benutzer als dem OTRS-User betrieben, so muss der neue OTRS-Benutzer noch zur Gruppe des Webserver-Users hinzugefügt werden.

source: <emphasis>Script 3.5. Adding a new user 'otrs', and adding it to a group.</emphasis>
de: <emphasis>Skript 3.5. Anlegen eines neuen Nutzers 'otrs' und Hinzufügung zu desselben zu einer Gruppe.</emphasis>

source: Next, you have to copy some sample configuration files. The system will later use the copied files. The files are located in <filename>/opt/otrs/Kernel</filename> and <filename>/opt/otrs/Kernel/Config</filename> and have the suffix .dist (see Script 3.6 below).
de: Im nächsten Schritt werden einige Demo-Konfigurationsdateien innerhalb der entpackten Quelldateien bzw. innerhalb des Homeverzeichnisses des OTRS-Benutzers kopiert. Die Dateien befinden sich in den Verzeichnissen <filename>/opt/otrs/Kernel</filename> bzw. <filename>/opt/otrs/Kernel/Config</filename> und haben die Endung .dist.

source: <emphasis>Script 3.6. Copying some sample files.</emphasis>
de: <emphasis>Skript 3.6. Kopieren von Beispieldateien.</emphasis>

source: The last step to prepare the installation of OTRS is to set the proper access rights for the files. You can use the script <command>otrs.SetPermissions.pl</command>, which is located in the <filename>bin</filename> directory, in the home directory of the 'otrs' user. You can execute the script with the following parameters:
de: Zum Abschluss der Vorbereitungen werden noch die richtigen Zugriffsrechte für die Dateien des Ticket Systems gesetzt. Dazu kann das Skript <command>SetPermissions.sh</command> verwendet werden, das sich im Verzeichnis <filename>bin</filename> innerhalb des Homeverzeichnisses des OTRS-Benutzers befindet. Das Skript kann mit folgenden Parametern aufgerufen werden:

source: <command>otrs.SetPermissions.pl</command> <arg choice='req'> <replaceable>Home directory of the OTRS user</replaceable> </arg> <arg choice='req'> --otrs-user= <replaceable>OTRS user</replaceable> </arg> <arg choice='req'> --web-user= <replaceable>Web server user</replaceable> </arg> <arg choice='opt'> --otrs-group= <replaceable>Group of the OTRS user</replaceable> </arg> <arg choice='opt'> --web-group= <replaceable>Group of the web server user</replaceable> </arg>
de: <command>otrs.SetPermissions.pl</command> <arg choice='req'> <replaceable>Homedirectory des OTRS Benutzers</replaceable> </arg> <arg choice='req'> <replaceable>OTRS Benutzer</replaceable> </arg> <arg choice='req'> <replaceable>Webserver Benutzer</replaceable> </arg> <arg choice='opt'> <replaceable>Gruppe des OTRS Benutzers</replaceable> </arg> <arg choice='opt'> <replaceable>Gruppe des Webserver Benutzers</replaceable> </arg>

source: If your web server is running with the same user rights as user 'otrs', the command to set the proper access rights is <command>otrs.SetPermissions.pl /opt/otrs --otrs-user=otrs --web-user=otrs</command>. On SUSE systems the web server is running with the user rights of 'wwwrun'. On Debian-based systems this is 'www-data'. You would use the command <command>otrs.SetPermissions.pl /opt/otrs --otrs-user=otrs --web-user=wwwrun --otrs-group=nogroup --web-group=www</command> to set the proper access rights.
de: Läuft Ihr Webserver mit den Benutzerrechten des Benutzers 'otrs', dann lautet das Kommando also<command>otrs.SetPermissions.pl /opt/otrs --otrs-user=otrs --web-user=otrs</command>. Unter SUSE Linux wird der Webserver mit dem Benutzer wwwrun betrieben. Auf Debian-basierten Systemen ist dies www-data. Geben Sie hier das Komando <command>otrs.SetPermissions.pl /opt/otrs --otrs-user=otrs --web-user=wwwrun --otrs-group=nogroup --web-group=www</command> ein, um die korrekten Zugriffsrechte zu setzen.

source: Installation of Perl modules
de: Installation der für OTRS benötigten Perl-Module

source: OTRS needs some additional Perl modules, as described in Table 3-1. If you install OTRS from source, you will have to install these modules manually. This can be done either with the package manager of your Linux distribution (<application>yast</application>, <application>apt-get</application>) or, as described in this section, through the Perl shell and CPAN. If you're using ActiveState Perl, for instance on Windows, you could use PPM, the built-in Perl Package Manager. We recommend using your package manager if possible.
de: Für den Betrieb von OTRS werden einige Perl-Module benötigt. Wenn Sie OTRS manuell einrichten, müssen Sie wahrscheinlich einige dieser Module per Hand nachinstallieren. Dies können Sie entweder über den Paketmanager ihrer Distribution erledigen (<application>yast</application>, <application>apt-get</application>), oder, wie in diesem Kapitel beschrieben, direkt über die Shell von <application>Perl</application> und CPAN. Wir empfehlen die Verwendung des Paketmanagers, wenn möglich.

source: Needed Perl modules for OTRS
de: Die folgenden Perl-Module werden von OTRS benötigt.

source: Description
de: Beschreibung

source: Establishes a connection to the database back-end.
de: Dieses Modul wird von OTRS für die Verbindung zum Datenbank-Backend benötigt.

source: Contains special functions to connect to the MySQL database back-end (only required if MySQL is used).
de: Modul zum Verbindungsaufbau zum MySQL-Datenbank-Backend (nur benötigt bei Verwendung von MySQL).

source: Contains special functions to connect to the PostgreSQL database back-end (only required if PostgreSQL is used).
de: Modul zum Verbindungsaufbau zum PostgreSQL-Datenbank-Backend (nur benötigt bei Verwendung von PostgreSQL).

source: Allows the use of the md5 algorithm.
de: Ermöglicht die Verwendung des md5-Algorithmus.

source: Minifies a CSS file and writes the output directly to another file.
de: Komprimiert eine CSS-Datei und schreibt das Ergebnis in eine andere Datei.

source: Provides interoperable MD5-based crypt functions.
de: Stellt MD5-basierte kryptographische Funktionen bereit.

source: Encodes / decodes Base64 strings, e.g. for mail attachments.
de: Kodiert / dekodiert Zeichenketten in Base64, z. B. für E-Mail-Anhänge.

source: Minifies a JavaScript file and writes the output directly to another file.
de: Komprimiert eine JavaScript-Datei und schreibt das Ergebnis in eine andere Datei.

source: Perl interface to the domain name system.
de: Perl-Interface zum DNS-System.

source: Processes HTTP requests.
de: Verarbeitet HTTP-Anfragen.

source: Perl interface to a LDAP directory (only required if an LDAP back-end is used).
de: LDAP-Schnittstelle für Perl (nur benötigt, wenn LDAP verwendet wird).

source: Interface to the GD graphics library (only required if the OTRS stats module is used).
de: Schnittstelle zur Gd Graphics Library. Wird nur benötigt, wenn das Statistikmodul von OTRS verwendet werden soll.

source: Some more text and graphic tools for the GD graphics library (only required if the OTRS stats module is used).
de: Text- und Grafikwerkzeuge für die Benutzung zusammen mit der GD Graphics Library. Diese Komponenten werden nur benötigt, wenn das Statistikmodul von OTRS verwendet werden soll.

source: Needed to generate the PDF output for reports, search results and for the ticket print view.
de: Diese Module werden für die Generierung der PDF-Ausgaben von Statistiken, Suchergebnissen oder Druckansicht eines Tickets benötigt.

source: You can verify which modules you need to install with <command>otrs.CheckModules.pl</command>. This script is located in the <filename>bin</filename> directory, in the home directory of the 'otrs' user (see Script 3.7 below).
de: Sie können herausfinden, welche Module noch zu installieren sind, indem Sie das Skript <command>otrs.checkModules</command> verwenden. Das Skript finden sie im Verzeichnis <filename>bin</filename> innerhalb des Homeverzeichnisses des Benutzers 'otrs'.

source: Please note that some modules are optional.
de: Beachten Sie, dass einige Module optional sind.

source: <emphasis>Script 3.7. Checking needed modules.</emphasis>
de: <emphasis>Skript 3.7. Überprüfung benötigter Module.</emphasis>
