Repository: xhoy/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: de

source: On completing the job creation, all affected tickets by the job are listed. This list helps you verify that the job has the expected behavior. No changes are made to these tickets yet. The job will actually be activated only when it is saved into the job list.
de: Nachdem der Job gespeichert wurde, werden alle Tickets aufgeführt, die durch den Job verändert werden. Diese Auflistung dient zur Übersicht, ob der Job richtig funktioniert, es werden noch keine Veränderungen vorgenommen. Erst nach der Übernahme des Jobs in die Job-Liste, wird der Job aktiviert.

source: Admin email
de: Administrator-E-Mail

source: OTRS administrators can send messages to specific users or groups. The "Admin Notification" link on the Admin page opens the screen where the agents and groups that should be notified can be selected (see Figure 5.53 below).
de: Um als OTRS-Administrator eine Mail an bestimmte Benutzer (Agenten) oder Benutzergruppen im System zu versenden, folgen Sie dem Link "Admin Notification".

source: Admin notification
de: Administrator-Benachrichtigung

source: <emphasis>Figure 5.53. Admin notification.</emphasis>
de: <emphasis>Abb. 5.53. Administrator-Benachrichtigung.</emphasis>

source: It is possible to specify the sender, subject and body text of the notification. You can also select the agents, groups and roles who should receive the message.
de: Es wird ein Formular geladen, in das Sie die Absenderadresse, den Betreff und den Inhalt der Administratoren-Mitteilung eintragen können. Weiterhin können Sie aus der Tabelle auswählen, an welche Benutzer und / oder Benutzergruppen bzw. Rollen die Mitteilung gesendet werden soll.

source: Session management
de: Sitzungsverwaltung

source: You can see all logged in users and their session details by clicking the "Session Management" link in the admin area (see Figure 5.54 below).
de: Um eine Übersicht über die gerade im System angemeldeten Benutzer und deren Sitzungseigenschaften zu erhalten, folgen Sie dem Link "Sitzungsverwaltung" der Administrationsoberfläche.

source: <emphasis>Figure 5.54. Session management.</emphasis>
de: <emphasis>Abb. 5.54. Sitzungsverwaltung.</emphasis>

source: Some statistics about all active sessions are displayed, e.g. how many agents and customer users are logged in, number of active sessions. Any individual session can be removed by clicking on the <emphasis>Kill this session</emphasis> link on the right-hand side of the list. You also have the option to <emphasis>Kill all sessions</emphasis>, which can be useful if you'd like to bring the system down. Detailed information for every session is available, too (see Figure 5.55 below).
de: Innerhalb der Sitzungsverwaltung werden allgemeine Informationen zu allen Sitzungen im System ausgegeben, also z. B. wie viele Sitzungen gerade insgesamt aktiv sind oder wie viele Agenten- und Kunden-Sitzungen laufen, usw. Es besteht die Möglichkeit mit Hilfe des "Alle Sitzungen löschen"-Schalters die Sitzungen aller angemeldeten Benutzer zu beenden. Weiterhin können detaillierte Informationen für jede einzelne Sitzung abgerufen und einzelne Sitzungen gelöscht werden.

source: Session details
de: Sitzungsdetails

source: <emphasis>Figure 5.55. Session details.</emphasis>
de: <emphasis>Abb. 5.55. Sitzungsdetails.</emphasis>

source: The "System Log" link on the Admin page shows the log entries of the system, reverse chronologically sorted with most recent first (see Figure 5.56 below).
de: Der Link "System Log" ermöglicht es, die letzten Logeinträge des Ticket-Systems über die Weboberfläche einzusehen.

source: <emphasis>Figure 5.56. System Log.</emphasis>
de: <emphasis>Abb. 5.56. System Log.</emphasis>

source: Each line in the log contains a time stamp, the log priority, the system component and the log entry itself.
de: Ein Logeintrag setzt sich aus der Zeit, der Priorität, der betroffenen Systemkomponente und der eigentlichen Meldung zusammen.

source: System logs are available via the web interface only on Linux / Unix systems. On Windows systems, you can see the logs using a text editor and opening the file <filename>[install_dir]otrs\var\log\otrs.log</filename>.
de: Die System Logs können nur auf Unix- oder Linux-Systemen über das Web-Interface eingesehen werden, unter Windows-Betriebssystemen können Sie stattdessen die Datei <filename>[install_dir]otrs\var\log\otrs.log</filename> mit einem Text-Editor öffnen.

source: SQL queries via the SQL box
de: SQL-Abfragen mit Hilfe der SQL Box

source: The "SQL Box" link on the Admin page opens a screen that lets you query the content of the tables in the OTRS database (see Figure 5.57 below). It is not possible to change the content of the tables, only select queries are allowed.
de: Über den Link "SQL Box" kann eine Bildschirmmaske aufgerufen werden, die es ermöglicht direkt mit SQL-Statements den Inhalt von Tabellen der OTRS-Datenbank abzurufen. Es sind nur SELECT-Abfragen möglich, d.h. die Tabellen können auf diesem Weg nicht verändert werden.

source: <emphasis>Figure 5.57. SQL Box.</emphasis>
de: <emphasis>Abb. 5.57. SQL Box.</emphasis>

source: Package Manager
de: Paketverwaltung

source: Using the "Package Manager" link on the Admin page, you can install and manage packages that extend the functionality of OTRS (see Figure 5.58 below). See the <link linkend="application">Additional applications</link> section for a discussion on the extensions that are available from the OTRS repositories.
de: Mit der "Paketverwaltung" in der Administrationsoberfläche können Sie Pakete installieren und verwalten, die die Funktionalität von OTRS erweitern. Eine Liste von verfügbaren Erweiterungsmodulen von OTRS finden Sie unter <link linkend="application">Zusätzliche Applikationen</link>.

source: <emphasis>Figure 5.58. Package Manager.</emphasis>
de: <emphasis>Abb. 5.58. Paketverwaltung.</emphasis>

source: The Package Manager shows the OTRS addon packages you currently have installed on your server, together with their version numbers.
de: In der Paketverwaltung können Sie die bereits installierten Pakete mit ihrer Versionsinformation einsehen.

source: You can install packages from a remote host by selecting the repository in the <emphasis>Online Repository</emphasis> section, and clicking the <emphasis>Update repository information</emphasis> button. The available packages are displayed in the corresponding table. The right side of the screen shows the available packages. To install a package, click on <emphasis>Install</emphasis>. After installation, the package is displayed in the <emphasis>Local Repository</emphasis> section.
de: Sie können Pakete von einem entfernten Server installieren, indem Sie das Paketverzeichnis im Abschnitt <emphasis>Online-Paketverzeichnis</emphasis> auswählen und auf <emphasis>Verzeichnisinformation aktualisieren</emphasis> klicken. Die verfügbaren Pakete werden rechts tabellarisch dargestellt. Um eines zu installieren, klicken Sie auf "Installieren". Nach der Installation wird das Paket im Abschnitt <emphasis>Lokales Verzeichnis</emphasis> dargestellt.

source: To upgrade an installed package, the list of available packages in the online repository will show <emphasis>Upgrade</emphasis> in the Action column for any package that has a higher version than the one locally installed. Just click Upgrade and it will install the upgrade on your system.
de: Um ein installiertes Paket zu aktualisieren, können Sie die Funktion "Aktualisieren" benutzen, die bei installierten Paketen angezeigt wird, von denen eine neuere Version verfügbar ist. Klicken Sie einfach auf "Aktualisieren", und die neue Version wird in Ihrem System installiert.

source: In some cases, such as when your OTRS system is not connected to the Internet, you can also install packages you have downloaded to a local disk. Click the <emphasis>Browse</emphasis> button on the Actions side bar, and select the .opm file on your disk. Click <emphasis>Open</emphasis> and then <emphasis>Install Package</emphasis>. After installation the package is displayed in the <emphasis>Local Repository</emphasis> section. You can use the same steps for updating a package that is already installed.
de: In manchen Fällen, wenn beispielsweise ein OTRS-System nicht mit dem Internet verbunden ist, können Sie auch Pakete installieren, die lokal heruntergeladen wurden. Klicken Sie auf den <emphasis>Datei auswählen</emphasis>-Knopf in der "Aktionen"-Liste, und wählen Sie die .opm-Datei auf Ihrem Speichermedium aus. Verwenden Sie dann <emphasis>Paket installieren</emphasis>. Nach der Installation wird das Paket im Abschnitt <emphasis>Lokales Verzeichnis</emphasis> angezeigt. Auf dieselbe Weise können Sie ein bereits installiertes Paket aktualisieren.

source: In special cases, you might want to configure the Package Manager, e.g., to use a proxy or to use a local repository. Just take a look at the available options in SysConfig under <link linkend="Framework:Core::Package">Framework:Core::Package</link>.
de: In besonderen Fällen ist es erforderlich, die Paketverwaltung zu konfigurieren, zum Beispiel für die Verwendung eines Proxy-Servers, oder um auf ein lokales Verzeichnis zuzugreifen. Verwenden Sie dazu die Einstellungen unter <link linkend="Framework:Core::Package">Framework:Core::Package</link>.

source: System Configuration
de: Systemkonfiguration

source: OTRS config files
de: Die Konfigurationsdateien von OTRS

source: All OTRS configuration files are stored in the directory <filename>Kernel</filename> and in its subdirectories. There is no need to manually change any other file than <filename>Kernel/Config.pm</filename>, because the rest of the files will be changed when the system gets upgraded. Just copy the configuration parameters from the other files into <filename>Kernel/Config.pm</filename> and change them as per your needs. This file will never be touched during the upgrade process, so your manual settings are safe.
de: Alle Konfigurationsdateien des OTRS-Frameworks befinden sich innerhalb des Verzeichnisses <filename>Kernel</filename> bzw. in Unterverzeichnissen dieses Directorys. Bis auf die Datei <filename>Kernel/Config.pm</filename> sollten Sie keine Konfigurationsdatei manuell verändern, da alle anderen Dateien beim Updaten des Systems überschrieben werden und so Ihre eigenen Einstellungen verloren gehen. Übertragen Sie lediglich die Parameter aus den anderen Dateien nach <filename>Kernel/Config.pm</filename> und passen Sie die Parameter Ihren Wünschen entsprechend an.

source: The file <filename>Kernel/Config/Defaults.pm</filename> contains the parameters of the central OTRS framework. It defines all basic system settings such as the mail configuration, database connection, default charset and standard language. The file <filename>Kernel/Config/Files/Ticket.pm</filename> contains all configuration parameters for the trouble ticket system.
de: Die Datei <filename>Kernel/Config/Defaults.pm</filename> enthält die Konfigurationsparameter für den OTRS-Framework. In ihr finden Sie grundlegende Einstellungen wie die Mailkonfiguration, die Datenbankanbindung, Standardsprache o.ä. In der Datei<filename>Kernel/Config/Files/Ticket.pm</filename> sind alle Konfigurationsparameter für das Ticketsystem aufgeführt.

source: In the directory <filename>Kernel/Config/Files</filename> there are some other files that are parsed when the OTRS login page is accessed. If additional applications like the FAQ or the File Manager are installed, the configuration files for those can also be found in the mentioned path.
de: Das Verzeichnis <filename>Kernel/Config/Files</filename> enthält weitere Konfigurationsdateien, die beim Starten von OTRS eingelesen werden. Sind zusätzliche Module wie der Filemanager oder der Webmailer installiert, liegen die Konfigurationsdateien dieser Applikationen ebenfalls in <filename>Kernel/Config/Files</filename>.

source: If the OTRS web interface is accessed, all .xml files in the <filename>Kernel/Config/Files</filename> directory are parsed in alphabetical order, and the settings for the central framework and additional applications will be loaded. Afterwards, the settings in the two files <filename>Kernel/Config/Files/ZZZAAuto.pm</filename> and <filename>Kernel/Config/Files/ZZZAuto.pm</filename> will be evaluated. Both files are used by the graphical interface for system configuration and should never be changed manually. Lastly, the file <filename>Kernel/Config.pm</filename> that contains your individual settings and manually changed configuration parameters, will be parsed. Reading the configuration files in this order makes sure that your specific configuration settings are used by the system.
de: Wird die Web-Oberfläche von OTRS aufgerufen, werden die xml-Dateien in <filename>Kernel/Config/Files</filename> in alphabetischer Reihenfolge ausgelesen und die Einstellungen des Frameworks und der evtl. zusätzlich installierten Applikationen geladen. Anschließend werden die Einstellungen in den Dateien <filename>Kernel/Config/Files/ZZZAAuto.pm</filename> und <filename>Kernel/Config/Files/ZZZAuto.pm</filename> ausgewertet. Beide Dateien werden vom grafischen Konfigurations-Frontend angelegt und sollten auf keinem Fall manuell geändert werden. Zuletzt wird die Datei <filename>Kernel/Config.pm</filename> mit den von Ihnen individuell angepassten Konfigurationsparametern ausgewertet, so dass auf jeden Fall Ihre eigenen Einstellungen geladen werden.

source: Configuring the system through the web interface
de: Konfiguration des Systems mit Hilfe des grafischen Konfigurations-Frontends

source: Since OTRS 2.0, nearly all configuration parameters of the central framework or additional installed applications, can be changed easily with the graphical interface for system configuration. Log in as OTRS administrator and follow the SysConfig link on the Admin page to execute the new configuration tool (see Figure 6.1 below).
de: Seit OTRS 2.0 können nahezu alle Konfigurationsparameter des Frameworks oder der ggf. zusätzlich installierten Applikationen bequem über ein grafisches Frontend angepasst werden. Melden Sie sich als OTRS-Administrator an und folgen Sie im Administrationsbereich den Link "SysConfig", um das grafische Konfigurations-Frontend zu laden.

source: The graphical interface for system configuration
de: Die grafische System-Konfigurationsoberfläche

source: <emphasis>Figure 6.1. The graphical interface for system configuration.</emphasis>
de: <emphasis>Abb. 6.1. Die grafische System-Konfigurationsoberfläche.</emphasis>

source: OTRS currently has over 600 configuration parameters, and there are different ways to quickly access a specific one. With the full text search, all configuration parameters can be scanned for one or more keywords. The full text search not only searches through the names of the configuration parameters, but also through the descriptions of the parameters. This allows an element to be found easily even if its name is unknown.
de: Da OTRS mittlerweile über mehr als 600 verschiedene Konfigurationsparameter verfügt, bietet das Konfigurations-Frontend mehrere Möglichkeiten zur schnellen Auffindung der gewünschten Einstellung. Es kann über alle Konfigurationsparameter hinweg nach einem bestimmten Stichwort gesucht werden. Bei der Suche werden neben dem Namen des Konfigurationsparameters auch die Beschreibungen ausgewertet, eine Einstellung kann also auch gefunden werden, wenn ihr Name nicht bekannt ist.

source: Furthermore, all configuration parameters are sorted in main groups and sub groups. The main group represents the application that the configuration parameter belongs to, e.g. "Framework" for the central OTRS framework, "Ticket" for the ticket system, "FAQ" for the FAQ system, and so on. The sub groups can be accessed if the application is selected from the groups listbox and the "Select group" button is pressed.
de: Weiterhin wurden die verschiedenen Konfigurationsparameter in Haupt- und Untergruppen unterteilt. Die Hauptgruppe stellt die Applikation dar, für die der Konfigurationsparameter zuständig ist, also z. B. "Framework" für das OTRS-Framework oder "Ticket" für das Ticketsystem. Die Untergruppen einer Hauptgruppe können eingesehen werden, indem die Gruppe bzw. Applikation aus der dazu vorgesehenen Listbox ausgewählt und der "Zeigen"-Knopf gedrückt wird.

source: Every configuration parameter can be turned on or off via a checkbox. If the parameter is turned off, the system will ignore this parameter or use a default. It is possible to switch a changed configuration parameter back to the system default using the Reset link. The Update button submits all changes to system configuration parameters.
de: Für jeden einzelnen Konfigurationsparameter kann über eine Checkbox festgelegt werden, ob er vom System beachtet werden soll oder nicht. Wird eine Einstellung verändert, kann die Änderung mit Hilfe des "Aktualisieren"-Buttons übernommen werden. Eine Einstellung kann mit Hilfe des "Rücksetzen"-Schalters auf ihren Default-Wert zurückgesetzt werden.

source: If you want to save all the changes you made to your system's configuration, for example to setup a new installation quickly, you can use the "Export settings" button, which will create a .pm file. To restore your own settings, just press the "Import settings" and select the .pm created before.
de: Für die Sicherung aller von Ihnen vorgenommenen Änderungen, kann eine .pm-Datei heruntergeladen werden, die alle vom Standard abweichenden Konfigurationsparameter Ihres Systems enthält. Dieselbe Datei können Sie ebenfalls über die Konfigurationsoberfläche eines frisch installierten Systems zurück spielen und so alle Einstellungen wiederherstellen.

source: For security reasons, the configuration parameters for the database connection cannot be changed in the SysConfig section. They have to be set manually in <filename>Kernel/Config.pm</filename>.
de: Die Einstellungen für die Datenbankanbindung können aus Sicherheitsgründen nicht über das grafische Konfigurations-Frontend geändert werden und müssen manuell in die Datei <filename>Kernel/Config.pm</filename> eingefügt werden.

source: Sending/Receiving emails
de: E-Mails versenden/empfangen

source: Sending emails
de: E-Mails versenden

source: Via Sendmail (default)
de: Via Sendmail (Standard)

source: OTRS can send out emails via <ulink url="http://www.sendmail.org/">Sendmail</ulink>, <ulink url="http://www.postfix.org/">Postfix</ulink>, <ulink url="http://www.qmail.org">Qmail</ulink> or <ulink url="http://www.exim.org">Exim</ulink>). The default configuration is to use Sendmail and should work out-of-the-box.
de: OTRS ist in der Lage, E-Mails via Sendmail (z. B. <ulink url="http://www.sendmail.org/">Sendmail</ulink>, <ulink url="http://www.postfix.org/">Postfix</ulink>, <ulink url="http://www.qmail.org">Qmail</ulink> oder <ulink url="http://www.exim.org">Exim</ulink>) zu versenden. Die Standard-Konfiguration sollte gleich ohne Probleme funktionieren.

source: You can configure the sendmail settings via the graphical configuration frontend (Framework::Core::Sendmail)
de: Die Konfiguration kann über die <link linkend="adminarea-sysconfig">grafische Administrationsoberfläche</link> (Framework::Core::Sendmail) vorgenommen werden

source: Via SMTP server or smarthost
de: Via SMTP server/smarthost

source: OTRS can send emails via SMTP (<ulink url="http://www.ietf.org/rfc/rfc821.txt">Simple Mail Transfer Protocol / RFC 821</ulink>) or Secure SMTP. You will want to use this on non-UNIX platforms (e.g. Windows).
de: Wenn kein sendmail-Binary zur Verfügung steht, kann OTRS E-Mails via SMTP (<ulink url="http://www.ietf.org/rfc/rfc821.txt">Simple Mail Transfer Protocol / RFC 821</ulink>) oder Secure SMTP versenden. Diese Möglichkeit kann hauptsächlich auf Nicht-Unix-Plattformen (z. B. Win32) genutzt werden.

source: The SMTP server settings can be configured via the SysConfig (Framework::Core::Sendmail). If you don't see SMTPS available as an option, the required Perl modules are missing. In that case, please refer to <link linkend="installation-of-perl-modules">"Installation of Perl modules required for OTRS"</link> for instructions.
de: Die SMTP-Einstellungen können über die SysConfig vorgenommen werden (Framework::Core::Sendmail). Wenn SMTPS nicht als Option auftaucht, fehlen benötigte Perl-Module. Lesen Sie in diesem Fall im Abschnitt <link linkend="installation-of-perl-modules"> "Installation benötigter Perl-Module" </link> nach.

source: Receiving emails
de: E-Mails empfangen

source: Mail accounts configured via the OTRS GUI
de: E-Mail-Konten, die über die OTRS-Oberfläche konfiguriert werden

source: OTRS is able to receive emails from POP3, POP3S, IMAP, and IMAPS mail accounts.
de: OTRS ist in der Lage, E-Mails von POP3, POP3S, IMAP und IMAPS E-Mail-Konten zu empfangen.

source: Configure your mail accounts via the PostMaster Mail Accounts link on the Admin page.
de: Konfigurieren Sie Ihre Mail-Konten im Admin-Bereich von OTRS im Bereich "PostMaster Mail Account".

source: If a new mail account is to be created (see Figure 7.1 below), then it's mail server name, login name and password must be specified. Also, you need to select the mail server type, which can be POP3, POP3S, IMAP or IMAPS. If you don't see your server type available as an option, the required Perl modules are missing on your system. In that case, please refer to <link linkend="installation-of-perl-modules"> "Installation of Perl modules required for OTRS"</link> for instructions.
de: Beim Anlegen eines neuen Mail-Accounts muss der Mail-Server, ein Login und ein Kennwort angegeben werden. Zusätzlich muss der Mail-Server-Typ angegeben werden, es werden die Protokolle POP3, POP3S, IMAP und IMAPS unterstützt. Wenn Sie den gewünschten Typ nicht als Option zur Verfügung haben, fehlen benötigte Perl-Module. Lesen Sie in diesem Fall im Abschnitt <link linkend="installation-of-perl-modules"> "Installation benötigter Perl-Module" </link> nach.

source: Adding a mail account
de: Einen E-Mail-Account hinzufügen

source: <emphasis>Figure 7.1. Adding a mail account.</emphasis>
de: <emphasis>Abb 7.1. Einen E-Mail-Account hinzufügen.</emphasis>

source: If you select Yes for the value of the Trusted option, any X-OTRS headers attached to an incoming message are evaluated and executed. Because the X-OTRS header can execute some actions in the ticket system, you should set the Trusted option to Yes only for known senders. X-OTRS-Headers are used by the <link linkend="adminarea-postmasterfilter">filter module</link> in OTRS. The X-OTRS headers are explained <link linkend="table-of-x-otrs-headers">in this table</link> in more detail. Any postmaster filter rules created are executed, irrespective of the Trusted option's setting.
de: Wählen Sie für "Vertraut" den Wert "Ja" aus, dann werden die sog. X-OTRS-Header-Einträge ausgewertet und angewendet, sofern derartige Header-Einträge in einer abgerufenen Nachricht vorhanden sind. Da mit Hilfe der X-OTRS-Header einige Dinge am System beeinflusst werden können, sollten Sie "Vertraut" nur auf "Ja" setzen, wenn Sie genau wissen, von welchen Absendern die abgerufenen Nachrichten stammen. X-OTRS-Header werden vom <link linkend="adminarea-postmasterfilter">Modul für die Nachrichtenfilterung</link> in OTRS benutzt, die X-OTRS-Header werden <link linkend="table-of-x-otrs-headers">in dieser Tabelle</link> näher beschrieben.Eventuell eingerichtete Filterregeln werden auf jeden Fall abgearbietet, egal welcher Wert für "Vertraut" ausgewählt wurde.
