Repository: xhoy/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: de

source: If you don't want to login as OTRS administrator, just enter the user name and password for your normal agent account.
de: Wollen Sie sich nicht als OTRS-Administrator anmelden, geben Sie einfach den Benutzernamen und das Kennwort Ihres normalen OTRS-Accounts in die dafür vorgesehenen Eingabefelder ein.

source: In case you have forgotten your password, you can request the system for a new password. Simply press the link below the Login button, enter the mail address that is registered for your OTRS account into the input field, and press the Submit button (see Figure 4.4).
de: Falls Sie einmal ihr Kennwort vergessen haben sollten, können Sie sich automatisch vom System ein neues Kennwort an die Mailadresse schicken lassen, die für Ihren OTRS-Account im System hinterlegt ist. Geben Sie dazu im unteren Bereich des Login-Bildschirms den Benutzernamen Ihres Accounts an.

source: login.pl - Request new password
de: login.pl - Neues Passwort anfordern

source: <emphasis>Figure 4.4. Request new password.</emphasis>
de: <emphasis>Abb. 4.4. Neues Passwort anfordern.</emphasis>

source: The web interface - an overview
de: Agenten-Weboberfläche - ein Überblick

source: On successfully logging into the system, you are presented with the Dashboard page (see Figure 4.5 below). The Dashboard is completely customizable. It shows your locked tickets, allows direct access through menus to the queue, status and escalation views, and also holds options for creation of new phone and e-mail tickets. It also presents a quick summary of the tickets which are pending, escalated, new and open.
de: Nachdem Sie sich erfolgreich am System angemeldet haben, wird die Oberfläche von OTRS geladen. Standardmäßig befinden Sie sich nach der Anmeldung im Dashboard. Dieses Dashboard ist frei anpassbar. Zu Beginn zeigt es Ihre gesperrten Tickets und bietet Übersichten über fällige, eskalierte, neue und offene Tickets, neben anderen Dingen.

source: Screen after first successfull login
de: Bildschirm nach erster erfolgreicher Anmeldung

source: <emphasis>Figure 4.5. Dashboard of the agent interface.</emphasis>
de: <emphasis>Abb. 4.5. Dashboard der Agenten-Weboberfläche.</emphasis>

source: To improve clarity, the general web interface is separated into different areas. The top row of each page shows some general information such the current username, the logout button, icons listing the number of locked tickets with direct access to them, links to create a new phone/e-mail ticket, etc. There are also icons to go to the queue, status and escalation views.
de: Um die Übersichtlichkeit zu erhöhen, wurde die Oberfläche von OTRS in verschiedene Bereiche aufgeteilt. Oben finden sich einige allgemeine Informationen, wie der aktuelle Benutzername, der Abmelden-Knopf, und die Menge der gesperrten Tickets.

source: Below the icons row is the navigation bar. It shows a menu that enables you to navigate to different areas or modules of the system, lettng you execute some global actions. Clicking on the Dashboard button takes you to the dashboard which is the default start page after login. If you click on the Tickets button, you will get a submenu with options to change the ticket's view, create a new ticket (phone/e-mail) or search for a specific ticket. The Statistics button presents a menu that allows choosing from an overview of the registered statistics, creating a new one or importing an existing one. The Customers button leads you to the Customer Managment screen. By clicking the Admin button, you can access all the administrator modules, allowing you to create new agents, queues, etc. There is also a Search button to make ticket searches.
de: Unter diesen Icons befindet sich die Navigationsleiste. Sie zeigt Knöpfe, mit denen Sie die verschiedenen Bereiche und Module des Systems ansteuern und globale Aktionen auslösen können. Der Dashboard-Knopf führt zum Dashboard. Wenn sie den Ticket-Knopf drücken, erhalten Sie ein Untermenü mit verschiedenen Operationen, wie den Ticketansichten, der Erstellung neuer Tickets oder der Ticketsuche. Der Statistik-Knopf ist auch ein Menü, in dem Sie zwischen einer Übersicht der verfügbaren Statistiken, der Neuerstellung oder dem Import von Statistiken auswählen können. Der Kunden-Knopf führt in die Kunden-Verwaltung. Duch Druck auf den Admin-Knopf haben Sie Zugriff auf alle Administrator-Module, wo Sie z. B. neue Agenten, Queues usw. erstellen können. Zudem gibt es einen Suchknopf, mit dem man Suchvorgänge ausführen kann.

source: If any associated applications are also installed, e.g. the File Manager or the Web Mailer, buttons to reach these applications are also displayed.
de: Wenn Zusatzmodule installiert werden, dann können diese weitere Menüpunkte zur Navigation hinzufügen.

source: The red bar below the navigation bar shows different system messages. If you are logged in as OTRS administrator, you get a message warning you not to work using this system account.
de: Die rote Leiste unterhalb des Navigationsbereiches zeigt verschiedene Systemnachrichten an. Wenn Sie als OTRS-Administrator-Benutzer angemeldet sind, erhalten Sie hier den Hinweis, dass Sie mit diesem Benutzer nicht regulär arbeiten sollten.

source: Below the title of the section you are currently in, there are several subsections each in a separate box. These boxes can be relocated within the same column by clicking on and dragging the box header, and dropping them elsewhere.
de: Unter dem Haupttitel des Dashboards befinden sich verschiedene Unterbereiche, jeweils in einer eigenen Box. Diese können per Drag'n'Drop mit der Maus gezogen und losgelassen werden, um sie innerhalb ihrer Spalte neu anzuordnen. Dazu müssen Sie den Mauszeiger in den Kopfbereich der Boxen bewegen.

source: In the left column, you can see information on some tickets clasified as - reminder, escalated, new and open. In each of the categories, you are also able to see all tickets you are allowed to access, how many tickets you have locked and how many are located in "My Queues". "My Queues" are queues that you identify in your user configuration <link linkend="user-preferences">account preferences</link> as those you have a special interest in tracking.
de: In der linken Spalte sehen Sie Daten über Tickets, unterteilt in: Erinnerung, eskaliert, neu und offen. In jeder Kategorie können Sie alle Tickets sehen, auf die Sie Rechte haben, wie viele Tickets Sie gesperrt haben und wie viele in "Meine Queues" ligen. "Meine Queues" sind Queues die Sie in Ihrer <link linkend="user-preferences">Benutzer-Konfiguration</link> markieren können als Queues, die speziell überwacht werden sollen.

source: In the right column is the Settings button. Click on it to expand the section and see the various settings, as shown in Figure 4.6. You can then check or uncheck the individual settings options, and save your changes. This section is fixed, so you can not drag and drop it.
de: Auf der rechten Seite befindet sich der Bereich "Einstellungen". Klicken Sie darauf um den Bereich zu öffnen und die verschiedenen Einstellmöglichkeiten zu sehen. Sie können dann Einstellungen verändern und Ihre Änderungen speichern. Dieser Bereich ist fixiert und kann nicht mit der Maus verschoben werden.

source: Edit the Dashboard settings
de: Dashboard-Einstellungen bearbeiten

source: <emphasis>Figure 4.6. Dashboard Settings.</emphasis>
de: <emphasis>Abb. 3.5. Dashboard-Einstellungen.</emphasis>

source: Below the settings area, you can see a section with a graph of ticket activity over the past 7 days. Further below is a section showing Upcoming Events and OTRS News.
de: Unter den Einstellungen sehen Sie die Statistik der Tickets der letzten 7 Tage. Zudem gibt es einen Abschnitt für anstehende Ereignisse und Neuigkeiten zu OTRS.

source: Finally at the bottom of the page, the site footer is displayed (see Figure 4.7 below). It contains links to directly access the OTRS official website, or go to the Top of the page.
de: Im unteren Bildschirmbereich sehen sie die Fußzeile. Sie enthält u. A. Links auf die offizielle OTRS-Website und zum Seitenanfang.

source: Footer
de: Fußzeile

source: <emphasis>Figure 4.7. Footer.</emphasis>
de: <emphasis>Abb. 4.7. Fußzeile.</emphasis>

source: What is a queue?
de: Was verbirgt sich hinter dem Begriff Queue?

source: On many mail systems, it is common for all messages to flow into an Inbox file, where they remain stored. New messages are appended at the end of the Inbox file. The mail client program used to read and write mails reads this Inbox file and presents the content to the user.
de: Normalerweise werden E-Mails in einer INBOX gespeichert und verwaltet. Eine INBOX ist eine große Datei, in der alle E-Mails aneinandergereiht werden. Neue E-Mails werden einfach an das Ende der INBOX angehängt. Das E-Mail-Programm, welches Sie zum Lesen und Bearbeiten Ihrer Nachrichten benutzen, liest die INBOX-Datei aus und bereitet den Inhalt für Sie als Nutzer auf.

source: A queue in OTRS is somewhat comparable to an Inbox file, since it too can store many messages. A queue also has features beyond those of an Inbox mail file. As an OTRS agent or user, one needs to remember which queue a ticket is stored in. Agents can open and edit tickets in a queue, and also move tickets from one queue to another. But why would they move tickets?
de: Eine Queue in OTRS ist ein Mechanismus, mit dessen Hilfe viele Tickets gespeichert und verwaltet werden können, also auch eine Art INBOX. Als Anwender ist es völlig unwichtig zu wissen, wo oder wie das Ticket gesichert ist. Wichtig ist nur, zu wissen, welcher Queue das Ticket zugeordnet wurde. Anwender, also die sog. Agents (z. B. die Mitarbeiter ihrer Supportabteilung), können nun Tickets zwischen den Queues verschieben! Warum aber sollten sie das tun?

source: To explain it more practically, remember the example of Max's company described in an <link linkend="basic-tts-example">example of a ticket system</link>. Max installed OTRS in order to allow his team to better manage support for company customers buying video recorders.
de: Gehen wir zur praktischeren Erklärung noch mal von Max Mustermanns Unternehmen aus dem Abschnitt ein Beispiel für ein Trouble Ticket System aus. Max Mustermann hat nach seinem anfänglichen Support-Chaos OTRS installiert, und er und seine Mitarbeiter nutzen das System zur Bearbeitung der Anfragen für die Videorekorder.

source: One queue holding all requests is enough for this situation. However, after some time Max decides to also sell DVD recorders. Now, the customers have questions not only about the video recorder, but also the new product. More and more emails get into the one queue of Max's OTRS and it's hard to have a clear picture of what's happening.
de: Eine Queue, in die alle Anfragen einsortiert werden, reicht in dieser Situation aus. Nach einiger Zeit bringt Max Mustermann einen DVD-Player auf den Markt, der von den Kunden gut angenommen wird. Doch auch zu diesem Gerät laufen immer mehr Anfragen in das Ticket System und die Verwaltung der E-Mails mit einer Queue wird immer unübersichtlicher.

source: Max decides to restructure his support system, and adds two new queues. So now three queues are being used. Fresh new mails arriving at the ticket system are stored into the old queue titled "raw". Of the two new queues, one titled "video recorder" is for video recorder requests, while the other one titled "dvd recorder" is for dvd recorder requests.
de: Deshalb entschließt sich Max Mustermann nach einiger Zeit, sein Supportsystem weiter zu optimieren. Er richtet zwei neue Queues ein, so dass er nun insgesamt drei Queues in OTRS definiert hat. Die erste und schon länger vorhandene Queue wird zur Eingangsqueue, in die erst mal alle Mails wandern, umfunktioniert. Daneben gibt es jetzt noch die neuen Queues "Videorekorder" und "DVD-Player".

source: Max asks Sandra to watch the "raw" queue and sort (dispatch) the mails either into "video recorder" or "dvd recorder" queue, depending on the customer request. John only has access to the "video recorder" queue, while Joe can only answer tickets in the "dvd recorder" queue. Max is able to edit tickets in all queues.
de: Herr Mustermann beauftragt Frau Müller als sog. Dispatcherin tätig zu werden und mehrmals am Tag die Mails in der Eingangsqueue zu sichten und sie, je nach Inhalt, der Queue "Videorecorder" oder der Queue "DVD-Player" zuzuordnen. Herr Meier bearbeitet ab jetzt nur noch die Anfragen in der Videorekorder-Queue, Herr Schulze geht nur noch auf die Anfragen innerhalb der DVD-Player-Queue ein. Beide haben auf die jeweils anderen zwei Queues keinen Zugriff. Herr Mustermann kümmert sich weiter wie gewohnt um alle Arten von Anfragen und darf auf alle drei Queues zugreifen.

source: OTRS supports access management for users, groups and roles, and it is easy to setup queues that are accessible only to some user accounts. Max could also use another way to get his requests into the different queues, with filter rules. Else, if two different mail addresses are used, Sandra only has to dispatch those emails into the two other queues, that can't be dispatched automatically.
de: Weil OTRS Zugriffskontrolle für Agenten, Gruppen und Rollen unterstützt, ist es denkbar einfach, Queues einzurichten, die nur von bestimmten Agenten benutzt werden können. Herr Mustermann könnte auch ein anderes Szenario umsetzen, um seine Tickets in die verschiedenen Queues zu bekommen, mit Hilfe von Filterregeln, oder falls zwei verschidenene E-Mail-Adressen verwendet werden, müsste Frau Müller nur die E-Mails in die Queues zuordnen, die nicht automatisch einsortiert werden konnten.

source: Sorting your incoming messages into different queues helps you to keep the support system structured and tidy. Because your agents are arranged into different groups with different access rights on queues, the system can be optimized even further. Queues can be used to define work flow processes or to create the structure of a company. Max could implement, for example, another queue called "sales", which could contain the sub queues "requests", "offers", "orders", "billing", etc. Such a queue structure could help Max to optimize his order transactions.
de: Das Sortieren von Mails in verschiedene Queues schafft also Ordnung und mehr Übersicht in der täglichen Mailflut, deshalb sind Queues sehr wichtig für OTRS. Durch die Einteilung der Mitarbeiter (agents) in verschiedene Benutzergruppen mit differenzierten Zugriffsrechten auf die einzelnen Queues, kann die Abarbeitung der Anfragen weiter optimiert werden. Mit Hilfe von Queues können Sie die Struktur Ihres Unternehmens abbilden bzw. einzelne Geschäftsvorgänge abgrenzen. So könnte Max Mustermann neben seinem Support-Queues für die verschiedenen Geräte für Bestellungen eine Queue mit dem Namen "Sales" anlegen und als Unter-Queues "Anfragen", "Angebote", "Bestellungen" usw. definieren, um den Bestellvorgang zu optimieren.

source: Improved system structures, such as through the proper design of queues, can lead to significant time and cost savings. Queues can help to optimize the processes in your company.
de: Je besser und strukturierter ein Support- system organisiert ist, desto weniger Zeit und letztlich auch finanzielle Mittel müssen dafür aufgebracht werden. Queues und Unter-Queues helfen bei der Strukturierung bzw. bei der Abbildung von Abläufen.

source: User preferences
de: Benutzereinstellungen

source: OTRS users such as customers, agents and the OTRS administrator can configure their account preferences as per their needs. Agent can access the configuration screen by clicking on their login name at the top right corner of the web interface (see Figure 4.8 below), and customers must click on the "Preferences" link (see Figure 4.9 below).
de: Die Einstellungen eines Accounts lassen sich mit Hilfe der Benutzereinstellungen den eigenen Wünschen entsprechend anpassen. Dabei spielt keine Rolle, ob man als Mitarbeiter, Kunde oder Administrator am System angemeldet ist. Die Benutzereinstellungen sind über den Link auf den Benutzernamen erreichbar, Kunden müssen den "Einstellungen"-Link verwenden.

source: Account Preference screen for Agents
de: Persönliche Benutzer-Einstellungen für Agenten

source: <emphasis>Figure 4.8. Agent's personal preferences.</emphasis>
de: <emphasis>Abb. 4.8. Benutzereinstellungen des Agenten.</emphasis>

source: An agent can configure 3 different categories of preferences: user profile, email settings and other settings. The default posibilities are:
de: Ein Agent kann 3 verschiedene Kategorien von Einstellungen vornehmen: Benutzerprofil, E-Mail-Einstellungen und andere Einstellungen. Folgende Einstellungen sind möglich:

source: User Profile
de: Benutzerprofil

source: Change the current password.
de: Aktuelles Passwort ändern.

source: Adjust the interface language.
de: Sprache der Benutzeroberfläche wechseln.

source: Switch the frontend skin.
de: Oberflächen-Skin auswählen.

source: Shift the frontend theme.
de: Oberflächen-Theme auswählen.

source: Activate and configure the out-of-office time.
de: Abwesenheitszeit aktivieren und konfigurieren.

source: Email Settings
de: E-Mail-Einstellungen

source: Select events that trigger email notifications to the agent.
de: Ereignisse auswählen, bei denen eine E-Mail-Benachrichtigung durch das System erfolgen soll.

source: Other Settings
de: Andere Einstellungen

source: Select the queues you want to monitor in "My Queues".
de: Wählen Sie die Queues aus, die sie in "Meine Queues" überwachen wollen.

source: Set the refresh period for the queue view.
de: Aktualisierungszeit der Queue-Ansicht einstellen.

source: Set the screen to be displayed after a ticket is created.
de: Bildschirm auswählen, der nach Erstellung eines Tickets angezeigt wird.

source: Account preferences screen for customers
de: Persönliche Benutzereinstellungen für Kunden

source: <emphasis>Figure 4.8. Customer's personal preferences.</emphasis>
de: <emphasis>Abb. 4.8. Benutzereinstellungen des Kunden.</emphasis>

source: A customer can select the web interface language, set the refresh interval for the ticket overview, and choose the maximum amount of shown tickets. It is also possible to set a new password.
de: Ein Kunde kann die Sprache der Benutzeroberfläche wechseln, die Aktualisierungszeit der Ticketübersichten verändern und die max. Anzahl angezeigter Tickets pro Seite einstellen. Zusätzlich kann das Passwort geändert werden.

source: The ADMIN area of OTRS
de: Der Administrationsbereich von OTRS

source: OTRS administrators use the Admin page on the OTRS web interface to configure the system - adding agents, customers and queues, ticket and mail settings, installing additional packages such as FAQ and ITSM, and much more.
de: OTRS-Administratioren verwenden die Admin-Seite in der Weboberfläche von OTRS um das System zu konfigurieren - Agenten, Kunden und Queues hinzufügen, Ticket- und E-Mail-Einstellungen ändern und Zusatzpakete wie FAQ und ITSM installieren und vieles mehr ist damit möglich.

source: Agents who are members of the <emphasis>admin</emphasis> group can access the Admin area by clicking the <emphasis>Admin</emphasis> link in the navigation bar (see Figure 5.1 below). The rest of the agents won't see this link.
de: Agenten, die Mitglied der "admin"-Gruppe sind, können über den Link "Admin" innerhalb der Navigationsleiste der Agenten-Weboberfläche den Administrationsbereich von OTRS aufrufen.

source: The OTRS Admin screen
de: Der OTRS-Admin-Bildschirm

source: <emphasis>Figure 5.1. OTRS Admin screen.</emphasis>
de: <emphasis>Abb. 3.1. OTRS Administrationsbereich.</emphasis>

source: Agents, Groups and Roles
de: Benutzer, Gruppen und Rollen

source: Agents
de: Benutzer

source: By clicking the link <emphasis>Agents</emphasis>, you get access to the agent management screen of OTRS (see Figure 5.2 below). Administrators can add, change or deactivate agent accounts. Administrators can also manage agent preferences, for instance the language and notification settings for their interface.
de: Über den Link "Benutzer" gelangen Sie in die Benutzerverwaltung von OTRS. Hier können Sie Benutzer anlegen, bearbeiten und deaktivieren. Weiterhin lassen sich einige grundlegende Einstellungen für den Benutzer festlegen, z. B. die Oberflächensprache oder das Anzeigeschema.

source: An OTRS agent account may be deactivated but not deleted. Deactivation is done by setting the Valid flag to <emphasis>invalid</emphasis> or <emphasis>invalid-temporarily</emphasis>.
de: Ein OTRS-Benutzer kann deaktiviert, aber nicht gelöchst werden. Um einn Benutzer zu deaktivieren, setzen Sie die Einstellung für "Gültig" auf "ungültig" oder "ungültig-temporär".

source: Agent management
de: Benutzer-Verwaltung

source: <emphasis>Figure 5.2. Agent management.</emphasis>
de: <emphasis>Abb. 5.2. Benutzerverwaltun.</emphasis>

source: To register an agent, click on the "Add agent" button, type all the needed data and press the Submit button at the bottom of the screen, as shown in Figure 5.3.
de: Um einen neuen Benutzer anzulegen, klicken Sie auf den "Benutzer hinzufügen"-Knopf, geben Sie die benötigten Daten an und klicken Sie auf Absenden.

source: Adding an agent
de: Einen Benutzer hinzufügen

source: <emphasis>Figure 5.3. Adding a new agent.</emphasis>
de: <emphasis>Abb. 5.3. Hinzufügen einens Benutzers.</emphasis>

source: After the new agent account has been created, you should make the agent a member of one or more groups or roles. Information about groups and roles is available in the <link linkend="adminarea-groups">Groups</link> and <link linkend="adminarea-roles">Roles</link> sections of this chapter.
de: Nachdem Sie einen neuen Benutzer angelegt haben, muss dieser einer Gruppe bzw. einer Rolle zugewiesen werden. Sie werden nach dem Anlegen eines neuen Benutzers automatisch auf die Bildschirmmaske für die Zuweisung eines Benutzers in Gruppen weitergeleitet. Weitere Informationen über Gruppen und Rollen finden Sie in den Abschnitten <link linkend="adminarea-groups">Gruppen</link> und <link linkend="adminarea-roles">Rollen</link> dieses Kapitels.

source: Groups
de: Gruppen

source: Every agent's account should belong to at least one group or role. In a brand new installation, there are three pre-defined groups available, as shown in Table 5-1.
de: Jeder Mitarbeiter mit einem Account im OTRS, sollte mindestens einer Benutzergruppe angehören. In einer Neuinstallation sind drei vordefinierte Gruppen verfügbar.

source: Default groups available on a fresh OTRS installation
de: Standardmäßig vorhandene Gruppen in OTRS

source: Group
de: Gruppe

source: Allowed to perform administrative tasks in the system.
de: Gruppe für die Benutzer mit Administrationsrechten.

source: Qualified to access the stats module of OTRS and generate statistics.
de: Benutzer in dieser Gruppe dürfen lesend (ro) oder schreibend (rw) auf das Statistikmodul von OTRS zugreifen, d.h. sie können Statistiken einsehen oder auch erstellen.

source: Agents should belong to this group, with read and write permissions. They can then access all functions of the ticket system.
de: Dies ist die Gruppe, in die normale Mitarbeiter aufgenommen und mit den kompletten Rechten ausgestattet werden sollten. Dadurch wird für die Mitarbeiter das normale Arbeiten im System ermöglicht, der Zugriff auf alle Funktionen rund um Tickets ist gegeben.

source: In a brand new OTRS installation, the group <emphasis>users</emphasis> is initially empty. The agent 'root@localhost' belongs by default to the admin and stats groups.
de: In einer neuen Installation ist die Gruppe "users" leer und der Benutzer "root@localhost" ist Mitglied der Gruppen "admin" und "stats".
